/** Auto-generated from OSM review data. Do not manually edit. */
import type { CampusSeed } from './jinnan-seed'

export const campusModel: CampusSeed = {
  "meta": {
    "name": "南开大学津南校区 · OSM 白模导入",
    "status": "osm-import",
    "source": "OSM import from 2026-09-19T08:44:40.648Z; geometry needs campus-side verification before publication.",
    "bounds": {
      "minX": -90,
      "maxX": 2294.76,
      "minZ": -1660.06,
      "maxZ": 90
    }
  },
  "buildings": [
    {
      "id": "osm-building-616829077",
      "name": "南开大学津南校区中心图书馆",
      "aliases": [
        "南开大学津南校区中心图书馆"
      ],
      "category": "library",
      "height": 25.2,
      "footprint": [
        [
          1298.21,
          -439.63
        ],
        [
          1218.07,
          -446.16
        ],
        [
          1126.53,
          -453.61
        ],
        [
          1130.75,
          -502.53
        ],
        [
          1216.02,
          -494.9
        ],
        [
          1302.43,
          -487.16
        ]
      ],
      "zone": "南部 · 东部校区",
      "verified": "osm-import"
    },
    {
      "id": "osm-building-616829078",
      "name": "综合业务西楼",
      "aliases": [
        "综合业务西楼"
      ],
      "category": "service",
      "height": 22,
      "footprint": [
        [
          1066.02,
          -432.64
        ],
        [
          1061.79,
          -371.14
        ],
        [
          1132.16,
          -365.55
        ],
        [
          1137.79,
          -425.65
        ]
      ],
      "zone": "南部 · 西部校区",
      "verified": "osm-import"
    },
    {
      "id": "osm-building-616829079",
      "name": "综合业务东楼",
      "aliases": [
        "综合业务东楼"
      ],
      "category": "service",
      "height": 22,
      "footprint": [
        [
          1284.14,
          -414.46
        ],
        [
          1279.91,
          -352.97
        ],
        [
          1348.87,
          -347.38
        ],
        [
          1354.5,
          -407.48
        ]
      ],
      "zone": "南部 · 东部校区",
      "verified": "osm-import"
    },
    {
      "id": "osm-building-616829080",
      "name": "大通学生活动中心",
      "aliases": [
        "大通学生活动中心"
      ],
      "category": "service",
      "height": 22,
      "footprint": [
        [
          1518.57,
          -750.93
        ],
        [
          1501.36,
          -706.2
        ],
        [
          1476.78,
          -727.95
        ],
        [
          1463.78,
          -713.46
        ],
        [
          1491.35,
          -689.05
        ],
        [
          1487.19,
          -670.4
        ],
        [
          1463.66,
          -645.61
        ],
        [
          1470.92,
          -638.81
        ],
        [
          1480.55,
          -629.8
        ],
        [
          1502.25,
          -652.65
        ],
        [
          1509.88,
          -619.37
        ],
        [
          1532.13,
          -624.41
        ],
        [
          1525.26,
          -654.37
        ],
        [
          1560.19,
          -642.55
        ],
        [
          1568.3,
          -666.2
        ],
        [
          1539.81,
          -675.84
        ],
        [
          1561.21,
          -683.02
        ],
        [
          1555.88,
          -698.66
        ],
        [
          1542.36,
          -694.12
        ],
        [
          1533.88,
          -691.28
        ],
        [
          1551.96,
          -738.25
        ]
      ],
      "zone": "南部 · 东部校区",
      "verified": "osm-import"
    },
    {
      "id": "osm-building-954128561",
      "name": "留学生公寓A",
      "aliases": [
        "留学生公寓A"
      ],
      "category": "residence",
      "height": 27,
      "footprint": [
        [
          658.79,
          -1189.46
        ],
        [
          701.03,
          -1175.16
        ],
        [
          685.48,
          -1131.13
        ],
        [
          675.86,
          -1134.35
        ],
        [
          642.07,
          -1145.66
        ],
        [
          651.19,
          -1169.55
        ]
      ],
      "zone": "北部 · 西部校区",
      "verified": "osm-import"
    },
    {
      "id": "osm-building-954128563",
      "name": "南开大学医院",
      "aliases": [
        "南开大学医院"
      ],
      "category": "service",
      "height": 22,
      "footprint": [
        [
          758.19,
          -1351.59
        ],
        [
          778.85,
          -1351.37
        ],
        [
          792.54,
          -1336.61
        ],
        [
          792.54,
          -1332.46
        ],
        [
          799.74,
          -1331.78
        ],
        [
          799.27,
          -1323.94
        ],
        [
          787.43,
          -1324.17
        ],
        [
          787.43,
          -1315.18
        ],
        [
          763.07,
          -1316.1
        ],
        [
          763.52,
          -1322.09
        ],
        [
          758.19,
          -1322.09
        ],
        [
          758.19,
          -1332.46
        ],
        [
          748.68,
          -1332.93
        ],
        [
          748.91,
          -1340.53
        ],
        [
          757.96,
          -1341.22
        ]
      ],
      "zone": "北部 · 西部校区",
      "verified": "osm-import"
    },
    {
      "id": "osm-building-1246084822",
      "name": "未命名建筑 007",
      "aliases": [
        "未命名建筑"
      ],
      "category": "academic",
      "height": 24,
      "footprint": [
        [
          2006.98,
          -190.49
        ],
        [
          2013.41,
          -189.81
        ],
        [
          2009.23,
          -150.62
        ],
        [
          2002.8,
          -151.3
        ]
      ],
      "zone": "南部 · 东部校区",
      "verified": "osm-import"
    },
    {
      "id": "osm-building-1246084823",
      "name": "未命名建筑 008",
      "aliases": [
        "未命名建筑"
      ],
      "category": "academic",
      "height": 24,
      "footprint": [
        [
          2013.58,
          -155.46
        ],
        [
          2035.41,
          -153.5
        ],
        [
          2034.92,
          -148.08
        ],
        [
          2013.09,
          -150.03
        ]
      ],
      "zone": "南部 · 东部校区",
      "verified": "osm-import"
    },
    {
      "id": "osm-building-1246084824",
      "name": "未命名建筑 009",
      "aliases": [
        "未命名建筑"
      ],
      "category": "academic",
      "height": 24,
      "footprint": [
        [
          2001.41,
          -113.14
        ],
        [
          1999.44,
          -94.35
        ],
        [
          1993.28,
          -94.98
        ],
        [
          1995.26,
          -113.78
        ]
      ],
      "zone": "南部 · 东部校区",
      "verified": "osm-import"
    },
    {
      "id": "osm-building-1246084825",
      "name": "未命名建筑 010",
      "aliases": [
        "未命名建筑"
      ],
      "category": "academic",
      "height": 24,
      "footprint": [
        [
          2012.43,
          -139.65
        ],
        [
          2034.25,
          -137.7
        ],
        [
          2033.62,
          -130.74
        ],
        [
          2011.8,
          -132.7
        ]
      ],
      "zone": "南部 · 东部校区",
      "verified": "osm-import"
    },
    {
      "id": "osm-building-1246084826",
      "name": "未命名建筑 011",
      "aliases": [
        "未命名建筑"
      ],
      "category": "academic",
      "height": 24,
      "footprint": [
        [
          2004.54,
          -106.34
        ],
        [
          2005.13,
          -112.24
        ],
        [
          2042.62,
          -108.55
        ],
        [
          2042.03,
          -102.65
        ]
      ],
      "zone": "南部 · 东部校区",
      "verified": "osm-import"
    },
    {
      "id": "osm-building-1246084827",
      "name": "未命名建筑 012",
      "aliases": [
        "未命名建筑"
      ],
      "category": "academic",
      "height": 24,
      "footprint": [
        [
          2048.06,
          -84.2
        ],
        [
          2047.02,
          -75.37
        ],
        [
          1983.65,
          -82.74
        ],
        [
          1984.7,
          -91.59
        ]
      ],
      "zone": "南部 · 东部校区",
      "verified": "osm-import"
    },
    {
      "id": "osm-building-1246084828",
      "name": "未命名建筑 013",
      "aliases": [
        "未命名建筑"
      ],
      "category": "academic",
      "height": 24,
      "footprint": [
        [
          1988.52,
          -200.17
        ],
        [
          1987.36,
          -190.88
        ],
        [
          1967.76,
          -193.31
        ],
        [
          1968.92,
          -202.59
        ]
      ],
      "zone": "南部 · 东部校区",
      "verified": "osm-import"
    },
    {
      "id": "osm-building-1246084829",
      "name": "未命名建筑 014",
      "aliases": [
        "未命名建筑"
      ],
      "category": "academic",
      "height": 24,
      "footprint": [
        [
          1817.12,
          -221.27
        ],
        [
          1814.56,
          -183.57
        ],
        [
          1808.25,
          -184
        ],
        [
          1810.8,
          -221.69
        ]
      ],
      "zone": "南部 · 东部校区",
      "verified": "osm-import"
    },
    {
      "id": "osm-building-1246084830",
      "name": "未命名建筑 015",
      "aliases": [
        "未命名建筑"
      ],
      "category": "academic",
      "height": 24,
      "footprint": [
        [
          1825.01,
          -182.88
        ],
        [
          1819.03,
          -183.31
        ],
        [
          1821.69,
          -219.62
        ],
        [
          1827.68,
          -219.19
        ]
      ],
      "zone": "南部 · 东部校区",
      "verified": "osm-import"
    },
    {
      "id": "osm-building-1246084831",
      "name": "未命名建筑 016",
      "aliases": [
        "未命名建筑"
      ],
      "category": "academic",
      "height": 24,
      "footprint": [
        [
          1842.53,
          -217
        ],
        [
          1849.21,
          -216.45
        ],
        [
          1847.46,
          -195.69
        ],
        [
          1840.79,
          -196.25
        ]
      ],
      "zone": "南部 · 东部校区",
      "verified": "osm-import"
    },
    {
      "id": "osm-building-1246084832",
      "name": "未命名建筑 017",
      "aliases": [
        "未命名建筑"
      ],
      "category": "academic",
      "height": 24,
      "footprint": [
        [
          1834.53,
          -226.46
        ],
        [
          1835.07,
          -232.3
        ],
        [
          1851.32,
          -230.8
        ],
        [
          1850.77,
          -224.95
        ]
      ],
      "zone": "南部 · 东部校区",
      "verified": "osm-import"
    },
    {
      "id": "osm-building-1246084833",
      "name": "未命名建筑 018",
      "aliases": [
        "未命名建筑"
      ],
      "category": "academic",
      "height": 24,
      "footprint": [
        [
          1834.64,
          -182.3
        ],
        [
          1828.56,
          -182.89
        ],
        [
          1832.04,
          -218.85
        ],
        [
          1838.13,
          -218.27
        ]
      ],
      "zone": "南部 · 东部校区",
      "verified": "osm-import"
    },
    {
      "id": "osm-building-1246084834",
      "name": "未命名建筑 019",
      "aliases": [
        "未命名建筑"
      ],
      "category": "academic",
      "height": 24,
      "footprint": [
        [
          1817.35,
          -177.23
        ],
        [
          1841.37,
          -175.04
        ],
        [
          1840.56,
          -166.21
        ],
        [
          1816.54,
          -168.4
        ]
      ],
      "zone": "南部 · 东部校区",
      "verified": "osm-import"
    },
    {
      "id": "osm-building-1246084835",
      "name": "未命名建筑 020",
      "aliases": [
        "未命名建筑"
      ],
      "category": "academic",
      "height": 24,
      "footprint": [
        [
          1798.09,
          -178.96
        ],
        [
          1813.4,
          -177.58
        ],
        [
          1812.57,
          -168.46
        ],
        [
          1797.25,
          -169.84
        ]
      ],
      "zone": "南部 · 东部校区",
      "verified": "osm-import"
    },
    {
      "id": "osm-building-1376694362",
      "name": "南开大学专家公寓",
      "aliases": [
        "南开大学专家公寓"
      ],
      "category": "residence",
      "height": 27,
      "footprint": [
        [
          498.81,
          -1108.74
        ],
        [
          490.58,
          -1085.75
        ],
        [
          535.72,
          -1069.79
        ],
        [
          526.02,
          -1042.7
        ],
        [
          482.23,
          -1058.18
        ],
        [
          477.83,
          -1045.9
        ],
        [
          556.26,
          -1018.18
        ],
        [
          577.84,
          -1078.38
        ],
        [
          560.42,
          -1084.54
        ],
        [
          543.01,
          -1035.92
        ],
        [
          531.54,
          -1039.97
        ],
        [
          549.72,
          -1090.75
        ]
      ],
      "zone": "北部 · 西部校区",
      "verified": "osm-import"
    },
    {
      "id": "osm-building-1412230608",
      "name": "学二食堂",
      "aliases": [
        "学二食堂"
      ],
      "category": "service",
      "height": 22,
      "footprint": [
        [
          672.82,
          -432.43
        ],
        [
          728.98,
          -418.59
        ],
        [
          734.93,
          -442.37
        ],
        [
          739.97,
          -462.52
        ],
        [
          740.49,
          -464.59
        ],
        [
          684.33,
          -478.45
        ]
      ],
      "zone": "南部 · 西部校区",
      "verified": "osm-import"
    },
    {
      "id": "osm-building-1412230609",
      "name": "学一食堂",
      "aliases": [
        "学一食堂"
      ],
      "category": "service",
      "height": 22,
      "footprint": [
        [
          816.35,
          -1122.48
        ],
        [
          802.15,
          -1141.92
        ],
        [
          789.69,
          -1158.97
        ],
        [
          797.79,
          -1164.81
        ],
        [
          804.37,
          -1190.41
        ],
        [
          779.46,
          -1196.8
        ],
        [
          779.54,
          -1220.42
        ],
        [
          815.88,
          -1212.58
        ],
        [
          814.81,
          -1207.43
        ],
        [
          863.85,
          -1194.4
        ],
        [
          857.38,
          -1168.17
        ],
        [
          851.95,
          -1148.13
        ]
      ],
      "zone": "北部 · 西部校区",
      "verified": "osm-import"
    },
    {
      "id": "osm-building-1430904058",
      "name": "A区",
      "aliases": [
        "A区"
      ],
      "category": "academic",
      "height": 24,
      "footprint": [
        [
          1166.74,
          -588.86
        ],
        [
          1066.65,
          -597.21
        ],
        [
          1071.11,
          -650.03
        ],
        [
          1084.72,
          -648.89
        ],
        [
          1081.92,
          -615.89
        ],
        [
          1156.58,
          -609.64
        ],
        [
          1168.41,
          -608.64
        ]
      ],
      "zone": "南部 · 东部校区",
      "verified": "osm-import"
    },
    {
      "id": "osm-building-1430904059",
      "name": "B区",
      "aliases": [
        "B区"
      ],
      "category": "academic",
      "height": 24,
      "footprint": [
        [
          1197.13,
          -640.02
        ],
        [
          1171.05,
          -642.08
        ],
        [
          1165,
          -642.56
        ],
        [
          1158.96,
          -643.03
        ],
        [
          1084.72,
          -648.89
        ],
        [
          1071.11,
          -650.03
        ],
        [
          1074.04,
          -686.66
        ],
        [
          1183.56,
          -678.02
        ],
        [
          1200.03,
          -676.89
        ]
      ],
      "zone": "南部 · 东部校区",
      "verified": "osm-import"
    },
    {
      "id": "osm-building-1430904060",
      "name": "未命名建筑 026",
      "aliases": [
        "未命名建筑"
      ],
      "category": "academic",
      "height": 24,
      "footprint": [
        [
          664.61,
          -397.92
        ],
        [
          673.68,
          -395.51
        ],
        [
          737.39,
          -378.56
        ],
        [
          742.33,
          -395
        ],
        [
          738.73,
          -395.97
        ],
        [
          724.18,
          -399.85
        ],
        [
          668.74,
          -414.64
        ]
      ],
      "zone": "南部 · 西部校区",
      "verified": "osm-import"
    },
    {
      "id": "osm-building-1430918551",
      "name": "木斋图书馆",
      "aliases": [
        "木斋图书馆"
      ],
      "category": "library",
      "height": 40,
      "footprint": [
        [
          570.11,
          -887.17
        ],
        [
          548.31,
          -823.23
        ],
        [
          564.47,
          -817.79
        ],
        [
          570.75,
          -836.22
        ],
        [
          591.19,
          -829.34
        ],
        [
          599.19,
          -852.78
        ],
        [
          576.97,
          -860.27
        ],
        [
          584.5,
          -882.34
        ]
      ],
      "zone": "北部 · 西部校区",
      "verified": "osm-import"
    },
    {
      "id": "osm-building-1430918553",
      "name": "秀山堂",
      "aliases": [
        "秀山堂"
      ],
      "category": "academic",
      "height": 24,
      "footprint": [
        [
          596.12,
          -800.26
        ],
        [
          585.06,
          -768.51
        ],
        [
          598.28,
          -763.97
        ],
        [
          599.62,
          -767.83
        ],
        [
          632.1,
          -756.66
        ],
        [
          630.67,
          -752.58
        ],
        [
          641.98,
          -748.7
        ],
        [
          652.66,
          -779.37
        ],
        [
          640.26,
          -783.64
        ],
        [
          638.98,
          -779.97
        ],
        [
          607.06,
          -790.95
        ],
        [
          608.79,
          -795.9
        ]
      ],
      "zone": "南部 · 西部校区",
      "verified": "osm-import"
    },
    {
      "id": "osm-building-1430918554",
      "name": "思源堂",
      "aliases": [
        "思源堂"
      ],
      "category": "academic",
      "height": 24,
      "footprint": [
        [
          622.7,
          -875.25
        ],
        [
          636.3,
          -870.81
        ],
        [
          638.01,
          -875.98
        ],
        [
          648.29,
          -872.64
        ],
        [
          645.87,
          -865.31
        ],
        [
          660.09,
          -860.85
        ],
        [
          662.76,
          -868.46
        ],
        [
          671.56,
          -865.45
        ],
        [
          669.44,
          -859.05
        ],
        [
          683.52,
          -854.47
        ],
        [
          692.91,
          -882.94
        ],
        [
          670.01,
          -890.4
        ],
        [
          667.75,
          -897.45
        ],
        [
          658.71,
          -900.32
        ],
        [
          652.21,
          -895.55
        ],
        [
          631.67,
          -902.42
        ]
      ],
      "zone": "北部 · 西部校区",
      "verified": "osm-import"
    },
    {
      "id": "osm-building-1433084261",
      "name": "C区",
      "aliases": [
        "C区"
      ],
      "category": "academic",
      "height": 24,
      "footprint": [
        [
          1079.47,
          -725.16
        ],
        [
          1080.36,
          -737.68
        ],
        [
          1088.56,
          -736.91
        ],
        [
          1123.18,
          -734.28
        ],
        [
          1124.78,
          -757.28
        ],
        [
          1167.36,
          -754.23
        ],
        [
          1176.66,
          -753.35
        ],
        [
          1205.42,
          -751.74
        ],
        [
          1202.72,
          -715.7
        ],
        [
          1186.25,
          -716.83
        ]
      ],
      "zone": "南部 · 东部校区",
      "verified": "osm-import"
    },
    {
      "id": "osm-building-1433084263",
      "name": "未命名建筑 031",
      "aliases": [
        "未命名建筑"
      ],
      "category": "academic",
      "height": 24,
      "footprint": [
        [
          1158.96,
          -643.03
        ],
        [
          1156.58,
          -609.64
        ],
        [
          1168.41,
          -608.64
        ],
        [
          1171.05,
          -642.08
        ],
        [
          1165,
          -642.56
        ]
      ],
      "zone": "南部 · 东部校区",
      "verified": "osm-import"
    },
    {
      "id": "osm-building-1433084264",
      "name": "未命名建筑 032",
      "aliases": [
        "未命名建筑"
      ],
      "category": "academic",
      "height": 24,
      "footprint": [
        [
          1186.25,
          -716.83
        ],
        [
          1183.56,
          -678.02
        ],
        [
          1200.03,
          -676.89
        ],
        [
          1202.72,
          -715.7
        ]
      ],
      "zone": "南部 · 东部校区",
      "verified": "osm-import"
    },
    {
      "id": "osm-building-1434881536",
      "name": "南开大学医学院",
      "aliases": [
        "南开大学医学院"
      ],
      "category": "academic",
      "height": 24,
      "footprint": [
        [
          317.63,
          -591.19
        ],
        [
          296.12,
          -529.11
        ],
        [
          374.3,
          -502.4
        ],
        [
          395.79,
          -564.49
        ]
      ],
      "zone": "南部 · 西部校区",
      "verified": "osm-import"
    },
    {
      "id": "osm-building-1434881537",
      "name": "药学院",
      "aliases": [
        "药学院"
      ],
      "category": "academic",
      "height": 24,
      "footprint": [
        [
          436.47,
          -597.43
        ],
        [
          371.75,
          -620.5
        ],
        [
          390.61,
          -672.72
        ],
        [
          455.34,
          -649.67
        ]
      ],
      "zone": "南部 · 西部校区",
      "verified": "osm-import"
    },
    {
      "id": "osm-building-1434881538",
      "name": "环境科学与工程学院",
      "aliases": [
        "环境科学与工程学院"
      ],
      "category": "academic",
      "height": 24,
      "footprint": [
        [
          416.04,
          -715.51
        ],
        [
          377.34,
          -729.26
        ],
        [
          391.41,
          -768.29
        ],
        [
          332.92,
          -789.08
        ],
        [
          361.23,
          -867.66
        ],
        [
          434.14,
          -841.74
        ],
        [
          403.36,
          -756.3
        ],
        [
          427.63,
          -747.68
        ]
      ],
      "zone": "南部 · 西部校区",
      "verified": "osm-import"
    },
    {
      "id": "osm-building-1436478222",
      "name": "D区",
      "aliases": [
        "D区"
      ],
      "category": "academic",
      "height": 24,
      "footprint": [
        [
          1176.66,
          -753.35
        ],
        [
          1181.95,
          -808.72
        ],
        [
          1081.84,
          -818.15
        ],
        [
          1074.21,
          -738.26
        ],
        [
          1080.36,
          -737.68
        ],
        [
          1088.56,
          -736.91
        ],
        [
          1093.99,
          -793.77
        ],
        [
          1170.45,
          -786.58
        ],
        [
          1167.36,
          -754.23
        ]
      ],
      "zone": "南部 · 东部校区",
      "verified": "osm-import"
    },
    {
      "id": "osm-building-1443036559",
      "name": "学9",
      "aliases": [
        "学9"
      ],
      "category": "residence",
      "height": 14.4,
      "footprint": [
        [
          789.3,
          -197.49
        ],
        [
          849.86,
          -181.99
        ],
        [
          851.85,
          -189.69
        ],
        [
          872.12,
          -184.51
        ],
        [
          876.79,
          -202.55
        ],
        [
          795.98,
          -223.22
        ]
      ],
      "zone": "南部 · 西部校区",
      "verified": "osm-import"
    },
    {
      "id": "osm-building-1443039221",
      "name": "未命名建筑 038",
      "aliases": [
        "未命名建筑"
      ],
      "category": "academic",
      "height": 24,
      "footprint": [
        [
          738.73,
          -395.97
        ],
        [
          754.61,
          -459.25
        ],
        [
          739.97,
          -462.52
        ],
        [
          734.93,
          -442.37
        ],
        [
          728.98,
          -418.59
        ],
        [
          724.18,
          -399.85
        ]
      ],
      "zone": "南部 · 西部校区",
      "verified": "osm-import"
    },
    {
      "id": "osm-building-1444302749",
      "name": "未命名建筑 039",
      "aliases": [
        "未命名建筑"
      ],
      "category": "academic",
      "height": 24,
      "footprint": [
        [
          1502.21,
          -859.34
        ],
        [
          1512.1,
          -858.53
        ],
        [
          1509.35,
          -825.67
        ],
        [
          1482.21,
          -827.9
        ],
        [
          1484.41,
          -854.35
        ],
        [
          1501.68,
          -852.93
        ]
      ],
      "zone": "北部 · 东部校区",
      "verified": "osm-import"
    },
    {
      "id": "osm-building-1444303137",
      "name": "未命名建筑 040",
      "aliases": [
        "未命名建筑"
      ],
      "category": "academic",
      "height": 24,
      "footprint": [
        [
          767.32,
          -455.85
        ],
        [
          775.83,
          -453.67
        ],
        [
          756.37,
          -377.64
        ],
        [
          747.52,
          -379.88
        ]
      ],
      "zone": "南部 · 西部校区",
      "verified": "osm-import"
    },
    {
      "id": "osm-building-1447942461",
      "name": "未命名建筑 041",
      "aliases": [
        "未命名建筑"
      ],
      "category": "academic",
      "height": 24,
      "footprint": [
        [
          638.63,
          -148.81
        ],
        [
          660.09,
          -142.63
        ],
        [
          658.05,
          -135.64
        ],
        [
          656.39,
          -129.98
        ],
        [
          634.93,
          -136.17
        ]
      ],
      "zone": "南部 · 西部校区",
      "verified": "osm-import"
    },
    {
      "id": "osm-building-1447942462",
      "name": "未命名建筑 042",
      "aliases": [
        "未命名建筑"
      ],
      "category": "academic",
      "height": 24,
      "footprint": [
        [
          792.57,
          -107.72
        ],
        [
          802.6,
          -105.62
        ],
        [
          814.24,
          -103.2
        ],
        [
          812.02,
          -92.71
        ],
        [
          790.35,
          -97.23
        ],
        [
          791.46,
          -102.44
        ]
      ],
      "zone": "南部 · 西部校区",
      "verified": "osm-import"
    },
    {
      "id": "osm-building-1447942463",
      "name": "未命名建筑 043",
      "aliases": [
        "未命名建筑"
      ],
      "category": "academic",
      "height": 24,
      "footprint": [
        [
          782.34,
          -61.3
        ],
        [
          804.12,
          -56.67
        ],
        [
          801.59,
          -44.94
        ],
        [
          779.81,
          -49.57
        ],
        [
          780.88,
          -54.57
        ]
      ],
      "zone": "南部 · 西部校区",
      "verified": "osm-import"
    },
    {
      "id": "osm-building-1447942464",
      "name": "未命名建筑 044",
      "aliases": [
        "未命名建筑"
      ],
      "category": "academic",
      "height": 24,
      "footprint": [
        [
          755.81,
          -81.4
        ],
        [
          751.35,
          -82.52
        ],
        [
          746.08,
          -60.69
        ],
        [
          779.08,
          -52.84
        ],
        [
          778.18,
          -48.54
        ],
        [
          803.39,
          -42.94
        ],
        [
          806.37,
          -57.77
        ],
        [
          781.47,
          -63.13
        ],
        [
          779.94,
          -56.46
        ],
        [
          751.69,
          -63.37
        ]
      ],
      "zone": "南部 · 西部校区",
      "verified": "osm-import"
    },
    {
      "id": "osm-building-1450306650",
      "name": "汉语言文化学院",
      "aliases": [
        "汉语言文化学院"
      ],
      "category": "academic",
      "height": 24,
      "footprint": [
        [
          763.4,
          -964.29
        ],
        [
          787.42,
          -957.84
        ],
        [
          792.14,
          -975.14
        ],
        [
          752.66,
          -985.76
        ],
        [
          739.22,
          -936.36
        ],
        [
          765.26,
          -929.36
        ],
        [
          768.33,
          -940.64
        ],
        [
          757.73,
          -943.48
        ]
      ],
      "zone": "北部 · 西部校区",
      "verified": "osm-import"
    },
    {
      "id": "osm-building-1450306651",
      "name": "法学院",
      "aliases": [
        "法学院"
      ],
      "category": "landmark",
      "height": 18,
      "footprint": [
        [
          803.31,
          -968.3
        ],
        [
          844.77,
          -957.1
        ],
        [
          825.04,
          -885.05
        ],
        [
          761.68,
          -902.16
        ],
        [
          767.49,
          -923.38
        ],
        [
          778.71,
          -920.35
        ],
        [
          776.91,
          -913.79
        ],
        [
          811.99,
          -904.31
        ],
        [
          824.32,
          -949.22
        ],
        [
          799.89,
          -955.83
        ]
      ],
      "zone": "北部 · 西部校区",
      "verified": "osm-import"
    },
    {
      "id": "osm-building-1450306652",
      "name": "金融学院",
      "aliases": [
        "金融学院"
      ],
      "category": "academic",
      "height": 24,
      "footprint": [
        [
          877.66,
          -948.02
        ],
        [
          954.14,
          -927.93
        ],
        [
          947.88,
          -904.42
        ],
        [
          890.91,
          -919.37
        ],
        [
          882.89,
          -889.23
        ],
        [
          917.99,
          -880.01
        ],
        [
          922.23,
          -895.95
        ],
        [
          941.87,
          -890.78
        ],
        [
          933.4,
          -858.98
        ],
        [
          859.15,
          -878.5
        ]
      ],
      "zone": "北部 · 西部校区",
      "verified": "osm-import"
    },
    {
      "id": "osm-building-1450306654",
      "name": "未命名建筑 048",
      "aliases": [
        "未命名建筑"
      ],
      "category": "academic",
      "height": 24,
      "footprint": [
        [
          762.81,
          -1174.58
        ],
        [
          779.1,
          -1189.88
        ],
        [
          770,
          -1199.44
        ],
        [
          774.28,
          -1215.76
        ],
        [
          758.45,
          -1220.29
        ],
        [
          754.68,
          -1202.96
        ],
        [
          749.28,
          -1201.86
        ],
        [
          752.47,
          -1191.79
        ],
        [
          757.75,
          -1195.53
        ],
        [
          765.16,
          -1188.79
        ],
        [
          756.78,
          -1180.92
        ]
      ],
      "zone": "北部 · 西部校区",
      "verified": "osm-import"
    },
    {
      "id": "osm-building-1450306656",
      "name": "哲学院",
      "aliases": [
        "哲学院"
      ],
      "category": "academic",
      "height": 24,
      "footprint": [
        [
          939.79,
          -974.43
        ],
        [
          934.97,
          -955.18
        ],
        [
          979.41,
          -944.2
        ],
        [
          991.14,
          -991.02
        ],
        [
          964.1,
          -997.7
        ],
        [
          959.51,
          -979.4
        ],
        [
          973.88,
          -975.85
        ],
        [
          971.56,
          -966.58
        ]
      ],
      "zone": "北部 · 西部校区",
      "verified": "osm-import"
    },
    {
      "id": "osm-building-1450306657",
      "name": "马克思主义学院",
      "aliases": [
        "马克思主义学院"
      ],
      "category": "academic",
      "height": 24,
      "footprint": [
        [
          948.81,
          -1037.46
        ],
        [
          943.11,
          -1018.03
        ],
        [
          992.77,
          -1003.68
        ],
        [
          998.47,
          -1023.1
        ]
      ],
      "zone": "北部 · 西部校区",
      "verified": "osm-import"
    },
    {
      "id": "osm-building-1451035702",
      "name": "历史学院",
      "aliases": [
        "历史学院"
      ],
      "category": "academic",
      "height": 24,
      "footprint": [
        [
          923.33,
          -962.05
        ],
        [
          882.09,
          -972.44
        ],
        [
          892.3,
          -1012.4
        ],
        [
          900.09,
          -1010.44
        ],
        [
          903.67,
          -1024.43
        ],
        [
          897.94,
          -1025.87
        ],
        [
          900.58,
          -1036.2
        ],
        [
          936.72,
          -1027.11
        ],
        [
          934.48,
          -1018.31
        ],
        [
          911.9,
          -1023.99
        ],
        [
          907.35,
          -1006.13
        ],
        [
          930.33,
          -1000.35
        ],
        [
          927.41,
          -988.93
        ],
        [
          899.77,
          -995.9
        ],
        [
          896.2,
          -981.89
        ],
        [
          926.44,
          -974.27
        ]
      ],
      "zone": "北部 · 西部校区",
      "verified": "osm-import"
    },
    {
      "id": "osm-building-1456224120",
      "name": "实验楼D",
      "aliases": [
        "D区", "实验楼D", "D实验楼", "实验楼D区", "东侧实验楼"
      ],
      "category": "academic",
      "height": 24,
      "footprint": [
        [
          1295.23,
          -742.8
        ],
        [
          1298.66,
          -798.31
        ],
        [
          1399.03,
          -792.19
        ],
        [
          1394.08,
          -712.1
        ],
        [
          1387.92,
          -712.47
        ],
        [
          1379.69,
          -712.97
        ],
        [
          1383.22,
          -769.97
        ],
        [
          1306.56,
          -774.67
        ],
        [
          1304.56,
          -742.23
        ]
      ],
      "zone": "南部 · 东部校区",
      "verified": "osm-import"
    },
    {
      "id": "osm-building-1456224121",
      "name": "实验楼C",
      "aliases": [
        "C区", "实验楼C", "C实验楼", "实验楼C区", "东侧实验楼"
      ],
      "category": "academic",
      "height": 24,
      "footprint": [
        [
          1386.83,
          -699.96
        ],
        [
          1387.92,
          -712.47
        ],
        [
          1379.69,
          -712.97
        ],
        [
          1345.08,
          -715.71
        ],
        [
          1347.09,
          -738.68
        ],
        [
          1304.56,
          -742.23
        ],
        [
          1295.23,
          -742.8
        ],
        [
          1266.57,
          -745.64
        ],
        [
          1263.6,
          -709.62
        ],
        [
          1280.05,
          -708.19
        ]
      ],
      "zone": "南部 · 东部校区",
      "verified": "osm-import"
    },
    {
      "id": "osm-building-1456224122",
      "name": "实验楼B/C连廊",
      "aliases": [
        "实验楼连廊", "东侧实验楼连廊"
      ],
      "category": "academic",
      "height": 24,
      "footprint": [
        [
          1280.05,
          -708.19
        ],
        [
          1276.64,
          -669.45
        ],
        [
          1260.18,
          -670.87
        ],
        [
          1263.6,
          -709.62
        ]
      ],
      "zone": "南部 · 东部校区",
      "verified": "osm-import"
    },
    {
      "id": "osm-building-1456224123",
      "name": "实验楼B",
      "aliases": [
        "B区", "实验楼B", "B实验楼", "实验楼B区", "东侧实验楼"
      ],
      "category": "academic",
      "height": 24,
      "footprint": [
        [
          1257.29,
          -634.01
        ],
        [
          1283.38,
          -632.02
        ],
        [
          1289.42,
          -631.55
        ],
        [
          1295.46,
          -631.09
        ],
        [
          1369.73,
          -625.43
        ],
        [
          1383.35,
          -624.46
        ],
        [
          1386.18,
          -661.1
        ],
        [
          1276.64,
          -669.45
        ],
        [
          1260.18,
          -670.87
        ]
      ],
      "zone": "南部 · 东部校区",
      "verified": "osm-import"
    },
    {
      "id": "osm-building-1456224124",
      "name": "实验楼A",
      "aliases": [
        "A区", "实验楼A", "A实验楼", "实验楼A区", "东侧实验楼"
      ],
      "category": "academic",
      "height": 24,
      "footprint": [
        [
          1279.33,
          -578.78
        ],
        [
          1379.5,
          -571.59
        ],
        [
          1383.35,
          -624.46
        ],
        [
          1369.73,
          -625.43
        ],
        [
          1367.33,
          -592.39
        ],
        [
          1292.6,
          -597.73
        ],
        [
          1280.75,
          -598.57
        ]
      ],
      "zone": "南部 · 东部校区",
      "verified": "osm-import"
    },
    {
      "id": "osm-building-1456224125",
      "name": "实验楼A内侧连廊",
      "aliases": [
        "实验楼连廊", "实验楼A连廊"
      ],
      "category": "academic",
      "height": 24,
      "footprint": [
        [
          1295.46,
          -631.09
        ],
        [
          1292.6,
          -597.73
        ],
        [
          1280.75,
          -598.57
        ],
        [
          1283.38,
          -632.02
        ],
        [
          1289.42,
          -631.55
        ]
      ],
      "zone": "南部 · 东部校区",
      "verified": "osm-import"
    },
    {
      "id": "osm-building-1456224126",
      "name": "前沿交叉学科中心",
      "aliases": [
        "前沿交叉学科中心"
      ],
      "category": "academic",
      "height": 24,
      "footprint": [
        [
          1283.19,
          -898.07
        ],
        [
          1305.21,
          -895.78
        ],
        [
          1311.59,
          -956.56
        ],
        [
          1381.01,
          -949.38
        ],
        [
          1379.62,
          -936.06
        ],
        [
          1391.36,
          -934.85
        ],
        [
          1387.37,
          -894.3
        ],
        [
          1394.65,
          -893.79
        ],
        [
          1405.81,
          -837.76
        ],
        [
          1401.22,
          -834.34
        ],
        [
          1380.8,
          -835.7
        ],
        [
          1379.83,
          -824.77
        ],
        [
          1276.63,
          -835.43
        ]
      ],
      "zone": "北部 · 东部校区",
      "verified": "osm-import"
    },
    {
      "id": "osm-building-1456224127",
      "name": "体育馆",
      "aliases": [
        "体育馆"
      ],
      "category": "sport",
      "height": 18,
      "footprint": [
        [
          1228.46,
          -1173.57
        ],
        [
          1250.98,
          -1171.71
        ],
        [
          1284.57,
          -1168.94
        ],
        [
          1311.58,
          -1166.72
        ],
        [
          1308.58,
          -1130.83
        ],
        [
          1304.85,
          -1086.23
        ],
        [
          1300.8,
          -1037.64
        ],
        [
          1299.68,
          -1024.22
        ],
        [
          1259.29,
          -1027.55
        ],
        [
          1216.58,
          -1031.07
        ],
        [
          1217.94,
          -1047.38
        ],
        [
          1221.49,
          -1089.94
        ],
        [
          1222.18,
          -1098.19
        ],
        [
          1224.34,
          -1124.17
        ],
        [
          1225.5,
          -1138.01
        ]
      ],
      "zone": "北部 · 东部校区",
      "verified": "osm-import"
    },
    {
      "id": "osm-building-1456224128",
      "name": "教工宿舍1",
      "aliases": [
        "教工宿舍1"
      ],
      "category": "residence",
      "height": 27,
      "footprint": [
        [
          800.64,
          -1295.04
        ],
        [
          817.25,
          -1355.27
        ],
        [
          820.47,
          -1366.94
        ],
        [
          948.09,
          -1332.23
        ],
        [
          944.18,
          -1318.09
        ],
        [
          836.64,
          -1347.31
        ],
        [
          837.37,
          -1349.92
        ],
        [
          831.4,
          -1351.55
        ],
        [
          829.72,
          -1345.44
        ],
        [
          832.62,
          -1344.66
        ],
        [
          817.66,
          -1290.42
        ]
      ],
      "zone": "北部 · 西部校区",
      "verified": "osm-import"
    },
    {
      "id": "osm-building-1456224129",
      "name": "学生宿舍4",
      "aliases": [
        "学生宿舍4"
      ],
      "category": "residence",
      "height": 27,
      "footprint": [
        [
          849.75,
          -1292.07
        ],
        [
          848.87,
          -1288.84
        ],
        [
          846.38,
          -1289.5
        ],
        [
          844.6,
          -1282.96
        ],
        [
          846.85,
          -1282.36
        ],
        [
          846.05,
          -1279.43
        ],
        [
          917.42,
          -1260.31
        ],
        [
          908.23,
          -1226.46
        ],
        [
          909.88,
          -1226.02
        ],
        [
          908.98,
          -1222.72
        ],
        [
          906.11,
          -1223.49
        ],
        [
          905.27,
          -1220.44
        ],
        [
          895.35,
          -1223.13
        ],
        [
          896.4,
          -1226.94
        ],
        [
          794.63,
          -1254.57
        ],
        [
          793.91,
          -1251.96
        ],
        [
          792.18,
          -1252.44
        ],
        [
          790.33,
          -1245.69
        ],
        [
          792.07,
          -1245.23
        ],
        [
          791.32,
          -1242.48
        ],
        [
          916.99,
          -1208.65
        ],
        [
          933.6,
          -1269.5
        ]
      ],
      "zone": "北部 · 西部校区",
      "verified": "osm-import"
    },
    {
      "id": "osm-building-1456224130",
      "name": "学生宿舍3",
      "aliases": [
        "学生宿舍3"
      ],
      "category": "residence",
      "height": 27,
      "footprint": [
        [
          959.8,
          -1245.35
        ],
        [
          974.64,
          -1303.42
        ],
        [
          981.21,
          -1318.13
        ],
        [
          1080.66,
          -1291.69
        ],
        [
          1070.43,
          -1265.92
        ],
        [
          998.54,
          -1286.17
        ],
        [
          990.81,
          -1286.79
        ],
        [
          977.15,
          -1240.89
        ]
      ],
      "zone": "北部 · 西部校区",
      "verified": "osm-import"
    },
    {
      "id": "osm-building-1456224172",
      "name": "学生宿舍2",
      "aliases": [
        "学生宿舍2"
      ],
      "category": "residence",
      "height": 27,
      "footprint": [
        [
          1009.74,
          -1254.22
        ],
        [
          1065,
          -1239.3
        ],
        [
          1047.07,
          -1173.79
        ],
        [
          951.73,
          -1199.52
        ],
        [
          956.13,
          -1215.6
        ],
        [
          1041.13,
          -1192.64
        ],
        [
          1050.19,
          -1225.73
        ],
        [
          1005.27,
          -1237.86
        ]
      ],
      "zone": "北部 · 西部校区",
      "verified": "osm-import"
    },
    {
      "id": "osm-building-1456226519",
      "name": "未命名建筑 064",
      "aliases": [
        "未命名建筑"
      ],
      "category": "academic",
      "height": 24,
      "footprint": [
        [
          752.79,
          -1249.23
        ],
        [
          769.08,
          -1264.52
        ],
        [
          759.98,
          -1274.09
        ],
        [
          764.26,
          -1290.41
        ],
        [
          748.42,
          -1294.94
        ],
        [
          744.66,
          -1277.61
        ],
        [
          739.26,
          -1276.51
        ],
        [
          742.45,
          -1266.44
        ],
        [
          747.73,
          -1270.17
        ],
        [
          755.14,
          -1263.44
        ],
        [
          746.75,
          -1255.57
        ]
      ],
      "zone": "北部 · 西部校区",
      "verified": "osm-import"
    },
    {
      "id": "osm-building-1458201956",
      "name": "南开大学新校区规划建设指挥部",
      "aliases": [
        "南开大学新校区规划建设指挥部"
      ],
      "category": "academic",
      "height": 24,
      "footprint": [
        [
          620.1,
          -1365.52
        ],
        [
          690.93,
          -1341.4
        ],
        [
          686.04,
          -1327.22
        ],
        [
          658.58,
          -1336.57
        ],
        [
          657.12,
          -1332.37
        ],
        [
          643.17,
          -1337.13
        ],
        [
          644.36,
          -1340.55
        ],
        [
          614.94,
          -1350.57
        ]
      ],
      "zone": "北部 · 西部校区",
      "verified": "osm-import"
    },
    {
      "id": "osm-building-1473351162",
      "name": "未命名建筑 066",
      "aliases": [
        "未命名建筑"
      ],
      "category": "academic",
      "height": 24,
      "footprint": [
        [
          686.14,
          -108.8
        ],
        [
          690.84,
          -107.63
        ],
        [
          696.2,
          -127.78
        ],
        [
          661.17,
          -137.49
        ],
        [
          662.99,
          -144.03
        ],
        [
          637.02,
          -151.13
        ],
        [
          632.33,
          -134.23
        ],
        [
          658.19,
          -127.15
        ],
        [
          659.81,
          -133.01
        ],
        [
          690.31,
          -124.66
        ]
      ],
      "zone": "南部 · 西部校区",
      "verified": "osm-import"
    },
    {
      "id": "osm-building-1473351163",
      "name": "未命名建筑 067",
      "aliases": [
        "未命名建筑"
      ],
      "category": "academic",
      "height": 24,
      "footprint": [
        [
          758.51,
          -90.73
        ],
        [
          762.09,
          -106.98
        ],
        [
          789.68,
          -100.9
        ],
        [
          788.66,
          -96.31
        ],
        [
          813.14,
          -90.98
        ],
        [
          816.03,
          -104.03
        ],
        [
          791.51,
          -109.46
        ],
        [
          790.53,
          -104.72
        ],
        [
          758.77,
          -111.4
        ],
        [
          753.96,
          -91.86
        ]
      ],
      "zone": "南部 · 西部校区",
      "verified": "osm-import"
    },
    {
      "id": "osm-building-1473351164",
      "name": "南开大学津南校区站",
      "aliases": [
        "南开大学津南校区站"
      ],
      "category": "academic",
      "height": 24,
      "footprint": [
        [
          650.52,
          -117.69
        ],
        [
          648.15,
          -108.32
        ],
        [
          751.35,
          -82.52
        ],
        [
          755.81,
          -81.4
        ],
        [
          787.39,
          -73.51
        ],
        [
          789.78,
          -82.92
        ],
        [
          758.51,
          -90.73
        ],
        [
          753.96,
          -91.86
        ],
        [
          690.84,
          -107.63
        ],
        [
          686.14,
          -108.8
        ]
      ],
      "zone": "南部 · 西部校区",
      "verified": "osm-import"
    },
    {
      "id": "osm-building-1474145904",
      "name": "文科主体育场主席台",
      "aliases": [
        "文科主体育场主席台",
        "主体育场主席台",
        "文科体育场看台",
        "主席台",
        "体育场西看台",
        "未命名建筑 069"
      ],
      "category": "academic",
      "height": 24,
      "footprint": [
        [
          1417.77,
          -1174.31
        ],
        [
          1433.39,
          -1056.38
        ],
        [
          1412.32,
          -1053.63
        ],
        [
          1396.68,
          -1171.54
        ]
      ],
      "zone": "北部 · 东部校区",
      "verified": "osm-import"
    },
    {
      "id": "osm-building-1487701415",
      "name": "未命名建筑 070",
      "aliases": [
        "未命名建筑"
      ],
      "category": "academic",
      "height": 24,
      "footprint": [
        [
          773.23,
          -1286.54
        ],
        [
          776.66,
          -1270.24
        ],
        [
          810.7,
          -1260.75
        ],
        [
          816.07,
          -1279.75
        ],
        [
          798.77,
          -1284.57
        ],
        [
          788.36,
          -1294.12
        ],
        [
          786.98,
          -1292.63
        ],
        [
          782.62,
          -1296.62
        ]
      ],
      "zone": "北部 · 西部校区",
      "verified": "osm-import"
    },
    {
      "id": "osm-building-1491174610",
      "name": "学8",
      "aliases": [
        "学8"
      ],
      "category": "residence",
      "height": 27,
      "footprint": [
        [
          832.16,
          -300.67
        ],
        [
          834.75,
          -310.97
        ],
        [
          893.23,
          -296.45
        ],
        [
          891.16,
          -288.26
        ],
        [
          894.21,
          -287.5
        ],
        [
          881.61,
          -237.38
        ],
        [
          819.34,
          -252.82
        ],
        [
          821.76,
          -262.47
        ],
        [
          874.11,
          -249.48
        ],
        [
          883.77,
          -287.87
        ]
      ],
      "zone": "南部 · 西部校区",
      "verified": "osm-import"
    },
    {
      "id": "osm-building-1491421998",
      "name": "教3宿舍楼",
      "aliases": [
        "教3宿舍楼"
      ],
      "category": "residence",
      "height": 12,
      "footprint": [
        [
          716.36,
          -234.72
        ],
        [
          711.14,
          -215.34
        ],
        [
          765.26,
          -200.94
        ],
        [
          770.49,
          -220.32
        ]
      ],
      "zone": "南部 · 西部校区",
      "verified": "osm-import"
    },
    {
      "id": "osm-building-1507434829",
      "name": "留学生公寓E",
      "aliases": [
        "留学生公寓E"
      ],
      "category": "residence",
      "height": 14.4,
      "footprint": [
        [
          595.51,
          -1132.79
        ],
        [
          664.25,
          -1107.81
        ],
        [
          658.68,
          -1092.67
        ],
        [
          589.94,
          -1117.64
        ]
      ],
      "zone": "北部 · 西部校区",
      "verified": "osm-import"
    },
    {
      "id": "osm-building-1507434830",
      "name": "留学生公寓D",
      "aliases": [
        "留学生公寓D"
      ],
      "category": "residence",
      "height": 14.4,
      "footprint": [
        [
          542.39,
          -1150.62
        ],
        [
          581.1,
          -1136.72
        ],
        [
          575.9,
          -1122.43
        ],
        [
          537.18,
          -1136.31
        ]
      ],
      "zone": "北部 · 西部校区",
      "verified": "osm-import"
    },
    {
      "id": "osm-building-1507434831",
      "name": "留学生公寓C",
      "aliases": [
        "留学生公寓C"
      ],
      "category": "residence",
      "height": 18,
      "footprint": [
        [
          555.14,
          -1186.64
        ],
        [
          603.39,
          -1169.18
        ],
        [
          598.35,
          -1155.43
        ],
        [
          550.09,
          -1172.87
        ]
      ],
      "zone": "北部 · 西部校区",
      "verified": "osm-import"
    },
    {
      "id": "osm-building-1507434832",
      "name": "留学生公寓B",
      "aliases": [
        "留学生公寓B"
      ],
      "category": "residence",
      "height": 21.6,
      "footprint": [
        [
          565.21,
          -1222.38
        ],
        [
          635.96,
          -1198.9
        ],
        [
          631,
          -1184.14
        ],
        [
          560.24,
          -1207.59
        ]
      ],
      "zone": "北部 · 西部校区",
      "verified": "osm-import"
    },
    {
      "id": "osm-building-1507624549",
      "name": "学10",
      "aliases": [
        "学10"
      ],
      "category": "residence",
      "height": 27,
      "footprint": [
        [
          547.45,
          -1292.5
        ],
        [
          535.67,
          -1257.52
        ],
        [
          550.74,
          -1252.53
        ],
        [
          556.57,
          -1269.84
        ],
        [
          695.35,
          -1223.73
        ],
        [
          701.31,
          -1241.41
        ]
      ],
      "zone": "北部 · 西部校区",
      "verified": "osm-import"
    },
    {
      "id": "osm-building-1530053723",
      "name": "人工智能学院",
      "aliases": [
        "人工智能学院"
      ],
      "category": "academic",
      "height": 24,
      "footprint": [
        [
          729.78,
          -682.21
        ],
        [
          802.47,
          -664.42
        ],
        [
          792.55,
          -624.13
        ],
        [
          772.95,
          -628.23
        ],
        [
          778.45,
          -652.24
        ],
        [
          725.63,
          -663.85
        ]
      ],
      "zone": "南部 · 西部校区",
      "verified": "osm-import"
    },
    {
      "id": "osm-building-1530053724",
      "name": "电子信息与光学工程学院",
      "aliases": [
        "电子信息与光学工程学院"
      ],
      "category": "academic",
      "height": 24,
      "footprint": [
        [
          717.92,
          -621.81
        ],
        [
          785.86,
          -605.98
        ],
        [
          776.22,
          -562.19
        ],
        [
          774.38,
          -553.82
        ],
        [
          768.79,
          -530.9
        ],
        [
          763.09,
          -507.42
        ],
        [
          693.18,
          -522.44
        ]
      ],
      "zone": "南部 · 西部校区",
      "verified": "osm-import"
    },
    {
      "id": "osm-building-1530053725",
      "name": "材料科学与工程学院",
      "aliases": [
        "材料科学与工程学院"
      ],
      "category": "academic",
      "height": 24,
      "footprint": [
        [
          837.64,
          -654.33
        ],
        [
          921.04,
          -633.01
        ],
        [
          904.08,
          -578.19
        ],
        [
          823.77,
          -601.37
        ]
      ],
      "zone": "南部 · 西部校区",
      "verified": "osm-import"
    },
    {
      "id": "osm-building-1530053726",
      "name": "信息东楼",
      "aliases": [
        "信息东楼"
      ],
      "category": "academic",
      "height": 24,
      "footprint": [
        [
          810.32,
          -553.92
        ],
        [
          819.43,
          -551.7
        ],
        [
          821.67,
          -559.47
        ],
        [
          904.35,
          -536.45
        ],
        [
          887.23,
          -467.72
        ],
        [
          818.7,
          -486.14
        ],
        [
          819.75,
          -490.69
        ],
        [
          795.2,
          -497.26
        ],
        [
          802.27,
          -523.69
        ],
        [
          808,
          -545.16
        ]
      ],
      "zone": "南部 · 西部校区",
      "verified": "osm-import"
    },
    {
      "id": "osm-building-1530053727",
      "name": "学生宿舍7B",
      "aliases": [
        "学生宿舍7B"
      ],
      "category": "residence",
      "height": 27,
      "footprint": [
        [
          779.85,
          -439.41
        ],
        [
          845.62,
          -423.27
        ],
        [
          822.65,
          -354.81
        ],
        [
          761.45,
          -369.81
        ]
      ],
      "zone": "南部 · 西部校区",
      "verified": "osm-import"
    },
    {
      "id": "osm-building-1530053728",
      "name": "学生宿舍7A",
      "aliases": [
        "学生宿舍7A"
      ],
      "category": "residence",
      "height": 27,
      "footprint": [
        [
          860.27,
          -419.78
        ],
        [
          844.12,
          -349.1
        ],
        [
          907.96,
          -331.71
        ],
        [
          928.76,
          -405.74
        ]
      ],
      "zone": "南部 · 西部校区",
      "verified": "osm-import"
    },
    {
      "id": "osm-building-1530053729",
      "name": "学生宿舍5C",
      "aliases": [
        "学生宿舍5C"
      ],
      "category": "residence",
      "height": 27,
      "footprint": [
        [
          647.48,
          -386.22
        ],
        [
          711.54,
          -369.8
        ],
        [
          707.47,
          -354.11
        ],
        [
          654.5,
          -367.71
        ],
        [
          645.59,
          -333.47
        ],
        [
          634.5,
          -336.31
        ]
      ],
      "zone": "南部 · 西部校区",
      "verified": "osm-import"
    },
    {
      "id": "osm-building-1530053730",
      "name": "学生宿舍5D",
      "aliases": [
        "学生宿舍5D"
      ],
      "category": "residence",
      "height": 27,
      "footprint": [
        [
          634.5,
          -336.31
        ],
        [
          645.59,
          -333.47
        ],
        [
          688.91,
          -321.98
        ],
        [
          693.78,
          -339.84
        ],
        [
          704.01,
          -337.1
        ],
        [
          694.74,
          -303.02
        ],
        [
          630.41,
          -320.28
        ]
      ],
      "zone": "南部 · 西部校区",
      "verified": "osm-import"
    },
    {
      "id": "osm-building-1530053731",
      "name": "学生宿舍5B",
      "aliases": [
        "学生宿舍5B"
      ],
      "category": "residence",
      "height": 27,
      "footprint": [
        [
          743.3,
          -328.05
        ],
        [
          813.97,
          -312.36
        ],
        [
          807.88,
          -287.45
        ],
        [
          737.74,
          -308.84
        ]
      ],
      "zone": "南部 · 西部校区",
      "verified": "osm-import"
    },
    {
      "id": "osm-building-1530053732",
      "name": "学生宿舍5A",
      "aliases": [
        "学生宿舍5A"
      ],
      "category": "residence",
      "height": 27,
      "footprint": [
        [
          731.92,
          -282.42
        ],
        [
          800.02,
          -269.56
        ],
        [
          793.67,
          -239.55
        ],
        [
          724.9,
          -255.34
        ]
      ],
      "zone": "南部 · 西部校区",
      "verified": "osm-import"
    },
    {
      "id": "osm-building-1530053733",
      "name": "学生宿舍6",
      "aliases": [
        "学生宿舍6"
      ],
      "category": "residence",
      "height": 27,
      "footprint": [
        [
          613.29,
          -266
        ],
        [
          695.7,
          -242.38
        ],
        [
          688.64,
          -219.28
        ],
        [
          607.05,
          -240.35
        ]
      ],
      "zone": "南部 · 西部校区",
      "verified": "osm-import"
    },
    {
      "id": "osm-building-1548241058",
      "name": "未命名建筑 089",
      "aliases": [
        "未命名建筑"
      ],
      "category": "academic",
      "height": 24,
      "footprint": [
        [
          776.22,
          -562.19
        ],
        [
          774.38,
          -553.82
        ],
        [
          808,
          -545.16
        ],
        [
          810.32,
          -553.92
        ]
      ],
      "zone": "南部 · 西部校区",
      "verified": "osm-import"
    }
  ],
  "roads": [
    {
      "id": "osm-road-294213943-1",
      "name": "和慧南路",
      "kind": "primary",
      "points": [
        [
          2294.76,
          -1509.784970377939
        ],
        [
          2276.1,
          -1292.01
        ],
        [
          2275.28,
          -1284.55
        ],
        [
          2244.82,
          -944.15
        ],
        [
          2222.4,
          -683.71
        ],
        [
          2216.38,
          -598.47
        ],
        [
          2215.98,
          -592.05
        ],
        [
          2203.72,
          -457.01
        ],
        [
          2185.75,
          -254.71
        ],
        [
          2159.88,
          62.84
        ]
      ]
    },
    {
      "id": "osm-road-477108139-1",
      "name": "乐群北路",
      "kind": "primary",
      "points": [
        [
          721.7,
          -1438.62
        ],
        [
          717.96,
          -1421.23
        ],
        [
          714.38,
          -1407.15
        ],
        [
          712.75,
          -1398.6
        ],
        [
          711.13,
          -1390.56
        ],
        [
          708.33,
          -1356.52
        ],
        [
          707.76,
          -1334.55
        ],
        [
          707.46,
          -1317.27
        ],
        [
          707.98,
          -1296.39
        ],
        [
          713.16,
          -1254.93
        ],
        [
          714.81,
          -1245.74
        ],
        [
          725.88,
          -1202.75
        ],
        [
          733.63,
          -1175.4
        ],
        [
          735.13,
          -1170.06
        ],
        [
          745.92,
          -1122.1
        ]
      ]
    },
    {
      "id": "osm-road-477108141-1",
      "name": "公能北道",
      "kind": "primary",
      "points": [
        [
          1898.29,
          -910.92
        ],
        [
          1903.82,
          -894.49
        ],
        [
          1905.69,
          -876.84
        ],
        [
          1898.56,
          -767.42
        ],
        [
          1893.25,
          -715.65
        ],
        [
          1886.94,
          -654.18
        ]
      ]
    },
    {
      "id": "osm-road-477108142-1",
      "name": "尚俊路",
      "kind": "primary",
      "points": [
        [
          531,
          -880.68
        ],
        [
          521.6,
          -853.55
        ],
        [
          520.85,
          -851.41
        ],
        [
          519.44,
          -847.74
        ],
        [
          493.75,
          -780.66
        ],
        [
          474.06,
          -722.82
        ],
        [
          472.4,
          -698.93
        ],
        [
          474.05,
          -693.11
        ],
        [
          476.47,
          -684.54
        ],
        [
          483,
          -670.16
        ],
        [
          515.22,
          -590.64
        ]
      ]
    },
    {
      "id": "osm-road-477108144-1",
      "name": "公能东路",
      "kind": "primary",
      "points": [
        [
          1286.11,
          -1248.67
        ],
        [
          1295.4,
          -1246.74
        ],
        [
          1321.88,
          -1233.82
        ],
        [
          1341.21,
          -1215.25
        ],
        [
          1347.66,
          -1203.4
        ],
        [
          1351.68,
          -1191.56
        ],
        [
          1376.86,
          -1068.14
        ],
        [
          1385.69,
          -1024.89
        ],
        [
          1391.73,
          -995.28
        ],
        [
          1392.54,
          -991.28
        ],
        [
          1395.08,
          -978.83
        ],
        [
          1400.44,
          -959.3
        ],
        [
          1402.12,
          -951.07
        ],
        [
          1415.54,
          -885.5
        ],
        [
          1432.06,
          -804.76
        ],
        [
          1432.23,
          -773.11
        ],
        [
          1429.54,
          -738.82
        ],
        [
          1415.19,
          -555.63
        ],
        [
          1409.44,
          -476.07
        ],
        [
          1402.67,
          -382.38
        ]
      ]
    },
    {
      "id": "osm-road-477379218-1",
      "name": "日新道",
      "kind": "primary",
      "points": [
        [
          995.81,
          -602.46
        ],
        [
          1001.69,
          -599.24
        ],
        [
          1030.82,
          -583.28
        ],
        [
          1059.22,
          -577.32
        ],
        [
          1171.99,
          -568.14
        ],
        [
          1200.71,
          -565.8
        ],
        [
          1210.4,
          -565.01
        ],
        [
          1229.84,
          -563.43
        ],
        [
          1241.27,
          -562.5
        ],
        [
          1369.13,
          -552.08
        ],
        [
          1415.19,
          -555.63
        ],
        [
          1451.94,
          -564.14
        ],
        [
          1460.12,
          -566.14
        ]
      ]
    },
    {
      "id": "osm-road-477379220-1",
      "name": "公能北道",
      "kind": "primary",
      "points": [
        [
          766.35,
          -1103
        ],
        [
          782.83,
          -1098.55
        ],
        [
          845.53,
          -1080.99
        ],
        [
          879.91,
          -1071.36
        ],
        [
          886.7,
          -1069.46
        ],
        [
          902.51,
          -1065.03
        ],
        [
          1019.01,
          -1032.4
        ],
        [
          1121.44,
          -1003.7
        ],
        [
          1217.19,
          -973.12
        ],
        [
          1245.66,
          -965.15
        ],
        [
          1265.22,
          -963.81
        ],
        [
          1286.92,
          -964.59
        ],
        [
          1395.08,
          -978.83
        ],
        [
          1468.83,
          -989.21
        ],
        [
          1488.35,
          -992.13
        ],
        [
          1498.85,
          -993.62
        ],
        [
          1519.9,
          -996.61
        ],
        [
          1538.37,
          -997.48
        ],
        [
          1558.97,
          -997.28
        ],
        [
          1578.56,
          -994.94
        ],
        [
          1733.56,
          -981.57
        ],
        [
          1781.9,
          -978.23
        ],
        [
          1808.41,
          -975.62
        ],
        [
          1816.22,
          -974.85
        ],
        [
          1825.62,
          -971.92
        ],
        [
          1849.84,
          -964.38
        ]
      ]
    },
    {
      "id": "osm-road-477379221-1",
      "name": "校园道路 008",
      "kind": "primary",
      "points": [
        [
          737.78,
          -1117.23
        ],
        [
          735.11,
          -1113.27
        ],
        [
          733.68,
          -1108.73
        ],
        [
          733.62,
          -1103.96
        ],
        [
          734.88,
          -1099.5
        ],
        [
          737.33,
          -1095.58
        ],
        [
          740.79,
          -1092.48
        ],
        [
          744.98,
          -1090.46
        ],
        [
          749.58,
          -1089.67
        ],
        [
          754.21,
          -1090.18
        ],
        [
          758.51,
          -1091.96
        ],
        [
          762.15,
          -1094.85
        ],
        [
          764.83,
          -1098.63
        ],
        [
          766.35,
          -1103
        ],
        [
          766.55,
          -1108.1
        ],
        [
          765.16,
          -1112.99
        ],
        [
          762.33,
          -1117.25
        ],
        [
          758.32,
          -1120.44
        ],
        [
          753.54,
          -1122.26
        ],
        [
          749.71,
          -1122.62
        ],
        [
          745.92,
          -1122.1
        ],
        [
          741.49,
          -1120.26
        ],
        [
          737.78,
          -1117.23
        ]
      ]
    },
    {
      "id": "osm-road-477946985-1",
      "name": "同德路",
      "kind": "primary",
      "points": [
        [
          1600.67,
          -1344.39
        ],
        [
          1629.98,
          -1341.02
        ],
        [
          1718.3,
          -1332.49
        ],
        [
          1964.48,
          -1312.51
        ],
        [
          2227.73,
          -1288.85
        ]
      ]
    },
    {
      "id": "osm-road-616829074-1",
      "name": "校园道路 010",
      "kind": "primary",
      "points": [
        [
          175.86,
          -994.17
        ],
        [
          153.67,
          -1002.39
        ],
        [
          143.5,
          -1004.74
        ],
        [
          95.48,
          -1019.99
        ],
        [
          86.66,
          -1025.29
        ],
        [
          51.62,
          -1037.27
        ],
        [
          45.58,
          -1036.35
        ]
      ]
    },
    {
      "id": "osm-road-616829075-1",
      "name": "思源路",
      "kind": "primary",
      "points": [
        [
          306.23,
          -924.45
        ],
        [
          338.78,
          -917.19
        ],
        [
          359.35,
          -912.6
        ],
        [
          521.6,
          -853.55
        ]
      ]
    },
    {
      "id": "osm-road-616829076-1",
      "name": "思源路",
      "kind": "primary",
      "points": [
        [
          531,
          -880.68
        ],
        [
          367.25,
          -935.66
        ],
        [
          348.01,
          -943.56
        ],
        [
          318.05,
          -955.87
        ]
      ]
    },
    {
      "id": "osm-road-616829081-1",
      "name": "翔宇路",
      "kind": "primary",
      "points": [
        [
          1141.48,
          -284
        ],
        [
          1157.82,
          -194.55
        ]
      ]
    },
    {
      "id": "osm-road-616829082-1",
      "name": "翔宇路",
      "kind": "primary",
      "points": [
        [
          1194.48,
          -116.08
        ],
        [
          1201.5,
          -135.02
        ],
        [
          1206.75,
          -148.99
        ]
      ]
    },
    {
      "id": "osm-road-616829083-1",
      "name": "校园道路 015",
      "kind": "primary",
      "points": [
        [
          1171.68,
          -118.7
        ],
        [
          1164.89,
          -113.58
        ],
        [
          1163.74,
          -106.66
        ],
        [
          1165.75,
          -100.01
        ],
        [
          1172.33,
          -94.65
        ],
        [
          1175.55,
          -82.01
        ]
      ]
    },
    {
      "id": "osm-road-616829084-1",
      "name": "校园道路 016",
      "kind": "primary",
      "points": [
        [
          1184.04,
          -80.41
        ],
        [
          1189.7,
          -93.05
        ],
        [
          1196.35,
          -95.67
        ],
        [
          1199.75,
          -99.47
        ],
        [
          1200.37,
          -103.71
        ],
        [
          1198.95,
          -109.5
        ],
        [
          1194.48,
          -116.08
        ]
      ]
    },
    {
      "id": "osm-road-616829085-1",
      "name": "校园道路 017",
      "kind": "primary",
      "points": [
        [
          1178.59,
          -12.11
        ],
        [
          1179.61,
          -23.3
        ],
        [
          1181.83,
          -51.2
        ]
      ]
    },
    {
      "id": "osm-road-616829086-1",
      "name": "翔宇桥",
      "kind": "primary",
      "points": [
        [
          1175.55,
          -82.01
        ],
        [
          1172.91,
          -52.4
        ]
      ]
    },
    {
      "id": "osm-road-669715517-1",
      "name": "尚真路",
      "kind": "primary",
      "points": [
        [
          1538.37,
          -997.48
        ],
        [
          1532.42,
          -927.1
        ],
        [
          1527.62,
          -870.25
        ],
        [
          1521.45,
          -797.21
        ]
      ]
    },
    {
      "id": "osm-road-669715518-1",
      "name": "健翮路",
      "kind": "primary",
      "points": [
        [
          1286.11,
          -1248.67
        ],
        [
          1289.98,
          -1293.88
        ],
        [
          1291.15,
          -1307.45
        ],
        [
          1292.89,
          -1327.89
        ]
      ]
    },
    {
      "id": "osm-road-669715519-1",
      "name": "校园道路 021",
      "kind": "primary",
      "points": [
        [
          1288.65,
          -1393.97
        ],
        [
          1288.04,
          -1387.01
        ],
        [
          1286.59,
          -1362.69
        ]
      ]
    },
    {
      "id": "osm-road-669715520-1",
      "name": "校园道路 022",
      "kind": "primary",
      "points": [
        [
          1194.48,
          -116.08
        ],
        [
          1189.18,
          -118.48
        ],
        [
          1183.12,
          -120.48
        ],
        [
          1177.46,
          -120.48
        ],
        [
          1171.68,
          -118.7
        ]
      ]
    },
    {
      "id": "osm-road-669715521-1",
      "name": "翔宇路",
      "kind": "primary",
      "points": [
        [
          1206.75,
          -148.99
        ],
        [
          1222.92,
          -192.55
        ]
      ]
    },
    {
      "id": "osm-road-669715522-1",
      "name": "翔宇路",
      "kind": "primary",
      "points": [
        [
          1222.92,
          -192.55
        ],
        [
          1252.31,
          -274.18
        ]
      ]
    },
    {
      "id": "osm-road-669715523-1",
      "name": "翔宇路",
      "kind": "primary",
      "points": [
        [
          1165.17,
          -154.39
        ],
        [
          1168.15,
          -137
        ],
        [
          1171.68,
          -118.7
        ]
      ]
    },
    {
      "id": "osm-road-669715524-1",
      "name": "翔宇路",
      "kind": "primary",
      "points": [
        [
          1157.82,
          -194.55
        ],
        [
          1165.17,
          -154.39
        ]
      ]
    },
    {
      "id": "osm-road-669715525-1",
      "name": "校园道路 027",
      "kind": "primary",
      "points": [
        [
          1172.91,
          -52.4
        ],
        [
          1170.25,
          -24.12
        ]
      ]
    },
    {
      "id": "osm-road-669715526-1",
      "name": "翔宇桥",
      "kind": "primary",
      "points": [
        [
          1181.83,
          -51.2
        ],
        [
          1184.04,
          -80.41
        ]
      ]
    },
    {
      "id": "osm-road-669743694-1",
      "name": "乐群南路",
      "kind": "primary",
      "points": [
        [
          580.23,
          -197.29
        ],
        [
          581.78,
          -202.8
        ],
        [
          592.03,
          -239.32
        ],
        [
          601.44,
          -275.95
        ],
        [
          602.84,
          -281.16
        ],
        [
          610.78,
          -310.64
        ],
        [
          634.04,
          -396.89
        ],
        [
          638.03,
          -411.71
        ],
        [
          663.27,
          -505.29
        ],
        [
          690.11,
          -610.89
        ],
        [
          702.85,
          -661.01
        ],
        [
          712.3,
          -698.18
        ]
      ]
    },
    {
      "id": "osm-road-669743696-1",
      "name": "日新道",
      "kind": "primary",
      "points": [
        [
          691,
          -707.64
        ],
        [
          712.3,
          -698.18
        ],
        [
          765.07,
          -682.94
        ],
        [
          807.95,
          -671.64
        ],
        [
          820.84,
          -668.24
        ],
        [
          831.74,
          -665.37
        ],
        [
          931.26,
          -639.15
        ],
        [
          937.22,
          -637.58
        ],
        [
          945.09,
          -633.81
        ],
        [
          959.85,
          -626.74
        ],
        [
          980.3,
          -612.36
        ],
        [
          982.17,
          -611.04
        ]
      ]
    },
    {
      "id": "osm-road-669743697-1",
      "name": "尚理路",
      "kind": "primary",
      "points": [
        [
          945.09,
          -633.81
        ],
        [
          922.58,
          -546.19
        ],
        [
          895.95,
          -442.54
        ]
      ]
    },
    {
      "id": "osm-road-669743698-1",
      "name": "尚实路",
      "kind": "primary",
      "points": [
        [
          120.56,
          -467.74
        ],
        [
          125.89,
          -485.74
        ],
        [
          190.71,
          -668.21
        ],
        [
          222.4,
          -757.43
        ]
      ]
    },
    {
      "id": "osm-road-669743700-1",
      "name": "校园道路 033",
      "kind": "primary",
      "points": [
        [
          291.85,
          -732.46
        ],
        [
          312.35,
          -787.15
        ],
        [
          355.96,
          -903.56
        ],
        [
          359.35,
          -912.6
        ],
        [
          367.25,
          -935.66
        ],
        [
          369.63,
          -942.65
        ],
        [
          429.84,
          -1119.15
        ]
      ]
    },
    {
      "id": "osm-road-669743701-1",
      "name": "校园道路 034",
      "kind": "primary",
      "points": [
        [
          622.85,
          -1053.06
        ],
        [
          609.54,
          -1082.61
        ],
        [
          605.27,
          -1090.56
        ],
        [
          594.07,
          -1097.45
        ],
        [
          575.65,
          -1103.79
        ],
        [
          523.81,
          -1121.64
        ],
        [
          475.69,
          -1138.22
        ]
      ]
    },
    {
      "id": "osm-road-669743702-1",
      "name": "尚合路",
      "kind": "primary",
      "points": [
        [
          463.97,
          -1107.51
        ],
        [
          475.69,
          -1138.22
        ],
        [
          516.46,
          -1252.58
        ],
        [
          536.48,
          -1308.74
        ],
        [
          583.17,
          -1445.31
        ]
      ]
    },
    {
      "id": "osm-road-669743703-1",
      "name": "尚体道",
      "kind": "primary",
      "points": [
        [
          478.36,
          -1470.79
        ],
        [
          485.29,
          -1473.44
        ],
        [
          492.23,
          -1475.55
        ],
        [
          500.75,
          -1475.04
        ],
        [
          583.17,
          -1445.31
        ],
        [
          584.52,
          -1444.83
        ],
        [
          712.75,
          -1398.6
        ],
        [
          720.87,
          -1396.21
        ],
        [
          819.88,
          -1369.61
        ],
        [
          965.69,
          -1330.45
        ],
        [
          984.16,
          -1325.47
        ],
        [
          1077.72,
          -1300.27
        ],
        [
          1083.58,
          -1297.1
        ],
        [
          1086.25,
          -1292.33
        ]
      ]
    },
    {
      "id": "osm-road-669743704-1",
      "name": "乐群北路",
      "kind": "primary",
      "points": [
        [
          654.57,
          -722.57
        ],
        [
          681.51,
          -797.23
        ],
        [
          683.66,
          -803.2
        ],
        [
          689.2,
          -818.55
        ],
        [
          691.47,
          -824.85
        ],
        [
          708.97,
          -881.76
        ],
        [
          713.39,
          -901.74
        ],
        [
          746.04,
          -1032.3
        ],
        [
          749.77,
          -1060.37
        ],
        [
          750.67,
          -1075.02
        ],
        [
          749.58,
          -1089.67
        ]
      ]
    },
    {
      "id": "osm-road-669743705-1",
      "name": "尚友道",
      "kind": "primary",
      "points": [
        [
          1051.93,
          -1153.26
        ],
        [
          928.45,
          -1186.93
        ],
        [
          893.69,
          -1196.42
        ],
        [
          879.08,
          -1200.4
        ],
        [
          777.16,
          -1228.53
        ],
        [
          722.46,
          -1243.63
        ],
        [
          714.81,
          -1245.74
        ],
        [
          536.48,
          -1308.74
        ],
        [
          430.43,
          -1347.31
        ]
      ]
    },
    {
      "id": "osm-road-669743706-1",
      "name": "校园道路 039",
      "kind": "primary",
      "points": [
        [
          879.08,
          -1200.4
        ],
        [
          864.3,
          -1147.77
        ],
        [
          852.53,
          -1105.93
        ],
        [
          845.53,
          -1080.99
        ]
      ]
    },
    {
      "id": "osm-road-669743707-1",
      "name": "校园道路 040",
      "kind": "primary",
      "points": [
        [
          928.45,
          -1186.93
        ],
        [
          943.96,
          -1246.69
        ],
        [
          949.98,
          -1269.93
        ],
        [
          965.69,
          -1330.45
        ]
      ]
    },
    {
      "id": "osm-road-669743708-1",
      "name": "校园道路 041",
      "kind": "primary",
      "points": [
        [
          1081.37,
          -1261.36
        ],
        [
          1215.76,
          -1224.83
        ]
      ]
    },
    {
      "id": "osm-road-669743709-1",
      "name": "尚智道",
      "kind": "primary",
      "points": [
        [
          1600.21,
          -1221.2
        ],
        [
          1535.83,
          -1228.32
        ],
        [
          1492.42,
          -1230.37
        ],
        [
          1468.89,
          -1228.32
        ],
        [
          1341.21,
          -1215.25
        ]
      ]
    },
    {
      "id": "osm-road-669743711-1",
      "name": "校园道路 043",
      "kind": "primary",
      "points": [
        [
          1172.33,
          -94.65
        ],
        [
          1177.91,
          -93.45
        ],
        [
          1183.89,
          -92.82
        ],
        [
          1189.7,
          -93.05
        ]
      ]
    },
    {
      "id": "osm-road-669743712-1",
      "name": "敬业南路",
      "kind": "primary",
      "points": [
        [
          1719.97,
          -352.39
        ],
        [
          1696.74,
          -91.69999999999999
        ]
      ]
    },
    {
      "id": "osm-road-669743713-1",
      "name": "公能南道",
      "kind": "primary",
      "points": [
        [
          1882.48,
          -591.75
        ],
        [
          1868.66,
          -431.73
        ],
        [
          1860.75,
          -403.95
        ],
        [
          1843.04,
          -377.39
        ],
        [
          1815.69,
          -356.68
        ],
        [
          1804.89,
          -352.21
        ]
      ]
    },
    {
      "id": "osm-road-669743714-1",
      "name": "校园道路 046",
      "kind": "primary",
      "points": [
        [
          1886.94,
          -654.18
        ],
        [
          1879.2,
          -654.32
        ],
        [
          1873.24,
          -652.48
        ],
        [
          1867.67,
          -649.52
        ],
        [
          1865.44,
          -644.35
        ],
        [
          1864.69,
          -636.18
        ],
        [
          1862.74,
          -614.59
        ],
        [
          1862.09,
          -607.41
        ],
        [
          1863.95,
          -600.76
        ],
        [
          1868.04,
          -596.33
        ],
        [
          1873.99,
          -593.74
        ],
        [
          1882.48,
          -591.75
        ],
        [
          1891.47,
          -591.89
        ],
        [
          1899.65,
          -595.96
        ],
        [
          1902.63,
          -601.12
        ],
        [
          1904.83,
          -617.92
        ],
        [
          1905.63,
          -624.02
        ],
        [
          1906.72,
          -638.81
        ],
        [
          1905.98,
          -645.09
        ],
        [
          1903.37,
          -648.04
        ],
        [
          1899.28,
          -651
        ],
        [
          1894.44,
          -653.59
        ],
        [
          1886.94,
          -654.18
        ]
      ]
    },
    {
      "id": "osm-road-768138928-1",
      "name": "同砚路",
      "kind": "primary",
      "points": [
        [
          -41.72,
          -386.64
        ],
        [
          1.8299999999999983,
          -362.95
        ],
        [
          53.18,
          -336.24
        ],
        [
          128.24,
          -298.75
        ],
        [
          192.58,
          -268.62
        ],
        [
          315.32,
          -213.78
        ]
      ]
    },
    {
      "id": "osm-road-768649898-1",
      "name": "同砚路",
      "kind": "primary",
      "points": [
        [
          2114.18,
          58.75
        ],
        [
          2106.71,
          58.11
        ],
        [
          1922.22,
          42.24
        ],
        [
          1179.61,
          -23.300000000000004
        ],
        [
          1170.25,
          -24.12
        ],
        [
          1071.42,
          -35.18
        ],
        [
          948.04,
          -52.63
        ],
        [
          828.58,
          -76.19
        ],
        [
          773.31,
          -88.2
        ],
        [
          641.09,
          -120.58
        ],
        [
          566.4,
          -141.5
        ]
      ]
    },
    {
      "id": "osm-road-768649899-1",
      "name": "启新道",
      "kind": "primary",
      "points": [
        [
          2166.79,
          -602.48
        ],
        [
          2137.17,
          -604.83
        ],
        [
          2107.54,
          -607.17
        ],
        [
          1905.63,
          -624.02
        ]
      ]
    },
    {
      "id": "osm-road-768649900-1",
      "name": "启新桥",
      "kind": "primary",
      "points": [
        [
          2201.4,
          -599.47
        ],
        [
          2166.79,
          -602.48
        ]
      ]
    },
    {
      "id": "osm-road-768649901-1",
      "name": "同德路",
      "kind": "primary",
      "points": [
        [
          2227.73,
          -1288.85
        ],
        [
          2260.04,
          -1285.84
        ]
      ]
    },
    {
      "id": "osm-road-768649903-1",
      "name": "同德路",
      "kind": "primary",
      "points": [
        [
          2262.22,
          -1293.31
        ],
        [
          2228.17,
          -1296.42
        ]
      ]
    },
    {
      "id": "osm-road-768649904-1",
      "name": "同德路",
      "kind": "primary",
      "points": [
        [
          2228.17,
          -1296.42
        ],
        [
          2222.75,
          -1296.88
        ],
        [
          2025.49,
          -1313.27
        ],
        [
          1963.78,
          -1318.38
        ],
        [
          1772.38,
          -1334.36
        ],
        [
          1674.06,
          -1343.22
        ],
        [
          1601.37,
          -1350.74
        ],
        [
          1593.56,
          -1351.68
        ]
      ]
    },
    {
      "id": "osm-road-768657103-1",
      "name": "思源桥",
      "kind": "primary",
      "points": [
        [
          201.52,
          -984.75
        ],
        [
          175.86,
          -994.17
        ]
      ]
    },
    {
      "id": "osm-road-768657106-1",
      "name": "校园道路 055",
      "kind": "primary",
      "points": [
        [
          1292.89,
          -1327.89
        ],
        [
          1295.73,
          -1361.1
        ]
      ]
    },
    {
      "id": "osm-road-768657107-1",
      "name": "校园道路 056",
      "kind": "primary",
      "points": [
        [
          1295.73,
          -1361.1
        ],
        [
          1297.79,
          -1385.17
        ],
        [
          1298.71,
          -1392.04
        ]
      ]
    },
    {
      "id": "osm-road-768657108-1",
      "name": "健翮路",
      "kind": "primary",
      "points": [
        [
          1283.53,
          -1329.81
        ],
        [
          1281.84,
          -1308.39
        ],
        [
          1277.22,
          -1249.71
        ]
      ]
    },
    {
      "id": "osm-road-768657109-1",
      "name": "校园道路 058",
      "kind": "primary",
      "points": [
        [
          1286.59,
          -1362.69
        ],
        [
          1283.53,
          -1329.81
        ]
      ]
    },
    {
      "id": "osm-road-768657111-1",
      "name": "公能南道",
      "kind": "primary",
      "points": [
        [
          1796.32,
          -349.94
        ],
        [
          1779.21,
          -348.02
        ],
        [
          1762.1,
          -347.84
        ],
        [
          1719.97,
          -352.39
        ],
        [
          1402.67,
          -382.38
        ]
      ]
    },
    {
      "id": "osm-road-768657112-1",
      "name": "校园道路 060",
      "kind": "primary",
      "points": [
        [
          1804.89,
          -352.21
        ],
        [
          1796.32,
          -349.94
        ]
      ]
    },
    {
      "id": "osm-road-768657113-1",
      "name": "尚德道",
      "kind": "primary",
      "points": [
        [
          1909.69,
          -69.58
        ],
        [
          1922.13,
          -68.29
        ]
      ]
    },
    {
      "id": "osm-road-768657114-1",
      "name": "尚勤路",
      "kind": "primary",
      "points": [
        [
          2044,
          -64.82
        ],
        [
          2059.22,
          -81.61
        ],
        [
          2062.04,
          -90.02
        ],
        [
          2063.73,
          -113.54
        ],
        [
          2106.96,
          -600.52
        ],
        [
          2107.54,
          -607.17
        ]
      ]
    },
    {
      "id": "osm-road-768657118-1",
      "name": "日新道",
      "kind": "primary",
      "points": [
        [
          1460.12,
          -566.14
        ],
        [
          1468.22,
          -568.12
        ]
      ]
    },
    {
      "id": "osm-road-768657119-1",
      "name": "日新道",
      "kind": "primary",
      "points": [
        [
          1468.22,
          -568.12
        ],
        [
          1488.09,
          -571.66
        ],
        [
          1505.11,
          -573.56
        ],
        [
          1514.45,
          -573.78
        ],
        [
          1518.09,
          -573.87
        ],
        [
          1737.37,
          -555.02
        ]
      ]
    },
    {
      "id": "osm-road-831713336-1",
      "name": "公能南道",
      "kind": "primary",
      "points": [
        [
          529.63,
          -559.4
        ],
        [
          536.05,
          -549.11
        ],
        [
          547.58,
          -539.19
        ],
        [
          565.24,
          -531.72
        ],
        [
          586.74,
          -525.92
        ],
        [
          663.27,
          -505.29
        ],
        [
          758.62,
          -479.57
        ],
        [
          768.42,
          -476.93
        ],
        [
          780.25,
          -473.73
        ],
        [
          783.9,
          -472.75
        ],
        [
          862.47,
          -451.56
        ],
        [
          895.95,
          -442.54
        ],
        [
          921.56,
          -435.64
        ]
      ]
    },
    {
      "id": "osm-road-831713337-1",
      "name": "公能南道",
      "kind": "primary",
      "points": [
        [
          523.48,
          -571.34
        ],
        [
          529.63,
          -559.4
        ]
      ]
    },
    {
      "id": "osm-road-832080306-1",
      "name": "校园道路 067",
      "kind": "primary",
      "points": [
        [
          402.03,
          -307.89
        ],
        [
          389.81,
          -313.26
        ]
      ]
    },
    {
      "id": "osm-road-832080307-1",
      "name": "尚美道",
      "kind": "primary",
      "points": [
        [
          947.17,
          -428.73
        ],
        [
          920.79,
          -328.95
        ],
        [
          919.06,
          -322.41
        ],
        [
          888.49,
          -206.75
        ],
        [
          882.02,
          -182.26
        ],
        [
          875.62,
          -174.31
        ],
        [
          869.76,
          -170.6
        ],
        [
          862.82,
          -170.07
        ],
        [
          778.03,
          -191.76
        ],
        [
          684.21,
          -215.75
        ],
        [
          592.03,
          -239.32
        ],
        [
          562.35,
          -250.03
        ],
        [
          422.65,
          -300.45
        ],
        [
          402.03,
          -307.89
        ]
      ]
    },
    {
      "id": "osm-road-832081508-1",
      "name": "日新道",
      "kind": "primary",
      "points": [
        [
          678.35,
          -712.59
        ],
        [
          691,
          -707.64
        ]
      ]
    },
    {
      "id": "osm-road-832081509-1",
      "name": "日新道",
      "kind": "primary",
      "points": [
        [
          493.75,
          -780.66
        ],
        [
          547.96,
          -761.08
        ],
        [
          579.73,
          -749.6
        ],
        [
          654.57,
          -722.57
        ],
        [
          678.35,
          -712.59
        ]
      ]
    },
    {
      "id": "osm-road-832081511-1",
      "name": "日新道",
      "kind": "primary",
      "points": [
        [
          982.17,
          -611.04
        ],
        [
          995.81,
          -602.46
        ]
      ]
    },
    {
      "id": "osm-road-832084534-1",
      "name": "校园道路 072",
      "kind": "primary",
      "points": [
        [
          1866.79,
          -953.44
        ],
        [
          1880.36,
          -939.96
        ],
        [
          1887.23,
          -930.6
        ],
        [
          1890.7,
          -925.89
        ],
        [
          1898.29,
          -910.92
        ]
      ]
    },
    {
      "id": "osm-road-832084535-1",
      "name": "公能北道",
      "kind": "primary",
      "points": [
        [
          1849.84,
          -964.38
        ],
        [
          1866.79,
          -953.44
        ]
      ]
    },
    {
      "id": "osm-road-832154230-1",
      "name": "乐群南桥",
      "kind": "primary",
      "points": [
        [
          573.27,
          -169.17
        ],
        [
          580.23,
          -197.29
        ]
      ]
    },
    {
      "id": "osm-road-832154231-1",
      "name": "校园道路 075",
      "kind": "primary",
      "points": [
        [
          563.08,
          -128.86
        ],
        [
          566.4,
          -141.5
        ]
      ]
    },
    {
      "id": "osm-road-850300951-1",
      "name": "五登房村路",
      "kind": "primary",
      "points": [
        [
          1893.25,
          -715.65
        ],
        [
          2179.99,
          -687.79
        ]
      ]
    },
    {
      "id": "osm-road-850300952-1",
      "name": "五登房村路",
      "kind": "primary",
      "points": [
        [
          2179.99,
          -687.79
        ],
        [
          2208.44,
          -684.95
        ]
      ]
    },
    {
      "id": "osm-road-850300953-1",
      "name": "五登房村路",
      "kind": "primary",
      "points": [
        [
          2208.44,
          -684.95
        ],
        [
          2222.4,
          -683.71
        ],
        [
          2228.95,
          -682.66
        ]
      ]
    },
    {
      "id": "osm-road-850300954-1",
      "name": "校园道路 079",
      "kind": "walkway",
      "points": [
        [
          1864.69,
          -636.18
        ],
        [
          1820.03,
          -640.15
        ],
        [
          1803.82,
          -641.59
        ],
        [
          1788.64,
          -642.94
        ],
        [
          1772.8,
          -644.3
        ]
      ]
    },
    {
      "id": "osm-road-850300955-1",
      "name": "校园道路 080",
      "kind": "walkway",
      "points": [
        [
          1771.3,
          -622.27
        ],
        [
          1783.97,
          -621.28
        ],
        [
          1802.32,
          -619.72
        ],
        [
          1817.85,
          -618.32
        ],
        [
          1862.74,
          -614.59
        ]
      ]
    },
    {
      "id": "osm-road-850300957-1",
      "name": "校园道路 081",
      "kind": "walkway",
      "points": [
        [
          1803.82,
          -641.59
        ],
        [
          1802.32,
          -619.72
        ],
        [
          1799.9,
          -597.25
        ],
        [
          1815.83,
          -595.43
        ],
        [
          1817.85,
          -618.32
        ],
        [
          1820.03,
          -640.15
        ],
        [
          1821.64,
          -663.88
        ],
        [
          1806.64,
          -665.4
        ],
        [
          1803.82,
          -641.59
        ]
      ]
    },
    {
      "id": "osm-road-850300958-1",
      "name": "月异道",
      "kind": "primary",
      "points": [
        [
          1757.62,
          -777.15
        ],
        [
          1640.83,
          -787.07
        ],
        [
          1521.45,
          -797.21
        ],
        [
          1466.48,
          -801.85
        ],
        [
          1453.44,
          -802.96
        ],
        [
          1432.06,
          -804.76
        ],
        [
          1263.37,
          -817.79
        ],
        [
          1252.82,
          -818.6
        ],
        [
          1232.2,
          -820.19
        ],
        [
          1222.89,
          -820.91
        ],
        [
          1054.78,
          -833.9
        ],
        [
          1022.75,
          -834.24
        ],
        [
          966.97,
          -834.82
        ],
        [
          908.66,
          -848.14
        ],
        [
          844.22,
          -865.83
        ],
        [
          833.81,
          -868.68
        ],
        [
          824.05,
          -871.36
        ],
        [
          713.39,
          -901.74
        ],
        [
          609.54,
          -936.73
        ],
        [
          559.08,
          -954.38
        ]
      ]
    },
    {
      "id": "osm-road-850300959-1",
      "name": "校园道路 083",
      "kind": "primary",
      "points": [
        [
          463.97,
          -1107.51
        ],
        [
          448.66,
          -1057.18
        ],
        [
          449.27,
          -1052.31
        ],
        [
          452.95,
          -1049.88
        ],
        [
          462.49,
          -1046.61
        ],
        [
          576.96,
          -1007.31
        ]
      ]
    },
    {
      "id": "osm-road-850300960-1",
      "name": "校园道路 084",
      "kind": "primary",
      "points": [
        [
          224.45,
          -977
        ],
        [
          236.61,
          -1009.05
        ],
        [
          241.39,
          -1014.13
        ],
        [
          249.09,
          -1015.91
        ],
        [
          263.22,
          -1012.89
        ],
        [
          286.44,
          -1003.57
        ],
        [
          320.11,
          -990.12
        ],
        [
          324.32,
          -978.09
        ],
        [
          324.01,
          -971.7
        ],
        [
          318.05,
          -955.87
        ],
        [
          306.23,
          -924.45
        ],
        [
          301.35,
          -911.48
        ],
        [
          297.37,
          -906.31
        ],
        [
          290.01,
          -904.78
        ],
        [
          281.75,
          -905.7
        ],
        [
          257.45,
          -913.96
        ],
        [
          245.23,
          -918.11
        ],
        [
          224.47,
          -925.16
        ],
        [
          218.35,
          -933.08
        ],
        [
          217.13,
          -939.77
        ],
        [
          218.35,
          -949.5
        ],
        [
          221.55,
          -968.34
        ],
        [
          224.45,
          -977
        ]
      ]
    },
    {
      "id": "osm-road-850300961-1",
      "name": "校园道路 085",
      "kind": "walkway",
      "points": [
        [
          331.97,
          -1128.66
        ],
        [
          335.34,
          -1142.04
        ],
        [
          337.18,
          -1156.34
        ],
        [
          337.79,
          -1170.93
        ],
        [
          335.04,
          -1187.37
        ],
        [
          331.97,
          -1198
        ],
        [
          324.32,
          -1215.65
        ],
        [
          319.12,
          -1229.34
        ],
        [
          316.97,
          -1243.94
        ],
        [
          318.19,
          -1262.19
        ]
      ]
    },
    {
      "id": "osm-road-850300962-1",
      "name": "校园道路 086",
      "kind": "primary",
      "points": [
        [
          331.97,
          -1128.66
        ],
        [
          316.05,
          -1134.14
        ],
        [
          296.14,
          -1076.04
        ],
        [
          312.19,
          -1070.01
        ]
      ]
    },
    {
      "id": "osm-road-850300963-1",
      "name": "雅深路",
      "kind": "primary",
      "points": [
        [
          -50.85,
          -423.43
        ],
        [
          -34.38,
          -471.1
        ],
        [
          150.9,
          -994.48
        ],
        [
          153.67,
          -1002.39
        ],
        [
          292.37,
          -1390.22
        ],
        [
          364.26,
          -1591.25
        ],
        [
          371.26,
          -1608.1
        ]
      ]
    },
    {
      "id": "osm-road-858364072-1",
      "name": "同砚路",
      "kind": "primary",
      "points": [
        [
          563.08,
          -128.86
        ],
        [
          567.39,
          -127.59
        ],
        [
          639.76,
          -108.06
        ],
        [
          816.03,
          -64.61
        ],
        [
          904.27,
          -47.68
        ],
        [
          1069.11,
          -23.68
        ],
        [
          1169.11,
          -13.04
        ],
        [
          1178.59,
          -12.11
        ],
        [
          1921.49,
          54.13000000000001
        ],
        [
          2112.05,
          70.65
        ]
      ]
    },
    {
      "id": "osm-road-858364073-1",
      "name": "同砚路",
      "kind": "primary",
      "points": [
        [
          314.68,
          -229.81
        ],
        [
          264.72,
          -251.04
        ],
        [
          123.20999999999998,
          -315.41
        ],
        [
          -40.459999999999994,
          -399.79
        ]
      ]
    },
    {
      "id": "osm-road-858364074-1",
      "name": "校园道路 090",
      "kind": "primary",
      "points": [
        [
          566.4,
          -141.5
        ],
        [
          573.27,
          -169.17
        ]
      ]
    },
    {
      "id": "osm-road-858364076-1",
      "name": "校园道路 091",
      "kind": "primary",
      "points": [
        [
          1170.25,
          -24.12
        ],
        [
          1169.11,
          -13.04
        ]
      ]
    },
    {
      "id": "osm-road-858364078-1",
      "name": "和慧南路",
      "kind": "primary",
      "points": [
        [
          2167.29,
          63.51
        ],
        [
          2180.04,
          -95.05000000000001
        ],
        [
          2192.8,
          -253.60000000000002
        ],
        [
          2209.01,
          -453.91
        ],
        [
          2222.3,
          -591.83
        ],
        [
          2223.09,
          -598.05
        ],
        [
          2228.95,
          -682.66
        ],
        [
          2252.6,
          -943.15
        ],
        [
          2282.21,
          -1284.16
        ],
        [
          2282.7,
          -1291.45
        ],
        [
          2294.76,
          -1429.5792669210732
        ]
      ]
    },
    {
      "id": "osm-road-944981428-1",
      "name": "思源路",
      "kind": "primary",
      "points": [
        [
          224.45,
          -977
        ],
        [
          214.9,
          -980.23
        ],
        [
          201.52,
          -984.75
        ]
      ]
    },
    {
      "id": "osm-road-944981429-1",
      "name": "思源路",
      "kind": "primary",
      "points": [
        [
          198.68,
          -976.51
        ],
        [
          211.95,
          -971.77
        ],
        [
          221.55,
          -968.34
        ]
      ]
    },
    {
      "id": "osm-road-944981430-1",
      "name": "思源桥",
      "kind": "primary",
      "points": [
        [
          172.96,
          -986.34
        ],
        [
          198.68,
          -976.51
        ]
      ]
    },
    {
      "id": "osm-road-944981431-1",
      "name": "校园道路 096",
      "kind": "primary",
      "points": [
        [
          45.58,
          -1036.35
        ],
        [
          49.07,
          -1030.36
        ],
        [
          84.35,
          -1017.45
        ],
        [
          93.63,
          -1016.3
        ],
        [
          141.52,
          -999.52
        ],
        [
          150.9,
          -994.48
        ],
        [
          172.96,
          -986.34
        ]
      ]
    },
    {
      "id": "osm-road-944981434-1",
      "name": "校园道路 097",
      "kind": "walkway",
      "points": [
        [
          120.56,
          -467.74
        ],
        [
          48.17,
          -452.75
        ]
      ]
    },
    {
      "id": "osm-road-944981435-1",
      "name": "校园道路 098",
      "kind": "walkway",
      "points": [
        [
          39.31,
          -457.29
        ],
        [
          37.15,
          -456.23
        ],
        [
          35.47,
          -454.5
        ],
        [
          34.46,
          -452.33
        ],
        [
          34.23,
          -449.94
        ],
        [
          34.82,
          -447.61
        ],
        [
          36.16,
          -445.61
        ],
        [
          38.08,
          -444.16
        ],
        [
          40.39,
          -443.43
        ],
        [
          42.8,
          -443.51
        ],
        [
          45.05,
          -444.37
        ],
        [
          46.88,
          -445.94
        ],
        [
          48.1,
          -448.01
        ],
        [
          48.54,
          -450.38
        ],
        [
          48.17,
          -452.75
        ],
        [
          47.15,
          -454.68
        ],
        [
          45.6,
          -456.23
        ],
        [
          43.66,
          -457.22
        ],
        [
          41.48,
          -457.6
        ],
        [
          39.31,
          -457.29
        ]
      ]
    },
    {
      "id": "osm-road-944981436-1",
      "name": "校园道路 099",
      "kind": "walkway",
      "points": [
        [
          39.31,
          -457.29
        ],
        [
          37.92,
          -461.65
        ],
        [
          35.83,
          -469.49
        ],
        [
          35.13,
          -478.01
        ],
        [
          35.83,
          -487.23
        ],
        [
          37.69,
          -501.07
        ],
        [
          42.33,
          -516.51
        ],
        [
          48.83,
          -531.04
        ],
        [
          57.42,
          -544.88
        ],
        [
          67.63,
          -556.17
        ],
        [
          75.75,
          -565.85
        ]
      ]
    },
    {
      "id": "osm-road-954128553-1",
      "name": "乐群北路",
      "kind": "primary",
      "points": [
        [
          753.54,
          -1122.26
        ],
        [
          746.35,
          -1155.89
        ],
        [
          741.78,
          -1172.67
        ],
        [
          722.46,
          -1243.63
        ],
        [
          718.96,
          -1266.3
        ],
        [
          715.71,
          -1288.43
        ],
        [
          715.48,
          -1317.48
        ],
        [
          715.48,
          -1339.15
        ],
        [
          717.34,
          -1368.88
        ],
        [
          720.87,
          -1396.21
        ],
        [
          725.49,
          -1419.59
        ],
        [
          728.95,
          -1437.12
        ],
        [
          721.7,
          -1438.62
        ]
      ]
    },
    {
      "id": "osm-road-954128554-1",
      "name": "乐群北桥",
      "kind": "primary",
      "points": [
        [
          733.14,
          -1451.54
        ],
        [
          742.57,
          -1483.03
        ]
      ]
    },
    {
      "id": "osm-road-954128555-1",
      "name": "乐群北桥",
      "kind": "primary",
      "points": [
        [
          735.11,
          -1484.82
        ],
        [
          731.83,
          -1473.54
        ],
        [
          725.99,
          -1453.5
        ]
      ]
    },
    {
      "id": "osm-road-954128556-1",
      "name": "乐群北路",
      "kind": "primary",
      "points": [
        [
          725.99,
          -1453.5
        ],
        [
          721.7,
          -1438.62
        ]
      ]
    },
    {
      "id": "osm-road-954128557-1",
      "name": "乐群北路",
      "kind": "primary",
      "points": [
        [
          728.95,
          -1437.12
        ],
        [
          733.14,
          -1451.54
        ]
      ]
    },
    {
      "id": "osm-road-954128558-1",
      "name": "乐群北路",
      "kind": "primary",
      "points": [
        [
          741.66,
          -1507.32
        ],
        [
          735.11,
          -1484.82
        ]
      ]
    },
    {
      "id": "osm-road-954128559-1",
      "name": "乐群北路",
      "kind": "primary",
      "points": [
        [
          742.57,
          -1483.03
        ],
        [
          749.28,
          -1505.45
        ]
      ]
    },
    {
      "id": "osm-road-954128560-1",
      "name": "校园道路 107",
      "kind": "primary",
      "points": [
        [
          516.46,
          -1252.58
        ],
        [
          563.3,
          -1235.93
        ],
        [
          708.47,
          -1184.34
        ],
        [
          733.63,
          -1175.4
        ],
        [
          741.78,
          -1172.67
        ]
      ]
    },
    {
      "id": "osm-road-954128562-1",
      "name": "校园道路 108",
      "kind": "primary",
      "points": [
        [
          708.47,
          -1184.34
        ],
        [
          680.9,
          -1107.94
        ],
        [
          690.45,
          -1088.03
        ]
      ]
    },
    {
      "id": "osm-road-954128564-1",
      "name": "校园道路 109",
      "kind": "primary",
      "points": [
        [
          707.46,
          -1317.27
        ],
        [
          715.48,
          -1317.48
        ],
        [
          744.03,
          -1318.41
        ],
        [
          748.68,
          -1315.86
        ],
        [
          752.39,
          -1308.95
        ],
        [
          754.94,
          -1302.96
        ],
        [
          759.12,
          -1299.96
        ],
        [
          765.15,
          -1299.73
        ],
        [
          768.86,
          -1299.96
        ],
        [
          796.72,
          -1308.72
        ],
        [
          800.2,
          -1311.02
        ],
        [
          802.98,
          -1314.48
        ],
        [
          805.77,
          -1320.94
        ],
        [
          819.88,
          -1369.61
        ]
      ]
    },
    {
      "id": "osm-road-954128565-1",
      "name": "校园道路 110",
      "kind": "walkway",
      "points": [
        [
          717.96,
          -1421.23
        ],
        [
          705.96,
          -1423.74
        ],
        [
          697.61,
          -1427.2
        ],
        [
          685.54,
          -1433.89
        ],
        [
          669.06,
          -1445.41
        ],
        [
          655.36,
          -1452.79
        ],
        [
          642.83,
          -1457.86
        ],
        [
          628.9,
          -1460.86
        ],
        [
          616.37,
          -1461.55
        ],
        [
          590.14,
          -1461.73
        ],
        [
          560.12,
          -1468.85
        ],
        [
          537.73,
          -1480.43
        ],
        [
          475.57,
          -1531.74
        ],
        [
          440.92,
          -1537.13
        ],
        [
          401.66,
          -1519.46
        ],
        [
          384.09,
          -1476.19
        ],
        [
          390.12,
          -1444.07
        ],
        [
          381.62,
          -1362.06
        ],
        [
          361.44,
          -1322.51
        ],
        [
          324.53,
          -1286.65
        ],
        [
          318.19,
          -1262.19
        ]
      ]
    },
    {
      "id": "osm-road-954128566-1",
      "name": "校园道路 111",
      "kind": "walkway",
      "points": [
        [
          725.49,
          -1419.59
        ],
        [
          747.74,
          -1417.06
        ],
        [
          768.41,
          -1415.45
        ],
        [
          783.72,
          -1416.83
        ],
        [
          806.24,
          -1419.83
        ],
        [
          818.77,
          -1420.06
        ],
        [
          834.09,
          -1418.68
        ],
        [
          847.08,
          -1415.68
        ],
        [
          868.44,
          -1410.14
        ],
        [
          887.94,
          -1403.46
        ],
        [
          892.12,
          -1403.23
        ],
        [
          912.77,
          -1406.22
        ]
      ]
    },
    {
      "id": "osm-road-954128577-1",
      "name": "校园道路 112",
      "kind": "primary",
      "points": [
        [
          2216.38,
          -598.47
        ],
        [
          2201.4,
          -599.47
        ]
      ]
    },
    {
      "id": "osm-road-954128578-1",
      "name": "启新道",
      "kind": "primary",
      "points": [
        [
          1904.83,
          -617.92
        ],
        [
          2106.96,
          -600.52
        ],
        [
          2136.7,
          -597.98
        ],
        [
          2162.5,
          -595.79
        ],
        [
          2165.96,
          -595.5
        ]
      ]
    },
    {
      "id": "osm-road-954128579-1",
      "name": "校园道路 114",
      "kind": "primary",
      "points": [
        [
          2201.18,
          -592.77
        ],
        [
          2215.98,
          -592.05
        ]
      ]
    },
    {
      "id": "osm-road-954128580-1",
      "name": "启新桥",
      "kind": "primary",
      "points": [
        [
          2165.96,
          -595.5
        ],
        [
          2201.18,
          -592.77
        ]
      ]
    },
    {
      "id": "osm-road-954128582-1",
      "name": "同声路",
      "kind": "primary",
      "points": [
        [
          2223.09,
          -598.05
        ],
        [
          2216.38,
          -598.47
        ]
      ]
    },
    {
      "id": "osm-road-954128584-1",
      "name": "同声路",
      "kind": "primary",
      "points": [
        [
          2215.98,
          -592.05
        ],
        [
          2222.3,
          -591.83
        ]
      ]
    },
    {
      "id": "osm-road-1239340442-1",
      "name": "校园道路 118",
      "kind": "primary",
      "points": [
        [
          325.91,
          -720.21
        ],
        [
          295.42,
          -631.59
        ],
        [
          256.52,
          -520.35
        ]
      ]
    },
    {
      "id": "osm-road-1239340443-1",
      "name": "校园道路 119",
      "kind": "primary",
      "points": [
        [
          256.52,
          -520.35
        ],
        [
          429.01,
          -458.05
        ]
      ]
    },
    {
      "id": "osm-road-1239340444-1",
      "name": "尚锐道",
      "kind": "primary",
      "points": [
        [
          295.42,
          -631.59
        ],
        [
          468.7,
          -569.51
        ]
      ]
    },
    {
      "id": "osm-road-1239340445-1",
      "name": "尚俊路",
      "kind": "primary",
      "points": [
        [
          378.29,
          -318.43
        ],
        [
          429.01,
          -458.05
        ],
        [
          468.7,
          -569.51
        ]
      ]
    },
    {
      "id": "osm-road-1239340446-1",
      "name": "尚锐道",
      "kind": "primary",
      "points": [
        [
          295.42,
          -631.59
        ],
        [
          190.71,
          -668.21
        ]
      ]
    },
    {
      "id": "osm-road-1239340447-1",
      "name": "校园道路 123",
      "kind": "primary",
      "points": [
        [
          634.04,
          -396.89
        ],
        [
          740.44,
          -369.08
        ],
        [
          757.23,
          -364.7
        ],
        [
          832.32,
          -345.08
        ],
        [
          919.06,
          -322.41
        ]
      ]
    },
    {
      "id": "osm-road-1427753288-1",
      "name": "同德路",
      "kind": "primary",
      "points": [
        [
          356.64,
          -1635.41
        ],
        [
          369.93,
          -1630.04
        ],
        [
          371.84,
          -1629.03
        ],
        [
          378.78,
          -1626.21
        ],
        [
          396.5,
          -1619.82
        ],
        [
          431.78,
          -1607.47
        ],
        [
          520.99,
          -1577.17
        ],
        [
          613.38,
          -1546.26
        ],
        [
          741.66,
          -1507.32
        ]
      ]
    },
    {
      "id": "osm-road-1427753289-1",
      "name": "宁慧路",
      "kind": "primary",
      "points": [
        [
          1158.11,
          -1417.05
        ],
        [
          1156.76,
          -1410.37
        ]
      ]
    },
    {
      "id": "osm-road-1427753290-1",
      "name": "同德路",
      "kind": "primary",
      "points": [
        [
          1158.11,
          -1417.05
        ],
        [
          1077.21,
          -1433.22
        ],
        [
          971.62,
          -1456.79
        ],
        [
          884.63,
          -1477.69
        ],
        [
          753.03,
          -1513.13
        ],
        [
          744.89,
          -1515.1
        ],
        [
          615.77,
          -1554.44
        ],
        [
          528.13,
          -1582.07
        ],
        [
          382.09,
          -1632.35
        ],
        [
          372.78,
          -1635.73
        ],
        [
          356.7,
          -1642.42
        ]
      ]
    },
    {
      "id": "osm-road-1430904056-1",
      "name": "公能西路",
      "kind": "primary",
      "points": [
        [
          1013.15,
          -410.94
        ],
        [
          1021.01,
          -487.56
        ],
        [
          1023.2,
          -508.88
        ],
        [
          1030.82,
          -583.28
        ],
        [
          1036.37,
          -648.65
        ],
        [
          1040.62,
          -698.71
        ],
        [
          1043.62,
          -734.13
        ],
        [
          1049.22,
          -800.14
        ],
        [
          1054.78,
          -833.9
        ],
        [
          1061.49,
          -851.07
        ],
        [
          1108.95,
          -972.29
        ],
        [
          1118.06,
          -995.19
        ],
        [
          1121.44,
          -1003.7
        ],
        [
          1124.9,
          -1012.48
        ],
        [
          1137.97,
          -1045.61
        ],
        [
          1172.28,
          -1132.62
        ],
        [
          1194.9,
          -1189.99
        ],
        [
          1204.1,
          -1208.02
        ],
        [
          1215.76,
          -1224.83
        ],
        [
          1236.2,
          -1239.34
        ],
        [
          1250.16,
          -1246.31
        ],
        [
          1265.18,
          -1249.07
        ],
        [
          1277.22,
          -1249.71
        ],
        [
          1286.11,
          -1248.67
        ]
      ]
    },
    {
      "id": "osm-road-1430904057-1",
      "name": "公能南道",
      "kind": "primary",
      "points": [
        [
          1402.67,
          -382.38
        ],
        [
          1393.44,
          -298.14
        ],
        [
          1384.22,
          -286.61
        ],
        [
          1371.34,
          -276.3
        ],
        [
          1364.6,
          -272.79
        ],
        [
          1360.04,
          -270.41
        ],
        [
          1340.65,
          -267.24
        ],
        [
          1252.31,
          -274.18
        ],
        [
          1242.72,
          -275.03
        ],
        [
          1148.8,
          -283.35
        ],
        [
          1141.48,
          -284
        ],
        [
          1085.81,
          -290.01
        ],
        [
          1040.48,
          -294.9
        ],
        [
          1018.44,
          -313.4
        ],
        [
          1012.28,
          -329.04
        ],
        [
          1009.8,
          -344.67
        ],
        [
          1012.56,
          -399.39
        ],
        [
          1013.15,
          -410.94
        ]
      ]
    },
    {
      "id": "osm-road-1430904065-1",
      "name": "校园道路 129",
      "kind": "secondary",
      "points": [
        [
          2106.71,
          58.11
        ],
        [
          2161.22,
          -578.27
        ]
      ]
    },
    {
      "id": "osm-road-1430904066-1",
      "name": "校园道路 130",
      "kind": "walkway",
      "points": [
        [
          2161.22,
          -578.27
        ],
        [
          2162.5,
          -595.79
        ]
      ]
    },
    {
      "id": "osm-road-1430918548-1",
      "name": "校园道路 131",
      "kind": "walkway",
      "points": [
        [
          967.31,
          -423.3
        ],
        [
          975.53,
          -446.55
        ],
        [
          977.3,
          -453.95
        ],
        [
          970.95,
          -476.08
        ],
        [
          958.99,
          -486.46
        ],
        [
          952.29,
          -501.87
        ],
        [
          954.61,
          -524.54
        ],
        [
          966.02,
          -535.52
        ],
        [
          974.91,
          -544.09
        ],
        [
          974.44,
          -550.88
        ],
        [
          967.12,
          -564.47
        ],
        [
          965.44,
          -580.57
        ],
        [
          977.67,
          -607.38
        ],
        [
          980.3,
          -612.36
        ]
      ]
    },
    {
      "id": "osm-road-1430918549-1",
      "name": "校园道路 132",
      "kind": "walkway",
      "points": [
        [
          970.95,
          -476.08
        ],
        [
          978.47,
          -477.57
        ],
        [
          990.5,
          -479.68
        ],
        [
          1008.06,
          -488.57
        ],
        [
          1021.01,
          -487.56
        ]
      ]
    },
    {
      "id": "osm-road-1431157128-1",
      "name": "校园道路 133",
      "kind": "walkway",
      "points": [
        [
          1429.54,
          -738.82
        ],
        [
          1483.64,
          -734.86
        ],
        [
          1509.27,
          -758.65
        ],
        [
          1557.95,
          -738.28
        ],
        [
          1542.36,
          -694.12
        ]
      ]
    },
    {
      "id": "osm-road-1431157130-1",
      "name": "校园道路 134",
      "kind": "walkway",
      "points": [
        [
          1743.34,
          -620.4
        ],
        [
          1727.06,
          -618.19
        ],
        [
          1701.82,
          -614.76
        ],
        [
          1667.86,
          -595.19
        ],
        [
          1642.44,
          -585.51
        ],
        [
          1603.74,
          -591.41
        ],
        [
          1563.6,
          -601.08
        ],
        [
          1546.75,
          -598.48
        ],
        [
          1514.45,
          -573.78
        ]
      ]
    },
    {
      "id": "osm-road-1431157133-1",
      "name": "校园道路 135",
      "kind": "walkway",
      "points": [
        [
          1788.64,
          -642.94
        ],
        [
          1783.86,
          -676.51
        ],
        [
          1776.37,
          -716.59
        ],
        [
          1786.44,
          -747.72
        ],
        [
          1807.23,
          -772.57
        ],
        [
          1837.03,
          -797.74
        ],
        [
          1848.81,
          -807.69
        ],
        [
          1864.48,
          -833.42
        ],
        [
          1864.97,
          -889.08
        ],
        [
          1871.91,
          -912.64
        ],
        [
          1884.3,
          -926.61
        ],
        [
          1887.23,
          -930.6
        ]
      ]
    },
    {
      "id": "osm-road-1431157138-1",
      "name": "公能北道",
      "kind": "primary",
      "points": [
        [
          733.62,
          -1103.96
        ],
        [
          716.79,
          -1099.7
        ],
        [
          690.45,
          -1088.03
        ],
        [
          674.97,
          -1081.16
        ],
        [
          622.85,
          -1053.06
        ],
        [
          611.66,
          -1047.03
        ],
        [
          585.53,
          -1028.69
        ],
        [
          576.96,
          -1007.31
        ],
        [
          559.08,
          -954.38
        ],
        [
          534.03,
          -888.65
        ],
        [
          531.49,
          -881.97
        ],
        [
          531,
          -880.68
        ]
      ]
    },
    {
      "id": "osm-road-1431157140-1",
      "name": "校园道路 137",
      "kind": "walkway",
      "points": [
        [
          654.57,
          -722.57
        ],
        [
          642.91,
          -688.07
        ],
        [
          632.13,
          -656.18
        ]
      ]
    },
    {
      "id": "osm-road-1433084259-1",
      "name": "校园道路 138",
      "kind": "walkway",
      "points": [
        [
          312.35,
          -787.15
        ],
        [
          252.57,
          -899.77
        ]
      ]
    },
    {
      "id": "osm-road-1433084260-1",
      "name": "校园道路 139",
      "kind": "walkway",
      "points": [
        [
          257.45,
          -913.96
        ],
        [
          252.57,
          -899.77
        ],
        [
          211.16,
          -779.4
        ],
        [
          190.4,
          -746.26
        ],
        [
          165.28,
          -729.3
        ],
        [
          155.81,
          -724.26
        ],
        [
          129.44,
          -710.25
        ],
        [
          111.34,
          -696.8
        ],
        [
          99.05,
          -668.95
        ],
        [
          99.66,
          -624.8
        ],
        [
          99.75,
          -618.37
        ],
        [
          83.71,
          -574.27
        ],
        [
          75.75,
          -565.85
        ]
      ]
    },
    {
      "id": "osm-road-1433084262-1",
      "name": "校园道路 140",
      "kind": "walkway",
      "points": [
        [
          1036.37,
          -648.65
        ],
        [
          1177.89,
          -636.63
        ],
        [
          1176.95,
          -625.75
        ],
        [
          1171.99,
          -568.14
        ]
      ]
    },
    {
      "id": "osm-road-1434881521-1",
      "name": "校园道路 141",
      "kind": "walkway",
      "points": [
        [
          1769.61,
          -530.57
        ],
        [
          1775.67,
          -551.02
        ],
        [
          1779.72,
          -569.15
        ],
        [
          1782.24,
          -599.4
        ],
        [
          1783.97,
          -621.28
        ]
      ]
    },
    {
      "id": "osm-road-1434881522-1",
      "name": "校园道路 142",
      "kind": "walkway",
      "points": [
        [
          1768.95,
          -437.74
        ],
        [
          1764.03,
          -448.79
        ],
        [
          1749.57,
          -460.85
        ],
        [
          1747.62,
          -463.85
        ],
        [
          1747.03,
          -470.14
        ],
        [
          1749.15,
          -484.25
        ],
        [
          1755.99,
          -500.73
        ],
        [
          1764.59,
          -518.45
        ]
      ]
    },
    {
      "id": "osm-road-1434881523-1",
      "name": "校园道路 143",
      "kind": "walkway",
      "points": [
        [
          1764.59,
          -518.45
        ],
        [
          1769.61,
          -530.57
        ]
      ]
    },
    {
      "id": "osm-road-1434881524-1",
      "name": "校园道路 144",
      "kind": "walkway",
      "points": [
        [
          780.25,
          -473.73
        ],
        [
          807.45,
          -574.96
        ],
        [
          831.74,
          -665.37
        ]
      ]
    },
    {
      "id": "osm-road-1434881525-1",
      "name": "校园道路 145",
      "kind": "walkway",
      "points": [
        [
          758.62,
          -479.57
        ],
        [
          791.49,
          -607.57
        ],
        [
          807.95,
          -671.64
        ]
      ]
    },
    {
      "id": "osm-road-1434881526-1",
      "name": "校园道路 146",
      "kind": "walkway",
      "points": [
        [
          807.45,
          -574.96
        ],
        [
          922.58,
          -546.19
        ]
      ]
    },
    {
      "id": "osm-road-1434881527-1",
      "name": "校园道路 147",
      "kind": "walkway",
      "points": [
        [
          791.49,
          -607.57
        ],
        [
          720.06,
          -625.25
        ],
        [
          727.5,
          -654.91
        ],
        [
          702.85,
          -661.01
        ]
      ]
    },
    {
      "id": "osm-road-1434881528-1",
      "name": "校园道路 148",
      "kind": "walkway",
      "points": [
        [
          820.84,
          -668.24
        ],
        [
          825.31,
          -684.82
        ]
      ]
    },
    {
      "id": "osm-road-1434881529-1",
      "name": "校园道路 149",
      "kind": "walkway",
      "points": [
        [
          827.01,
          -693.94
        ],
        [
          825.99,
          -702.13
        ]
      ]
    },
    {
      "id": "osm-road-1434881530-1",
      "name": "校园道路 150",
      "kind": "walkway",
      "points": [
        [
          825.31,
          -684.82
        ],
        [
          827.01,
          -693.94
        ]
      ]
    },
    {
      "id": "osm-road-1434881531-1",
      "name": "校园道路 151",
      "kind": "walkway",
      "points": [
        [
          825.99,
          -702.13
        ],
        [
          769.09,
          -705.36
        ],
        [
          744.37,
          -712.04
        ],
        [
          719.25,
          -725.33
        ],
        [
          725.57,
          -746.3
        ],
        [
          701.84,
          -755.34
        ],
        [
          708.48,
          -773.28
        ]
      ]
    },
    {
      "id": "osm-road-1434881532-1",
      "name": "校园道路 152",
      "kind": "walkway",
      "points": [
        [
          700.2,
          -779.89
        ],
        [
          704.92,
          -771.94
        ],
        [
          708.48,
          -773.28
        ],
        [
          730.98,
          -781.71
        ],
        [
          738.84,
          -805.17
        ],
        [
          729.98,
          -827.07
        ],
        [
          727.28,
          -825.43
        ],
        [
          714.1,
          -817.45
        ],
        [
          700.2,
          -779.89
        ]
      ]
    },
    {
      "id": "osm-road-1434881533-1",
      "name": "校园道路 153",
      "kind": "walkway",
      "points": [
        [
          727.28,
          -825.43
        ],
        [
          733.06,
          -843.79
        ],
        [
          757.61,
          -836.05
        ],
        [
          762.2,
          -852.03
        ],
        [
          806.87,
          -838.9
        ],
        [
          804.16,
          -829.53
        ],
        [
          822.78,
          -824.82
        ],
        [
          841.85,
          -819.98
        ],
        [
          843.25,
          -824.79
        ],
        [
          904.5,
          -808.8
        ],
        [
          922.49,
          -805.73
        ],
        [
          941.92,
          -802.41
        ],
        [
          941.27,
          -799.1
        ],
        [
          959.4,
          -796.07
        ],
        [
          958.57,
          -786.84
        ],
        [
          961.08,
          -780.65
        ],
        [
          975,
          -774.47
        ],
        [
          993.72,
          -760.05
        ],
        [
          1006.07,
          -744.76
        ],
        [
          1005.98,
          -737.82
        ],
        [
          1020.45,
          -736.4
        ],
        [
          1043.62,
          -734.13
        ]
      ]
    },
    {
      "id": "osm-road-1434881534-1",
      "name": "校园道路 154",
      "kind": "walkway",
      "points": [
        [
          825.99,
          -702.13
        ],
        [
          834.55,
          -708.96
        ],
        [
          834.63,
          -724.95
        ],
        [
          827.73,
          -735.63
        ],
        [
          810.86,
          -748.03
        ],
        [
          803.68,
          -756.09
        ],
        [
          802.2,
          -770.45
        ]
      ]
    },
    {
      "id": "osm-road-1434881535-1",
      "name": "校园道路 155",
      "kind": "walkway",
      "points": [
        [
          725.57,
          -746.3
        ],
        [
          743.45,
          -741.86
        ],
        [
          760.73,
          -745.66
        ],
        [
          771.26,
          -754.8
        ],
        [
          783.32,
          -765.27
        ],
        [
          802.2,
          -770.45
        ],
        [
          810.96,
          -773.73
        ],
        [
          820.72,
          -790.28
        ],
        [
          820.22,
          -811.61
        ],
        [
          822.78,
          -824.82
        ],
        [
          833.81,
          -868.68
        ]
      ]
    },
    {
      "id": "osm-road-1434881540-1",
      "name": "校园道路 156",
      "kind": "walkway",
      "points": [
        [
          825.99,
          -702.13
        ],
        [
          865.76,
          -691.89
        ],
        [
          878.22,
          -685.27
        ],
        [
          893.77,
          -681.22
        ],
        [
          906.48,
          -695.08
        ],
        [
          923.64,
          -702.18
        ],
        [
          927.6,
          -693.69
        ],
        [
          934.2,
          -687.88
        ],
        [
          939.17,
          -679.15
        ],
        [
          942.58,
          -670.2
        ],
        [
          968.15,
          -683.59
        ],
        [
          980.99,
          -684.34
        ],
        [
          987.38,
          -684.71
        ],
        [
          988.65,
          -694.13
        ],
        [
          996.47,
          -694.01
        ],
        [
          997.7,
          -703.05
        ],
        [
          1017.4,
          -701.05
        ],
        [
          1040.62,
          -698.71
        ]
      ]
    },
    {
      "id": "osm-road-1434881541-1",
      "name": "校园道路 157",
      "kind": "walkway",
      "points": [
        [
          1022.75,
          -834.24
        ],
        [
          1025.83,
          -798.81
        ],
        [
          1024.07,
          -778.4
        ],
        [
          1020.45,
          -736.4
        ],
        [
          1017.4,
          -701.05
        ],
        [
          1017.14,
          -698.09
        ],
        [
          1016.35,
          -688.77
        ],
        [
          1009.77,
          -612.57
        ],
        [
          1001.69,
          -599.24
        ]
      ]
    },
    {
      "id": "osm-road-1443036552-1",
      "name": "校园道路 158",
      "kind": "walkway",
      "points": [
        [
          1085.81,
          -290.01
        ],
        [
          1071.65,
          -260.35
        ],
        [
          1049.54,
          -248.78
        ],
        [
          1028.59,
          -252.05
        ],
        [
          1015.05,
          -264.13
        ],
        [
          993.49,
          -269.65
        ],
        [
          976.46,
          -267.2
        ],
        [
          966.27,
          -257.46
        ],
        [
          958.52,
          -243.24
        ],
        [
          956.21,
          -233.86
        ]
      ]
    },
    {
      "id": "osm-road-1443036553-1",
      "name": "校园道路 159",
      "kind": "walkway",
      "points": [
        [
          976.43,
          -420.83
        ],
        [
          971.66,
          -405.02
        ],
        [
          964.67,
          -390.54
        ],
        [
          960.29,
          -372.58
        ],
        [
          969.04,
          -351.44
        ],
        [
          970.79,
          -320.74
        ],
        [
          966.22,
          -309.75
        ],
        [
          965.25,
          -307.42
        ],
        [
          967.87,
          -286.28
        ],
        [
          952.13,
          -258.48
        ],
        [
          956.21,
          -233.86
        ],
        [
          967.62,
          -206.75
        ],
        [
          969.63,
          -202
        ],
        [
          966.12,
          -171.59
        ],
        [
          949.21,
          -147.85
        ],
        [
          902.27,
          -139.16
        ],
        [
          857.36,
          -141.18
        ],
        [
          793.22,
          -156.53
        ],
        [
          740.73,
          -177.38
        ],
        [
          686.7,
          -208.94
        ],
        [
          684.21,
          -215.75
        ]
      ]
    },
    {
      "id": "osm-road-1443036554-1",
      "name": "校园道路 160",
      "kind": "walkway",
      "points": [
        [
          1028.59,
          -252.05
        ],
        [
          1004.78,
          -224.11
        ],
        [
          991.82,
          -208.89
        ],
        [
          982.4,
          -204.53
        ],
        [
          967.62,
          -206.75
        ]
      ]
    },
    {
      "id": "osm-road-1443036555-1",
      "name": "校园道路 161",
      "kind": "walkway",
      "points": [
        [
          1087.58,
          -155.09
        ],
        [
          1074.45,
          -174.13
        ],
        [
          1062.97,
          -185.99
        ],
        [
          1048.72,
          -190.08
        ],
        [
          1030.43,
          -190.76
        ],
        [
          1016.09,
          -200.06
        ],
        [
          1007.68,
          -207.56
        ],
        [
          1005.36,
          -220.26
        ],
        [
          1004.78,
          -224.11
        ],
        [
          994.55,
          -233.71
        ]
      ]
    },
    {
      "id": "osm-road-1443036560-1",
      "name": "尚美道",
      "kind": "primary",
      "points": [
        [
          389.81,
          -313.26
        ],
        [
          378.29,
          -318.43
        ],
        [
          346.28,
          -332.82
        ],
        [
          313.59,
          -347.5
        ],
        [
          136.02,
          -447.07
        ],
        [
          126.96,
          -453.96
        ],
        [
          120.56,
          -462.44
        ],
        [
          120.56,
          -467.74
        ]
      ]
    },
    {
      "id": "osm-road-1443039220-1",
      "name": "校园道路 163",
      "kind": "walkway",
      "points": [
        [
          462.49,
          -1046.61
        ],
        [
          452.51,
          -1018.53
        ]
      ]
    },
    {
      "id": "osm-road-1443039222-1",
      "name": "校园道路 164",
      "kind": "walkway",
      "points": [
        [
          966.22,
          -309.75
        ],
        [
          946.73,
          -323.69
        ],
        [
          920.79,
          -328.95
        ]
      ]
    },
    {
      "id": "osm-road-1443039223-1",
      "name": "校园道路 165",
      "kind": "walkway",
      "points": [
        [
          922.49,
          -805.73
        ],
        [
          920.81,
          -789.33
        ],
        [
          913.39,
          -773.32
        ],
        [
          911.75,
          -769.79
        ],
        [
          910.12,
          -756.98
        ],
        [
          923.41,
          -734.92
        ],
        [
          930.18,
          -721.92
        ],
        [
          931.06,
          -712.45
        ],
        [
          923.64,
          -702.18
        ]
      ]
    },
    {
      "id": "osm-road-1443039224-1",
      "name": "校园道路 166",
      "kind": "walkway",
      "points": [
        [
          942.58,
          -670.2
        ],
        [
          937.31,
          -663.78
        ]
      ]
    },
    {
      "id": "osm-road-1443039225-1",
      "name": "校园道路 167",
      "kind": "walkway",
      "points": [
        [
          937.31,
          -663.78
        ],
        [
          936.99,
          -652.9
        ]
      ]
    },
    {
      "id": "osm-road-1443039226-1",
      "name": "校园道路 168",
      "kind": "walkway",
      "points": [
        [
          936.99,
          -652.9
        ],
        [
          931.26,
          -639.15
        ]
      ]
    },
    {
      "id": "osm-road-1443039227-1",
      "name": "校园道路 169",
      "kind": "walkway",
      "points": [
        [
          980.99,
          -684.34
        ],
        [
          981.07,
          -678.01
        ],
        [
          978.24,
          -677.76
        ],
        [
          975.4,
          -665.98
        ],
        [
          971.92,
          -661.19
        ]
      ]
    },
    {
      "id": "osm-road-1443039228-1",
      "name": "校园道路 170",
      "kind": "walkway",
      "points": [
        [
          959.4,
          -796.07
        ],
        [
          1009.71,
          -787.97
        ],
        [
          1008.77,
          -779.8
        ],
        [
          1024.07,
          -778.4
        ]
      ]
    },
    {
      "id": "osm-road-1443039229-1",
      "name": "尚文路",
      "kind": "primary",
      "points": [
        [
          1086.25,
          -1292.33
        ],
        [
          1086.79,
          -1285.98
        ],
        [
          1085.18,
          -1275.38
        ],
        [
          1081.37,
          -1261.36
        ],
        [
          1051.93,
          -1153.26
        ],
        [
          1019.01,
          -1032.4
        ],
        [
          1013.93,
          -1013.1
        ],
        [
          991.5,
          -927.96
        ],
        [
          966.97,
          -834.82
        ]
      ]
    },
    {
      "id": "osm-road-1443039230-1",
      "name": "校园道路 172",
      "kind": "walkway",
      "points": [
        [
          902.51,
          -1065.03
        ],
        [
          844.22,
          -865.83
        ]
      ]
    },
    {
      "id": "osm-road-1443039231-1",
      "name": "校园道路 173",
      "kind": "walkway",
      "points": [
        [
          879.91,
          -1071.36
        ],
        [
          824.05,
          -871.36
        ]
      ]
    },
    {
      "id": "osm-road-1443039602-1",
      "name": "校园道路 174",
      "kind": "walkway",
      "points": [
        [
          346.28,
          -332.82
        ],
        [
          274.36,
          -321.28
        ],
        [
          233.21,
          -331.73
        ],
        [
          200.71,
          -359.37
        ],
        [
          167.51,
          -392.58
        ],
        [
          127.28,
          -405.35
        ],
        [
          89.4,
          -409.53
        ],
        [
          56.66,
          -427.66
        ],
        [
          45.05,
          -444.37
        ]
      ]
    },
    {
      "id": "osm-road-1443176149-1",
      "name": "尚德道",
      "kind": "primary",
      "points": [
        [
          1922.13,
          -68.29
        ],
        [
          2020.33,
          -58.1
        ],
        [
          2035.55,
          -60.89
        ],
        [
          2044,
          -64.82
        ]
      ]
    },
    {
      "id": "osm-road-1443176150-1",
      "name": "尚德道",
      "kind": "primary",
      "points": [
        [
          1696.74,
          -91.7
        ],
        [
          1909.69,
          -69.58
        ]
      ]
    },
    {
      "id": "osm-road-1444302743-1",
      "name": "校园道路 177",
      "kind": "walkway",
      "points": [
        [
          1468.83,
          -989.21
        ],
        [
          1471.89,
          -974.6
        ],
        [
          1481.48,
          -969.84
        ],
        [
          1485.51,
          -943.16
        ],
        [
          1481.6,
          -927.13
        ],
        [
          1475.05,
          -917.23
        ],
        [
          1462.05,
          -911.35
        ],
        [
          1462.94,
          -907.46
        ],
        [
          1454.49,
          -897.06
        ],
        [
          1438.09,
          -888.8
        ],
        [
          1415.54,
          -885.5
        ]
      ]
    },
    {
      "id": "osm-road-1444302744-1",
      "name": "校园道路 178",
      "kind": "walkway",
      "points": [
        [
          1488.35,
          -992.13
        ],
        [
          1490.07,
          -981.59
        ],
        [
          1488.23,
          -974.92
        ],
        [
          1481.48,
          -969.84
        ]
      ]
    },
    {
      "id": "osm-road-1444302747-1",
      "name": "校园道路 179",
      "kind": "walkway",
      "points": [
        [
          1454.49,
          -897.06
        ],
        [
          1472.17,
          -888.38
        ],
        [
          1479.98,
          -878.84
        ],
        [
          1484.28,
          -873.6
        ],
        [
          1527.62,
          -870.25
        ]
      ]
    },
    {
      "id": "osm-road-1444302748-1",
      "name": "校园道路 180",
      "kind": "walkway",
      "points": [
        [
          1479.98,
          -878.84
        ],
        [
          1464.74,
          -870.35
        ],
        [
          1453.25,
          -863.21
        ],
        [
          1448.21,
          -850.3
        ],
        [
          1449.22,
          -828.39
        ],
        [
          1453.44,
          -802.96
        ]
      ]
    },
    {
      "id": "osm-road-1444302750-1",
      "name": "校园道路 181",
      "kind": "walkway",
      "points": [
        [
          1466.48,
          -801.85
        ],
        [
          1470.41,
          -786.87
        ],
        [
          1483.75,
          -774.78
        ],
        [
          1510.03,
          -774.99
        ],
        [
          1534.85,
          -768.87
        ],
        [
          1562.95,
          -754.03
        ],
        [
          1588.54,
          -751.12
        ],
        [
          1617.67,
          -732.95
        ]
      ]
    },
    {
      "id": "osm-road-1444302751-1",
      "name": "校园道路 182",
      "kind": "walkway",
      "points": [
        [
          1599.7,
          -713.21
        ],
        [
          1600.02,
          -719.31
        ],
        [
          1606,
          -723.68
        ]
      ]
    },
    {
      "id": "osm-road-1444302752-1",
      "name": "校园道路 183",
      "kind": "walkway",
      "points": [
        [
          1606,
          -723.68
        ],
        [
          1617.67,
          -732.95
        ]
      ]
    },
    {
      "id": "osm-road-1444302753-1",
      "name": "校园道路 184",
      "kind": "walkway",
      "points": [
        [
          1617.67,
          -732.95
        ],
        [
          1636.03,
          -727.9
        ],
        [
          1654.39,
          -728.01
        ],
        [
          1670.91,
          -733.17
        ]
      ]
    },
    {
      "id": "osm-road-1444302754-1",
      "name": "校园道路 185",
      "kind": "walkway",
      "points": [
        [
          1670.91,
          -733.17
        ],
        [
          1691.35,
          -748.92
        ],
        [
          1702.17,
          -748.35
        ],
        [
          1715.29,
          -738.77
        ],
        [
          1715.06,
          -732.62
        ],
        [
          1707.59,
          -717.54
        ],
        [
          1704.58,
          -706.83
        ],
        [
          1705.74,
          -699.68
        ],
        [
          1718.14,
          -689.32
        ],
        [
          1729.94,
          -682.39
        ],
        [
          1731.4,
          -665.19
        ]
      ]
    },
    {
      "id": "osm-road-1444302756-1",
      "name": "校园道路 186",
      "kind": "walkway",
      "points": [
        [
          1640.83,
          -787.07
        ],
        [
          1639.85,
          -761.83
        ],
        [
          1647.49,
          -747.37
        ],
        [
          1646.08,
          -739.39
        ],
        [
          1631.21,
          -736.89
        ],
        [
          1617.67,
          -732.95
        ]
      ]
    },
    {
      "id": "osm-road-1444302757-1",
      "name": "校园道路 187",
      "kind": "walkway",
      "points": [
        [
          1510.03,
          -774.99
        ],
        [
          1509.27,
          -758.65
        ]
      ]
    },
    {
      "id": "osm-road-1444302758-1",
      "name": "校园道路 188",
      "kind": "walkway",
      "points": [
        [
          1752.45,
          -720.4
        ],
        [
          1776.37,
          -716.59
        ]
      ]
    },
    {
      "id": "osm-road-1444302761-1",
      "name": "校园道路 189",
      "kind": "walkway",
      "points": [
        [
          1837.03,
          -797.74
        ],
        [
          1823.35,
          -803.03
        ],
        [
          1800.24,
          -807.38
        ],
        [
          1781.49,
          -821.79
        ],
        [
          1791.01,
          -837.83
        ],
        [
          1795.39,
          -856.14
        ],
        [
          1794.48,
          -893.79
        ],
        [
          1790.55,
          -920.79
        ],
        [
          1800.37,
          -945.1
        ],
        [
          1825.62,
          -971.92
        ]
      ]
    },
    {
      "id": "osm-road-1444302762-1",
      "name": "校园道路 190",
      "kind": "walkway",
      "points": [
        [
          1781.49,
          -821.79
        ],
        [
          1767.29,
          -814.59
        ]
      ]
    },
    {
      "id": "osm-road-1444302764-1",
      "name": "公能南道",
      "kind": "primary",
      "points": [
        [
          515.22,
          -590.64
        ],
        [
          523.48,
          -571.34
        ]
      ]
    },
    {
      "id": "osm-road-1444302765-1",
      "name": "公能南道",
      "kind": "primary",
      "points": [
        [
          468.7,
          -569.51
        ],
        [
          515.22,
          -590.64
        ]
      ]
    },
    {
      "id": "osm-road-1444302766-1",
      "name": "校园道路 193",
      "kind": "walkway",
      "points": [
        [
          690.11,
          -610.89
        ],
        [
          676.09,
          -612.92
        ],
        [
          661.46,
          -615.03
        ]
      ]
    },
    {
      "id": "osm-road-1444302767-1",
      "name": "校园道路 194",
      "kind": "walkway",
      "points": [
        [
          676.09,
          -612.92
        ],
        [
          670.21,
          -597.33
        ],
        [
          661.28,
          -584.86
        ],
        [
          647.81,
          -573.98
        ]
      ]
    },
    {
      "id": "osm-road-1444302768-1",
      "name": "校园道路 195",
      "kind": "walkway",
      "points": [
        [
          676.09,
          -612.92
        ],
        [
          680.67,
          -628.67
        ],
        [
          679.36,
          -653.22
        ],
        [
          672.94,
          -665.6
        ],
        [
          670.41,
          -670.49
        ],
        [
          651.12,
          -684.25
        ],
        [
          642.91,
          -688.07
        ]
      ]
    },
    {
      "id": "osm-road-1445212492-1",
      "name": "尚同路",
      "kind": "primary",
      "points": [
        [
          429.84,
          -1119.15
        ],
        [
          367.98,
          -1139.81
        ],
        [
          362.11,
          -1144.57
        ],
        [
          360.51,
          -1151.99
        ],
        [
          362.11,
          -1158.87
        ],
        [
          430.43,
          -1347.31
        ],
        [
          472.5,
          -1463.38
        ],
        [
          478.36,
          -1470.79
        ]
      ]
    },
    {
      "id": "osm-road-1445212493-1",
      "name": "校园道路 197",
      "kind": "walkway",
      "points": [
        [
          757.23,
          -364.7
        ],
        [
          783.9,
          -472.75
        ]
      ]
    },
    {
      "id": "osm-road-1447942465-1",
      "name": "校园道路 198",
      "kind": "walkway",
      "points": [
        [
          658.05,
          -135.64
        ],
        [
          693.28,
          -126.09
        ],
        [
          688.05,
          -105.65
        ],
        [
          755.5,
          -88.67
        ],
        [
          760.46,
          -109.18
        ],
        [
          791.46,
          -102.44
        ]
      ]
    },
    {
      "id": "osm-road-1447942466-1",
      "name": "校园道路 199",
      "kind": "walkway",
      "points": [
        [
          755.5,
          -88.67
        ],
        [
          752.6,
          -76.89
        ],
        [
          748.82,
          -62
        ],
        [
          780.88,
          -54.57
        ]
      ]
    },
    {
      "id": "osm-road-1448366780-1",
      "name": "同德路",
      "kind": "primary",
      "points": [
        [
          1170.15,
          -1407.98
        ],
        [
          1288.04,
          -1387.01
        ],
        [
          1297.79,
          -1385.17
        ],
        [
          1372.91,
          -1372.8
        ],
        [
          1421.66,
          -1366.13
        ],
        [
          1500.96,
          -1356.01
        ],
        [
          1592.81,
          -1345.49
        ],
        [
          1600.67,
          -1344.39
        ]
      ]
    },
    {
      "id": "osm-road-1448366781-1",
      "name": "敬慧路",
      "kind": "primary",
      "points": [
        [
          1593.56,
          -1351.68
        ],
        [
          1592.81,
          -1345.49
        ]
      ]
    },
    {
      "id": "osm-road-1448366782-1",
      "name": "同德路",
      "kind": "primary",
      "points": [
        [
          1593.56,
          -1351.68
        ],
        [
          1545.75,
          -1357.99
        ],
        [
          1477.77,
          -1365.95
        ],
        [
          1430.03,
          -1371.99
        ],
        [
          1372.39,
          -1380.63
        ],
        [
          1298.71,
          -1392.04
        ],
        [
          1288.65,
          -1393.97
        ],
        [
          1171.44,
          -1414.56
        ],
        [
          1158.11,
          -1417.05
        ]
      ]
    },
    {
      "id": "osm-road-1448581071-1",
      "name": "校园道路 203",
      "kind": "primary",
      "points": [
        [
          429.84,
          -1119.15
        ],
        [
          463.97,
          -1107.51
        ]
      ]
    },
    {
      "id": "osm-road-1448581072-1",
      "name": "尚勇路",
      "kind": "primary",
      "points": [
        [
          1578.56,
          -994.94
        ],
        [
          1589.7,
          -1120.31
        ],
        [
          1600.21,
          -1221.2
        ]
      ]
    },
    {
      "id": "osm-road-1449400250-1",
      "name": "校园道路 205",
      "kind": "walkway",
      "points": [
        [
          111.34,
          -696.8
        ],
        [
          162.57,
          -678.35
        ],
        [
          190.71,
          -668.21
        ]
      ]
    },
    {
      "id": "osm-road-1449400252-1",
      "name": "校园道路 206",
      "kind": "walkway",
      "points": [
        [
          922.58,
          -546.19
        ],
        [
          966.02,
          -535.52
        ]
      ]
    },
    {
      "id": "osm-road-1449403309-1",
      "name": "公能南道",
      "kind": "primary",
      "points": [
        [
          921.56,
          -435.64
        ],
        [
          947.17,
          -428.73
        ],
        [
          967.31,
          -423.3
        ],
        [
          976.43,
          -420.83
        ],
        [
          1013.15,
          -410.94
        ]
      ]
    },
    {
      "id": "osm-road-1449403310-1",
      "name": "同德路",
      "kind": "primary",
      "points": [
        [
          741.66,
          -1507.32
        ],
        [
          749.28,
          -1505.45
        ],
        [
          767.7,
          -1500.93
        ],
        [
          882.63,
          -1471.16
        ],
        [
          970.14,
          -1450.8
        ],
        [
          1075.6,
          -1427.26
        ],
        [
          1156.76,
          -1410.37
        ],
        [
          1170.15,
          -1407.98
        ]
      ]
    },
    {
      "id": "osm-road-1449405218-1",
      "name": "校园道路 209",
      "kind": "walkway",
      "points": [
        [
          1696.74,
          -91.7
        ],
        [
          1608.05,
          -82.26
        ],
        [
          1553.49,
          -67.32
        ],
        [
          1487.75,
          -62.63
        ],
        [
          1454.03,
          -70.09
        ],
        [
          1414.5,
          -87.38
        ],
        [
          1395.6,
          -91
        ],
        [
          1367.68,
          -90.79
        ],
        [
          1350.28,
          -101.88
        ],
        [
          1349.84,
          -121.09
        ],
        [
          1376.26,
          -142.64
        ],
        [
          1396.46,
          -149.04
        ],
        [
          1413,
          -175.28
        ],
        [
          1411.15,
          -200.19
        ],
        [
          1389.8,
          -212.84
        ],
        [
          1385.29,
          -228.84
        ],
        [
          1387.65,
          -248.04
        ],
        [
          1371.33,
          -262.34
        ],
        [
          1364.6,
          -272.79
        ]
      ]
    },
    {
      "id": "osm-road-1450306653-1",
      "name": "校园道路 210",
      "kind": "walkway",
      "points": [
        [
          852.53,
          -1105.93
        ],
        [
          812.07,
          -1117.17
        ],
        [
          797.09,
          -1139.39
        ],
        [
          780.87,
          -1163.46
        ],
        [
          785.06,
          -1185.52
        ],
        [
          776.87,
          -1196.05
        ],
        [
          777.16,
          -1228.53
        ]
      ]
    },
    {
      "id": "osm-road-1450306655-1",
      "name": "校园道路 211",
      "kind": "walkway",
      "points": [
        [
          777.16,
          -1228.53
        ],
        [
          781.94,
          -1254.02
        ],
        [
          787.34,
          -1261.17
        ],
        [
          824.69,
          -1251.26
        ],
        [
          902.56,
          -1230.58
        ],
        [
          893.69,
          -1196.42
        ]
      ]
    },
    {
      "id": "osm-road-1450306658-1",
      "name": "校园道路 212",
      "kind": "walkway",
      "points": [
        [
          369.63,
          -942.65
        ],
        [
          534.03,
          -888.65
        ]
      ]
    },
    {
      "id": "osm-road-1450306659-1",
      "name": "校园道路 213",
      "kind": "walkway",
      "points": [
        [
          355.96,
          -903.56
        ],
        [
          519.44,
          -847.74
        ]
      ]
    },
    {
      "id": "osm-road-1450905897-1",
      "name": "同砚路",
      "kind": "primary",
      "points": [
        [
          566.4,
          -141.5
        ],
        [
          545.1,
          -147.38
        ],
        [
          341.73,
          -219.29
        ],
        [
          335.13,
          -222
        ],
        [
          314.68,
          -229.81
        ]
      ]
    },
    {
      "id": "osm-road-1450905898-1",
      "name": "祥明路",
      "kind": "primary",
      "points": [
        [
          331.71,
          -193.53
        ],
        [
          336.04,
          -204.98
        ],
        [
          341.73,
          -219.29
        ]
      ]
    },
    {
      "id": "osm-road-1450905900-1",
      "name": "同砚路",
      "kind": "primary",
      "points": [
        [
          315.32,
          -213.78
        ],
        [
          329.38,
          -207.86
        ],
        [
          336.04,
          -204.98
        ],
        [
          490.18,
          -150.33
        ],
        [
          563.08,
          -128.86
        ]
      ]
    },
    {
      "id": "osm-road-1450905901-1",
      "name": "祥明路",
      "kind": "primary",
      "points": [
        [
          335.13,
          -222
        ],
        [
          329.38,
          -207.86
        ],
        [
          324.03,
          -193.03
        ]
      ]
    },
    {
      "id": "osm-road-1450905903-1",
      "name": "雅深路",
      "kind": "primary",
      "points": [
        [
          -60.83,
          -396.47
        ],
        [
          -57.74,
          -404.17
        ],
        [
          -56.2,
          -407.91
        ],
        [
          -50.85,
          -423.43
        ]
      ]
    },
    {
      "id": "osm-road-1450905906-1",
      "name": "雅深路",
      "kind": "primary",
      "points": [
        [
          -58.86,
          -427.73
        ],
        [
          -64.23,
          -411.81
        ],
        [
          -69.56,
          -400.37
        ]
      ]
    },
    {
      "id": "osm-road-1450905913-1",
      "name": "雅深路",
      "kind": "primary",
      "points": [
        [
          364.05,
          -1615.45
        ],
        [
          355.09,
          -1593.17
        ],
        [
          283.14,
          -1393.1
        ],
        [
          143.5,
          -1004.74
        ],
        [
          141.52,
          -999.52
        ],
        [
          133.52,
          -977.04
        ],
        [
          74.77,
          -804.05
        ],
        [
          -11.870000000000005,
          -557.71
        ],
        [
          -49.4,
          -455.79
        ],
        [
          -58.86,
          -427.73
        ]
      ]
    },
    {
      "id": "osm-road-1453043361-1",
      "name": "敬业南路",
      "kind": "primary",
      "points": [
        [
          1737.37,
          -555.02
        ],
        [
          1742.31,
          -609.24
        ],
        [
          1743.34,
          -620.4
        ],
        [
          1743.73,
          -624.7
        ],
        [
          1745.73,
          -646.76
        ],
        [
          1747.59,
          -667.17
        ],
        [
          1752.45,
          -720.4
        ],
        [
          1757.62,
          -777.15
        ]
      ]
    },
    {
      "id": "osm-road-1453043362-1",
      "name": "钟坛广场",
      "kind": "walkway",
      "points": [
        [
          1711.73,
          -656.57
        ],
        [
          1707.79,
          -650.69
        ],
        [
          1706.38,
          -635.86
        ],
        [
          1706.65,
          -628.29
        ],
        [
          1714.74,
          -620.6
        ],
        [
          1723.82,
          -620.6
        ],
        [
          1727.06,
          -618.19
        ],
        [
          1737.47,
          -610.4
        ],
        [
          1742.31,
          -609.24
        ],
        [
          1746.7,
          -606.26
        ],
        [
          1759.3,
          -607.39
        ],
        [
          1770.81,
          -615.08
        ],
        [
          1771.3,
          -622.27
        ],
        [
          1772.8,
          -644.3
        ],
        [
          1773.33,
          -652.04
        ],
        [
          1762.05,
          -662.42
        ],
        [
          1752.46,
          -667.26
        ],
        [
          1747.59,
          -667.17
        ],
        [
          1741.1,
          -667.05
        ],
        [
          1731.4,
          -665.19
        ],
        [
          1723.74,
          -663.72
        ],
        [
          1715.81,
          -663.72
        ],
        [
          1711.73,
          -656.57
        ]
      ]
    },
    {
      "id": "osm-road-1454468453-1",
      "name": "校园道路 223",
      "kind": "walkway",
      "points": [
        [
          2172.7,
          -1112.29
        ],
        [
          2154.84,
          -1126.58
        ],
        [
          2149.12,
          -1143.48
        ],
        [
          2142.17,
          -1171.39
        ],
        [
          2123.05,
          -1185.02
        ],
        [
          2096.41,
          -1178.87
        ],
        [
          2074.6,
          -1181.81
        ],
        [
          2045.26,
          -1230.74
        ],
        [
          2014.57,
          -1245.18
        ],
        [
          1978.69,
          -1240.13
        ],
        [
          1945.99,
          -1225.39
        ]
      ]
    },
    {
      "id": "osm-road-1454468456-1",
      "name": "校园道路 224",
      "kind": "secondary",
      "points": [
        [
          1808.41,
          -975.62
        ],
        [
          1835.84,
          -1256.87
        ]
      ]
    },
    {
      "id": "osm-road-1454468457-1",
      "name": "校园道路 225",
      "kind": "walkway",
      "points": [
        [
          1945.99,
          -1225.39
        ],
        [
          1917.36,
          -1223.21
        ],
        [
          1893.51,
          -1227.48
        ],
        [
          1869.95,
          -1241.93
        ],
        [
          1853.53,
          -1249.29
        ],
        [
          1835.84,
          -1256.87
        ],
        [
          1814.3,
          -1263.03
        ],
        [
          1759.23,
          -1258.56
        ],
        [
          1730.14,
          -1264.52
        ],
        [
          1705.09,
          -1276.1
        ],
        [
          1654.52,
          -1285.62
        ],
        [
          1628.07,
          -1278.85
        ],
        [
          1605.7,
          -1282.95
        ],
        [
          1592.97,
          -1285.28
        ],
        [
          1451.87,
          -1304.66
        ],
        [
          1416.99,
          -1306.03
        ],
        [
          1347.04,
          -1310
        ],
        [
          1326.04,
          -1314.82
        ],
        [
          1301.92,
          -1301.21
        ],
        [
          1289.98,
          -1293.88
        ]
      ]
    },
    {
      "id": "osm-road-1454468458-1",
      "name": "校园道路 226",
      "kind": "walkway",
      "points": [
        [
          1705.09,
          -1276.1
        ],
        [
          1656.12,
          -1267.53
        ],
        [
          1633.2,
          -1264.26
        ],
        [
          1605.7,
          -1282.95
        ]
      ]
    },
    {
      "id": "osm-road-1454468462-1",
      "name": "校园道路 227",
      "kind": "secondary",
      "points": [
        [
          1424.7,
          -1029.75
        ],
        [
          1451.84,
          -1011.58
        ],
        [
          1463.44,
          -1006.43
        ],
        [
          1474.45,
          -1003.64
        ],
        [
          1484.83,
          -1002.95
        ],
        [
          1497.42,
          -1002.96
        ],
        [
          1508.96,
          -1006.57
        ],
        [
          1520.73,
          -1012.17
        ],
        [
          1531.18,
          -1018.97
        ],
        [
          1541.02,
          -1027.86
        ],
        [
          1546.68,
          -1037.64
        ],
        [
          1551.75,
          -1047.61
        ],
        [
          1554.79,
          -1058.24
        ],
        [
          1556.1,
          -1069.86
        ],
        [
          1555.48,
          -1083.69
        ],
        [
          1550.39,
          -1125.73
        ],
        [
          1544.24,
          -1169.41
        ],
        [
          1541.48,
          -1182.61
        ],
        [
          1534.54,
          -1194.52
        ],
        [
          1524.43,
          -1206.1
        ],
        [
          1516.02,
          -1214.42
        ],
        [
          1505.15,
          -1221.98
        ],
        [
          1492.42,
          -1230.37
        ]
      ]
    },
    {
      "id": "osm-road-1454468463-1",
      "name": "校园道路 228",
      "kind": "secondary",
      "points": [
        [
          1550.39,
          -1125.73
        ],
        [
          1589.7,
          -1120.31
        ]
      ]
    },
    {
      "id": "osm-road-1454468464-1",
      "name": "校园道路 229",
      "kind": "walkway",
      "points": [
        [
          1424.7,
          -1029.75
        ],
        [
          1391.73,
          -995.28
        ]
      ]
    },
    {
      "id": "osm-road-1454468465-1",
      "name": "校园道路 230",
      "kind": "primary",
      "points": [
        [
          286.44,
          -1003.57
        ],
        [
          290.45,
          -1013.91
        ],
        [
          312.19,
          -1070.01
        ],
        [
          331.97,
          -1128.66
        ]
      ]
    },
    {
      "id": "osm-road-1456224169-1",
      "name": "校园道路 231",
      "kind": "secondary",
      "points": [
        [
          1497.42,
          -1002.96
        ],
        [
          1498.85,
          -993.62
        ]
      ]
    },
    {
      "id": "osm-road-1456224173-1",
      "name": "校园道路 232",
      "kind": "secondary",
      "points": [
        [
          1137.97,
          -1045.61
        ],
        [
          1168.69,
          -1036.52
        ],
        [
          1184.44,
          -1031.85
        ],
        [
          1190.84,
          -1035.36
        ],
        [
          1196.37,
          -1050.95
        ],
        [
          1203.01,
          -1111.11
        ],
        [
          1195.71,
          -1123.85
        ],
        [
          1172.28,
          -1132.62
        ]
      ]
    },
    {
      "id": "osm-road-1456224174-1",
      "name": "校园道路 233",
      "kind": "secondary",
      "points": [
        [
          1195.71,
          -1123.85
        ],
        [
          1168.69,
          -1036.52
        ]
      ]
    },
    {
      "id": "osm-road-1456224176-1",
      "name": "校园道路 234",
      "kind": "secondary",
      "points": [
        [
          1376.86,
          -1068.14
        ],
        [
          1347.42,
          -1063.37
        ],
        [
          1334.55,
          -1061.28
        ],
        [
          1332.34,
          -1058.41
        ],
        [
          1336.76,
          -1021.32
        ],
        [
          1339.42,
          -1018.45
        ],
        [
          1354.31,
          -1020.52
        ],
        [
          1385.69,
          -1024.89
        ]
      ]
    },
    {
      "id": "osm-road-1456224177-1",
      "name": "校园道路 235",
      "kind": "secondary",
      "points": [
        [
          1347.42,
          -1063.37
        ],
        [
          1354.31,
          -1020.52
        ]
      ]
    },
    {
      "id": "osm-road-1456224179-1",
      "name": "校园道路 236",
      "kind": "walkway",
      "points": [
        [
          1124.9,
          -1012.48
        ],
        [
          1234.57,
          -978.35
        ],
        [
          1277.38,
          -974.75
        ],
        [
          1392.54,
          -991.28
        ]
      ]
    },
    {
      "id": "osm-road-1456224180-1",
      "name": "校园道路 237",
      "kind": "walkway",
      "points": [
        [
          1402.12,
          -951.07
        ],
        [
          1415.35,
          -953.76
        ],
        [
          1430.57,
          -952.22
        ],
        [
          1442.44,
          -947.86
        ],
        [
          1444.5,
          -945.3
        ],
        [
          1438.56,
          -940.18
        ],
        [
          1435.21,
          -932.49
        ],
        [
          1435.73,
          -924.81
        ],
        [
          1437.53,
          -918.15
        ],
        [
          1443.73,
          -912.51
        ],
        [
          1451.71,
          -910.21
        ],
        [
          1462.05,
          -911.35
        ]
      ]
    },
    {
      "id": "osm-road-1456224181-1",
      "name": "校园道路 238",
      "kind": "walkway",
      "points": [
        [
          1485.51,
          -943.16
        ],
        [
          1491.69,
          -937.36
        ],
        [
          1501.49,
          -931.48
        ],
        [
          1510.77,
          -927.63
        ],
        [
          1532.42,
          -927.1
        ]
      ]
    },
    {
      "id": "osm-road-1456225058-1",
      "name": "校园道路 239",
      "kind": "primary",
      "points": [
        [
          799.37,
          -230.71
        ],
        [
          788.73,
          -233.27
        ],
        [
          680.03,
          -260.94
        ],
        [
          602.84,
          -281.16
        ]
      ]
    },
    {
      "id": "osm-road-1456225059-1",
      "name": "校园道路 240",
      "kind": "primary",
      "points": [
        [
          888.49,
          -206.75
        ],
        [
          799.37,
          -230.71
        ],
        [
          832.32,
          -345.08
        ]
      ]
    },
    {
      "id": "osm-road-1456225060-1",
      "name": "校园道路 241",
      "kind": "walkway",
      "points": [
        [
          422.65,
          -300.45
        ],
        [
          459.78,
          -243.34
        ],
        [
          466.74,
          -237.81
        ],
        [
          483.45,
          -229.51
        ],
        [
          504.79,
          -226.74
        ],
        [
          562.35,
          -250.03
        ]
      ]
    },
    {
      "id": "osm-road-1456226520-1",
      "name": "校园道路 242",
      "kind": "secondary",
      "points": [
        [
          563.3,
          -1235.93
        ],
        [
          536.17,
          -1157.41
        ],
        [
          523.81,
          -1121.64
        ]
      ]
    },
    {
      "id": "osm-road-1457544220-1",
      "name": "校园道路 243",
      "kind": "walkway",
      "points": [
        [
          1229.84,
          -563.43
        ],
        [
          1252.82,
          -818.6
        ]
      ]
    },
    {
      "id": "osm-road-1457544221-1",
      "name": "校园道路 244",
      "kind": "walkway",
      "points": [
        [
          1210.4,
          -565.01
        ],
        [
          1232.2,
          -820.19
        ]
      ]
    },
    {
      "id": "osm-road-1457544222-1",
      "name": "校园道路 245",
      "kind": "walkway",
      "points": [
        [
          1252.82,
          -818.6
        ],
        [
          1265.22,
          -963.81
        ]
      ]
    },
    {
      "id": "osm-road-1457544223-1",
      "name": "校园道路 246",
      "kind": "walkway",
      "points": [
        [
          1205.43,
          -620.99
        ],
        [
          1206.59,
          -634.41
        ],
        [
          1219.44,
          -781.75
        ]
      ]
    },
    {
      "id": "osm-road-1457544226-1",
      "name": "校园道路 247",
      "kind": "walkway",
      "points": [
        [
          1246.08,
          -618.82
        ],
        [
          1260.08,
          -779.57
        ]
      ]
    },
    {
      "id": "osm-road-1458201946-1",
      "name": "校园道路 248",
      "kind": "walkway",
      "points": [
        [
          1023.2,
          -508.88
        ],
        [
          1116.41,
          -500.94
        ],
        [
          1111.74,
          -447
        ],
        [
          1163.04,
          -442.62
        ],
        [
          1256.46,
          -434.64
        ],
        [
          1302.8,
          -430.7
        ],
        [
          1307.48,
          -484.79
        ],
        [
          1409.44,
          -476.07
        ]
      ]
    },
    {
      "id": "osm-road-1458201947-1",
      "name": "校园道路 249",
      "kind": "walkway",
      "points": [
        [
          1155.44,
          -356.34
        ],
        [
          1148.8,
          -283.35
        ]
      ]
    },
    {
      "id": "osm-road-1458201948-1",
      "name": "校园道路 250",
      "kind": "walkway",
      "points": [
        [
          1163.04,
          -442.62
        ],
        [
          1159.54,
          -403.93
        ],
        [
          1157.92,
          -385.97
        ],
        [
          1157.55,
          -381.89
        ]
      ]
    },
    {
      "id": "osm-road-1458201950-1",
      "name": "校园道路 251",
      "kind": "walkway",
      "points": [
        [
          1256.46,
          -434.64
        ],
        [
          1253.07,
          -395.25
        ],
        [
          1251.19,
          -373.53
        ]
      ]
    },
    {
      "id": "osm-road-1458201951-1",
      "name": "校园道路 252",
      "kind": "walkway",
      "points": [
        [
          1249.09,
          -347.98
        ],
        [
          1242.72,
          -275.03
        ]
      ]
    },
    {
      "id": "osm-road-1458201953-1",
      "name": "校园道路 253",
      "kind": "walkway",
      "points": [
        [
          1159.54,
          -403.93
        ],
        [
          1253.07,
          -395.25
        ]
      ]
    },
    {
      "id": "osm-road-1458201954-1",
      "name": "校园道路 254",
      "kind": "walkway",
      "points": [
        [
          1253.07,
          -395.25
        ],
        [
          1402.67,
          -382.38
        ]
      ]
    },
    {
      "id": "osm-road-1458201955-1",
      "name": "校园道路 255",
      "kind": "walkway",
      "points": [
        [
          1012.56,
          -399.39
        ],
        [
          1157.92,
          -385.97
        ]
      ]
    },
    {
      "id": "osm-road-1487701416-1",
      "name": "校园道路 256",
      "kind": "walkway",
      "points": [
        [
          598.8,
          -562.05
        ],
        [
          596.75,
          -555.92
        ],
        [
          595.5,
          -552.15
        ],
        [
          586.74,
          -525.92
        ]
      ]
    },
    {
      "id": "osm-road-1487701418-1",
      "name": "校园道路 257",
      "kind": "walkway",
      "points": [
        [
          645.65,
          -557.82
        ],
        [
          625.53,
          -552.55
        ],
        [
          598,
          -551.59
        ],
        [
          595.5,
          -552.15
        ],
        [
          558.92,
          -563.62
        ],
        [
          552.13,
          -565.74
        ],
        [
          536.75,
          -597.31
        ],
        [
          542.87,
          -602.51
        ],
        [
          542.55,
          -607.23
        ],
        [
          546.65,
          -609.38
        ],
        [
          544.4,
          -631.93
        ],
        [
          528.22,
          -652.08
        ],
        [
          525.96,
          -652.8
        ],
        [
          509.63,
          -657.99
        ],
        [
          497,
          -683.17
        ],
        [
          505.48,
          -707.2
        ],
        [
          516.59,
          -709.1
        ],
        [
          531.36,
          -711.62
        ],
        [
          555.43,
          -703.72
        ],
        [
          564.52,
          -704.04
        ],
        [
          587.37,
          -721.14
        ],
        [
          588.47,
          -721.31
        ],
        [
          601.06,
          -723.14
        ],
        [
          615.55,
          -716.5
        ],
        [
          629.55,
          -692.6
        ],
        [
          642.91,
          -688.07
        ]
      ]
    },
    {
      "id": "osm-road-1487701419-1",
      "name": "校园道路 258",
      "kind": "walkway",
      "points": [
        [
          598.07,
          -572.81
        ],
        [
          596.55,
          -571.62
        ],
        [
          595.48,
          -570.02
        ],
        [
          594.99,
          -568.15
        ],
        [
          595.12,
          -566.24
        ],
        [
          595.85,
          -564.46
        ],
        [
          597.13,
          -563.01
        ],
        [
          598.8,
          -562.05
        ],
        [
          600.77,
          -561.65
        ],
        [
          602.76,
          -561.93
        ],
        [
          604.55,
          -562.84
        ],
        [
          605.93,
          -564.29
        ],
        [
          606.75,
          -566.12
        ],
        [
          606.91,
          -568.11
        ],
        [
          606.4,
          -570.04
        ],
        [
          605.28,
          -571.7
        ],
        [
          603.67,
          -572.89
        ],
        [
          601.83,
          -573.48
        ],
        [
          599.89,
          -573.45
        ],
        [
          598.07,
          -572.81
        ]
      ]
    },
    {
      "id": "osm-road-1487701420-1",
      "name": "校园道路 259",
      "kind": "walkway",
      "points": [
        [
          525.96,
          -652.8
        ],
        [
          527.38,
          -667.27
        ],
        [
          530.89,
          -675.81
        ],
        [
          527.02,
          -684.57
        ],
        [
          531.62,
          -696.83
        ],
        [
          527.5,
          -702.6
        ],
        [
          520.13,
          -702.23
        ],
        [
          516.59,
          -709.1
        ]
      ]
    },
    {
      "id": "osm-road-1487701425-1",
      "name": "校园道路 260",
      "kind": "secondary",
      "points": [
        [
          609.54,
          -936.73
        ],
        [
          603.87,
          -919.7
        ]
      ]
    },
    {
      "id": "osm-road-1487701426-1",
      "name": "校园道路 261",
      "kind": "secondary",
      "points": [
        [
          554.22,
          -777.73
        ],
        [
          547.96,
          -761.08
        ]
      ]
    },
    {
      "id": "osm-road-1489507057-1",
      "name": "西启广场",
      "kind": "walkway",
      "points": [
        [
          323.9,
          -874.71
        ],
        [
          252.57,
          -899.77
        ],
        [
          194,
          -920.37
        ],
        [
          211.95,
          -971.77
        ],
        [
          214.9,
          -980.23
        ],
        [
          233.04,
          -1032.14
        ],
        [
          290.45,
          -1013.91
        ],
        [
          331.52,
          -1000.86
        ],
        [
          364.42,
          -990.41
        ],
        [
          348.01,
          -943.56
        ],
        [
          338.78,
          -917.19
        ],
        [
          323.9,
          -874.71
        ]
      ]
    },
    {
      "id": "osm-road-1491172137-1",
      "name": "校园道路 263",
      "kind": "walkway",
      "points": [
        [
          99.66,
          -624.8
        ],
        [
          115.16,
          -628.46
        ],
        [
          129.72,
          -635.2
        ],
        [
          150.09,
          -652.94
        ],
        [
          159.21,
          -671.05
        ],
        [
          162.57,
          -678.35
        ],
        [
          164.64,
          -682.81
        ],
        [
          166.58,
          -702.85
        ],
        [
          165.28,
          -729.3
        ]
      ]
    },
    {
      "id": "osm-road-1491172138-1",
      "name": "校园道路 264",
      "kind": "walkway",
      "points": [
        [
          912.77,
          -1406.22
        ],
        [
          941.28,
          -1399.44
        ],
        [
          972.71,
          -1391.15
        ],
        [
          984.15,
          -1381.12
        ],
        [
          989.79,
          -1368.22
        ],
        [
          991.73,
          -1353.18
        ],
        [
          989.59,
          -1344.13
        ],
        [
          984.16,
          -1325.47
        ]
      ]
    },
    {
      "id": "osm-road-1491172140-1",
      "name": "校园道路 265",
      "kind": "walkway",
      "points": [
        [
          590.14,
          -1461.73
        ],
        [
          584.52,
          -1444.83
        ]
      ]
    },
    {
      "id": "osm-road-1491172317-1",
      "name": "校园道路 266",
      "kind": "primary",
      "points": [
        [
          222.4,
          -757.43
        ],
        [
          291.85,
          -732.46
        ],
        [
          325.91,
          -720.21
        ],
        [
          433.04,
          -681.7
        ],
        [
          442.1,
          -681.17
        ],
        [
          450.63,
          -682.76
        ],
        [
          474.05,
          -693.11
        ]
      ]
    },
    {
      "id": "osm-road-1491174611-1",
      "name": "校园道路 267",
      "kind": "walkway",
      "points": [
        [
          788.73,
          -233.27
        ],
        [
          778.03,
          -191.76
        ]
      ]
    },
    {
      "id": "osm-road-1491174821-1",
      "name": "校园道路 268",
      "kind": "walkway",
      "points": [
        [
          1389.8,
          -212.84
        ],
        [
          1359.94,
          -201.15
        ],
        [
          1354.17,
          -186.6
        ],
        [
          1351.9,
          -178.61
        ],
        [
          1332.11,
          -178
        ],
        [
          1322.01,
          -165.92
        ],
        [
          1318.09,
          -154.45
        ],
        [
          1298.71,
          -144.21
        ],
        [
          1286.14,
          -139.3
        ]
      ]
    },
    {
      "id": "osm-road-1491174822-1",
      "name": "校园道路 269",
      "kind": "walkway",
      "points": [
        [
          1351.9,
          -178.61
        ],
        [
          1363.65,
          -169.61
        ],
        [
          1369.43,
          -159.78
        ],
        [
          1376.26,
          -142.64
        ]
      ]
    },
    {
      "id": "osm-road-1498820818-1",
      "name": "校园道路 270",
      "kind": "walkway",
      "points": [
        [
          1013.93,
          -1013.1
        ],
        [
          1037.31,
          -997.81
        ],
        [
          1047.26,
          -974.5
        ],
        [
          1040.69,
          -962.05
        ],
        [
          1035.12,
          -951.28
        ],
        [
          1020,
          -939.91
        ],
        [
          997.62,
          -928.46
        ],
        [
          991.5,
          -927.96
        ]
      ]
    },
    {
      "id": "osm-road-1498820819-1",
      "name": "校园道路 271",
      "kind": "walkway",
      "points": [
        [
          1047.26,
          -974.5
        ],
        [
          1068.76,
          -984.96
        ],
        [
          1097.61,
          -990.99
        ],
        [
          1118.06,
          -995.19
        ]
      ]
    },
    {
      "id": "osm-road-1498820820-1",
      "name": "校园道路 272",
      "kind": "walkway",
      "points": [
        [
          1035.12,
          -951.28
        ],
        [
          1025.28,
          -925.18
        ],
        [
          1027.67,
          -913.33
        ],
        [
          1034.35,
          -904.14
        ],
        [
          1034.15,
          -881.42
        ],
        [
          1040.41,
          -865.51
        ],
        [
          1051.06,
          -854.64
        ],
        [
          1061.49,
          -851.07
        ]
      ]
    },
    {
      "id": "osm-road-1503563539-1",
      "name": "校园道路 273",
      "kind": "walkway",
      "points": [
        [
          832.32,
          -345.08
        ],
        [
          843.61,
          -384.96
        ],
        [
          862.47,
          -451.56
        ]
      ]
    },
    {
      "id": "osm-road-1503580743-1",
      "name": "校园道路 274",
      "kind": "walkway",
      "points": [
        [
          579.73,
          -749.6
        ],
        [
          587.37,
          -721.14
        ]
      ]
    },
    {
      "id": "osm-road-1507434833-1",
      "name": "校园道路 275",
      "kind": "primary",
      "points": [
        [
          680.9,
          -1107.94
        ],
        [
          588.06,
          -1139.62
        ],
        [
          536.17,
          -1157.41
        ]
      ]
    },
    {
      "id": "osm-road-1507434834-1",
      "name": "校园道路 276",
      "kind": "primary",
      "points": [
        [
          588.06,
          -1139.62
        ],
        [
          575.65,
          -1103.79
        ]
      ]
    },
    {
      "id": "osm-road-1530011338-1",
      "name": "校园道路 277",
      "kind": "walkway",
      "points": [
        [
          993.4,
          -1281.54
        ],
        [
          1081.37,
          -1261.36
        ]
      ]
    },
    {
      "id": "osm-road-1530011339-1",
      "name": "校园道路 278",
      "kind": "walkway",
      "points": [
        [
          993.4,
          -1281.54
        ],
        [
          980.04,
          -1235.33
        ],
        [
          943.96,
          -1246.69
        ]
      ]
    },
    {
      "id": "osm-road-1530011340-1",
      "name": "校园道路 279",
      "kind": "walkway",
      "points": [
        [
          949.98,
          -1269.93
        ],
        [
          839.31,
          -1300.75
        ],
        [
          824.69,
          -1251.26
        ]
      ]
    },
    {
      "id": "osm-road-1530011341-1",
      "name": "校园道路 280",
      "kind": "walkway",
      "points": [
        [
          768.86,
          -1299.96
        ],
        [
          771.4,
          -1276.53
        ],
        [
          781.94,
          -1254.02
        ]
      ]
    },
    {
      "id": "osm-road-1530053734-1",
      "name": "校园道路 281",
      "kind": "walkway",
      "points": [
        [
          638.03,
          -411.71
        ],
        [
          551.16,
          -431.59
        ]
      ]
    },
    {
      "id": "osm-road-1530084084-1",
      "name": "校园道路 282",
      "kind": "walkway",
      "points": [
        [
          1438.21,
          -1034.15
        ],
        [
          1424.7,
          -1029.75
        ]
      ]
    }
  ],
  "greens": [
    {
      "id": "osm-area-669743710",
      "name": "南开湖",
      "kind": "water",
      "polygon": [
        [
          1551.91,
          -623.54
        ],
        [
          1554.16,
          -618.22
        ],
        [
          1571.92,
          -624.38
        ],
        [
          1579.81,
          -630.25
        ],
        [
          1591.93,
          -630.54
        ],
        [
          1595.03,
          -626.61
        ],
        [
          1606.03,
          -628.29
        ],
        [
          1611.95,
          -626.34
        ],
        [
          1616.17,
          -620.45
        ],
        [
          1619.84,
          -614.86
        ],
        [
          1630.55,
          -617.09
        ],
        [
          1636.75,
          -616.25
        ],
        [
          1644.37,
          -625.5
        ],
        [
          1655.64,
          -629.7
        ],
        [
          1662.97,
          -629.41
        ],
        [
          1672.55,
          -629.13
        ],
        [
          1683.83,
          -628.29
        ],
        [
          1690.31,
          -622.7
        ],
        [
          1695.39,
          -619.34
        ],
        [
          1700.17,
          -619.61
        ],
        [
          1704.68,
          -629.13
        ],
        [
          1706.38,
          -635.86
        ],
        [
          1707.79,
          -650.69
        ],
        [
          1711.73,
          -656.57
        ],
        [
          1716.24,
          -666.65
        ],
        [
          1717.09,
          -675.88
        ],
        [
          1716.24,
          -682.04
        ],
        [
          1705.81,
          -692.68
        ],
        [
          1702.15,
          -701.08
        ],
        [
          1700.17,
          -708.92
        ],
        [
          1699.9,
          -715.92
        ],
        [
          1692.84,
          -719.84
        ],
        [
          1688.62,
          -715.63
        ],
        [
          1684.39,
          -716.48
        ],
        [
          1683.26,
          -712.84
        ],
        [
          1677.62,
          -708.92
        ],
        [
          1661.84,
          -704.72
        ],
        [
          1655.92,
          -708.92
        ],
        [
          1650.56,
          -707.81
        ],
        [
          1634.78,
          -707.81
        ],
        [
          1616.46,
          -713.12
        ],
        [
          1606.88,
          -717.32
        ],
        [
          1599.83,
          -721.79
        ],
        [
          1593.34,
          -724.88
        ],
        [
          1590.25,
          -724.88
        ],
        [
          1596.17,
          -719.28
        ],
        [
          1597.85,
          -716.48
        ],
        [
          1593.63,
          -712
        ],
        [
          1588.55,
          -709.48
        ],
        [
          1582.63,
          -709.48
        ],
        [
          1577.56,
          -714.24
        ],
        [
          1577,
          -719.56
        ],
        [
          1577.56,
          -724.04
        ],
        [
          1573.61,
          -727.12
        ],
        [
          1570.23,
          -723.76
        ],
        [
          1569.67,
          -715.92
        ],
        [
          1566.28,
          -713.4
        ],
        [
          1560.08,
          -711.16
        ],
        [
          1556.7,
          -708.92
        ],
        [
          1556.13,
          -705
        ],
        [
          1561.78,
          -693.81
        ],
        [
          1563.75,
          -684.29
        ],
        [
          1566.33,
          -679.34
        ],
        [
          1568.41,
          -673.35
        ],
        [
          1570.74,
          -662.28
        ],
        [
          1564.47,
          -643.15
        ]
      ]
    },
    {
      "id": "osm-area-768649892",
      "name": "景观水面 2",
      "kind": "water",
      "polygon": [
        [
          2023.98,
          1120.51
        ],
        [
          2029.6,
          1122.96
        ],
        [
          2031.71,
          1126.8
        ],
        [
          2032.41,
          1130.64
        ],
        [
          2034.6,
          1130.8
        ],
        [
          2037.34,
          1131
        ],
        [
          2038.39,
          1127.15
        ],
        [
          2040.86,
          1123.65
        ],
        [
          2047.54,
          1121.91
        ],
        [
          2057.16,
          980.19
        ],
        [
          2090.12,
          617.27
        ],
        [
          2110.08,
          377.94
        ],
        [
          2143.97,
          27.96
        ],
        [
          2161.6,
          -186.9
        ],
        [
          2179.25,
          -372.26
        ],
        [
          2204.31,
          -671.03
        ],
        [
          2214.53,
          -807.05
        ],
        [
          2217.77,
          -855.46
        ],
        [
          2222.41,
          -858.22
        ],
        [
          2222.41,
          -865.6
        ],
        [
          2218.7,
          -869.29
        ],
        [
          2246.09,
          -1154.22
        ],
        [
          2274.87,
          -1483.38
        ],
        [
          2294.83,
          -1708.81
        ],
        [
          2295.3,
          -1730.48
        ],
        [
          2291.12,
          -1741.54
        ],
        [
          2287.87,
          -1752.14
        ],
        [
          2289.73,
          -1762.28
        ],
        [
          2295.3,
          -1774.27
        ],
        [
          2300.86,
          -1827.29
        ],
        [
          2314.8,
          -2016.75
        ],
        [
          2319.43,
          -2091.89
        ],
        [
          2329.65,
          -2151.36
        ],
        [
          2343.58,
          -2320.99
        ],
        [
          2352.85,
          -2485.1
        ],
        [
          2372.48,
          -2686.72
        ],
        [
          2375.29,
          -2709.77
        ],
        [
          2370.51,
          -2711.27
        ],
        [
          2368.42,
          -2714.27
        ],
        [
          2367.95,
          -2718.19
        ],
        [
          2362.85,
          -2718.19
        ],
        [
          2361.69,
          -2714.27
        ],
        [
          2359.14,
          -2712.42
        ],
        [
          2353.33,
          -2710.58
        ],
        [
          2343.42,
          -2606.17
        ],
        [
          2344.63,
          -2577.28
        ],
        [
          2324.43,
          -2348.15
        ],
        [
          2309.47,
          -2182.82
        ],
        [
          2295.73,
          -2006.24
        ],
        [
          2281.19,
          -1829.27
        ],
        [
          2259.36,
          -1573.22
        ],
        [
          2238.75,
          -1325.2
        ],
        [
          2214.5,
          -1053.88
        ],
        [
          2195.52,
          -853.61
        ],
        [
          2176.11,
          -614.38
        ],
        [
          2150.25,
          -326.19
        ],
        [
          2120.34,
          14.6
        ],
        [
          2093.67,
          322.09
        ],
        [
          2079.53,
          470.61
        ],
        [
          2079.13,
          493.5
        ],
        [
          2054.47,
          786.15
        ]
      ]
    },
    {
      "id": "osm-area-768657102",
      "name": "马蹄湖",
      "kind": "water",
      "polygon": [
        [
          550.19,
          -586.03
        ],
        [
          552.02,
          -581.17
        ],
        [
          560.6,
          -582.08
        ],
        [
          567.64,
          -577.21
        ],
        [
          575.3,
          -568.08
        ],
        [
          583.58,
          -565.65
        ],
        [
          590.31,
          -566.57
        ],
        [
          592.15,
          -572.04
        ],
        [
          598.27,
          -575.38
        ],
        [
          602.86,
          -575.38
        ],
        [
          606.84,
          -571.13
        ],
        [
          608.38,
          -565.96
        ],
        [
          622.16,
          -564.14
        ],
        [
          633.19,
          -566.26
        ],
        [
          640.23,
          -573.87
        ],
        [
          642.68,
          -580.87
        ],
        [
          651.87,
          -587.25
        ],
        [
          658,
          -596.07
        ],
        [
          656.77,
          -607.02
        ],
        [
          657.38,
          -618.58
        ],
        [
          662.28,
          -625.58
        ],
        [
          668.41,
          -634.71
        ],
        [
          670.25,
          -642
        ],
        [
          670.55,
          -648.69
        ],
        [
          667.49,
          -654.48
        ],
        [
          661.98,
          -660.56
        ],
        [
          662.89,
          -668.46
        ],
        [
          668.72,
          -675.46
        ],
        [
          673.24,
          -677.73
        ],
        [
          671.47,
          -681.25
        ],
        [
          658.3,
          -674.86
        ],
        [
          651.57,
          -669.07
        ],
        [
          648.5,
          -659.95
        ],
        [
          648.19,
          -650.52
        ],
        [
          646.05,
          -643.83
        ],
        [
          641.15,
          -638.96
        ],
        [
          633.8,
          -636.53
        ],
        [
          622.46,
          -637.75
        ],
        [
          615.12,
          -642.31
        ],
        [
          611.75,
          -650.22
        ],
        [
          611.14,
          -658.73
        ],
        [
          615.73,
          -665.12
        ],
        [
          620.93,
          -669.68
        ],
        [
          626.76,
          -673.34
        ],
        [
          628.29,
          -677.6
        ],
        [
          625.53,
          -680.94
        ],
        [
          620.02,
          -679.11
        ],
        [
          611.44,
          -682.15
        ],
        [
          605.32,
          -687.03
        ],
        [
          600.42,
          -693.11
        ],
        [
          599.8,
          -696.76
        ],
        [
          601.95,
          -701.32
        ],
        [
          606.84,
          -703.15
        ],
        [
          603.48,
          -706.49
        ],
        [
          594.29,
          -706.8
        ],
        [
          587.56,
          -706.19
        ],
        [
          586.33,
          -697.98
        ],
        [
          584.49,
          -690.68
        ],
        [
          573.47,
          -685.5
        ],
        [
          562.75,
          -686.72
        ],
        [
          552.34,
          -684.59
        ],
        [
          544.68,
          -681.25
        ],
        [
          541.61,
          -678.21
        ],
        [
          548.66,
          -674.86
        ],
        [
          553.56,
          -675.46
        ],
        [
          557.85,
          -675.46
        ],
        [
          567.34,
          -671.81
        ],
        [
          571.02,
          -666.95
        ],
        [
          571.32,
          -660.87
        ],
        [
          567.34,
          -654.77
        ],
        [
          560.3,
          -649.61
        ],
        [
          557.85,
          -645.65
        ],
        [
          560.91,
          -638.96
        ],
        [
          562.75,
          -633.79
        ],
        [
          562.44,
          -626.8
        ],
        [
          558.46,
          -621.62
        ],
        [
          559.99,
          -613.72
        ],
        [
          561.52,
          -607.94
        ],
        [
          559.68,
          -601.85
        ],
        [
          556.32,
          -594.25
        ],
        [
          552.02,
          -590.9
        ]
      ]
    },
    {
      "id": "osm-area-768657110",
      "name": "景观水面 4",
      "kind": "water",
      "polygon": [
        [
          1749.17,
          -584.38
        ],
        [
          1748.47,
          -578.09
        ],
        [
          1759.02,
          -575.29
        ],
        [
          1764.29,
          -570.05
        ],
        [
          1764.65,
          -561.32
        ],
        [
          1759.73,
          -550.84
        ],
        [
          1756.56,
          -542.45
        ],
        [
          1755.15,
          -534.77
        ],
        [
          1758.67,
          -527.78
        ],
        [
          1772.74,
          -516.59
        ],
        [
          1774.15,
          -504.72
        ],
        [
          1768.17,
          -488.99
        ],
        [
          1767.82,
          -477.46
        ],
        [
          1771.68,
          -465.58
        ],
        [
          1770.98,
          -454.05
        ],
        [
          1768.87,
          -443.57
        ],
        [
          1771.33,
          -427.14
        ],
        [
          1766.06,
          -414.56
        ],
        [
          1762.54,
          -402.68
        ],
        [
          1762.89,
          -394.3
        ],
        [
          1770.98,
          -385.56
        ],
        [
          1784,
          -382.76
        ],
        [
          1790.33,
          -375.42
        ],
        [
          1794.56,
          -365.99
        ],
        [
          1798.78,
          -342.58
        ],
        [
          1804.4,
          -331.4
        ],
        [
          1814.25,
          -324.41
        ],
        [
          1829.39,
          -316.02
        ],
        [
          1840.64,
          -303.09
        ],
        [
          1849.44,
          -291.21
        ],
        [
          1859.64,
          -285.62
        ],
        [
          1877.23,
          -282.47
        ],
        [
          1893.76,
          -279.33
        ],
        [
          1914.52,
          -273.04
        ],
        [
          1923.67,
          -263.61
        ],
        [
          1931.76,
          -247.53
        ],
        [
          1927.19,
          -222.02
        ],
        [
          1927.19,
          -204.55
        ],
        [
          1929.65,
          -169.26
        ],
        [
          1927.89,
          -159.13
        ],
        [
          1927.53,
          -148.99
        ],
        [
          1932.81,
          -139.2
        ],
        [
          1932.81,
          -129.43
        ],
        [
          1926.83,
          -113.69
        ],
        [
          1916.99,
          -96.92
        ],
        [
          1912.05,
          -87.84
        ],
        [
          1912.41,
          -81.19
        ],
        [
          1912.05,
          -64.08
        ],
        [
          1905.73,
          -52.19
        ],
        [
          1905.73,
          -44.15
        ],
        [
          1909.24,
          -44.15
        ],
        [
          1909.24,
          -37.52
        ],
        [
          1918.03,
          -37.16
        ],
        [
          1917.69,
          -43.46
        ],
        [
          1922.61,
          -43.11
        ],
        [
          1918.74,
          -75.26
        ],
        [
          1923.67,
          -93.78
        ],
        [
          1929.65,
          -102.51
        ],
        [
          1939.15,
          -109.86
        ],
        [
          1951.81,
          -116.15
        ],
        [
          1961.66,
          -128.72
        ],
        [
          1968.34,
          -138.16
        ],
        [
          1976.09,
          -152.14
        ],
        [
          1977.49,
          -161.57
        ],
        [
          1973.27,
          -171.36
        ],
        [
          1962.72,
          -176.6
        ],
        [
          1955.68,
          -190.22
        ],
        [
          1943.02,
          -195.82
        ],
        [
          1935.63,
          -201.41
        ],
        [
          1935.28,
          -217.48
        ],
        [
          1941.6,
          -240.9
        ],
        [
          1946.54,
          -252.43
        ],
        [
          1946.54,
          -261.86
        ],
        [
          1938.44,
          -271.29
        ],
        [
          1915.58,
          -281.78
        ],
        [
          1897.98,
          -284.22
        ],
        [
          1876.18,
          -287.71
        ],
        [
          1861.04,
          -292.61
        ],
        [
          1852.95,
          -306.59
        ],
        [
          1840.29,
          -320.21
        ],
        [
          1822,
          -326.86
        ],
        [
          1808.63,
          -339.78
        ],
        [
          1805.81,
          -343.97
        ],
        [
          1801.59,
          -357.95
        ],
        [
          1799.48,
          -364.94
        ],
        [
          1798.78,
          -376.13
        ],
        [
          1797.37,
          -384.51
        ],
        [
          1788.58,
          -390.8
        ],
        [
          1778.02,
          -393.6
        ],
        [
          1770.63,
          -398.49
        ],
        [
          1767.12,
          -405.47
        ],
        [
          1768.87,
          -412.12
        ],
        [
          1773.1,
          -422.6
        ],
        [
          1776.26,
          -429.59
        ],
        [
          1775.55,
          -437.62
        ],
        [
          1775.55,
          -442.52
        ],
        [
          1778.37,
          -446.35
        ],
        [
          1786.81,
          -446.35
        ],
        [
          1792.44,
          -451.6
        ],
        [
          1795.26,
          -459.99
        ],
        [
          1792.44,
          -469.08
        ],
        [
          1789.63,
          -473.27
        ],
        [
          1787.17,
          -479.9
        ],
        [
          1785.41,
          -483.05
        ],
        [
          1779.07,
          -488.64
        ],
        [
          1777.32,
          -497.03
        ],
        [
          1778.72,
          -503.31
        ],
        [
          1779.78,
          -508.21
        ],
        [
          1778.37,
          -517.99
        ],
        [
          1772.74,
          -526.73
        ],
        [
          1767.12,
          -530.92
        ],
        [
          1764.65,
          -537.56
        ],
        [
          1764.29,
          -545.95
        ],
        [
          1766.06,
          -552.94
        ],
        [
          1770.28,
          -560.98
        ],
        [
          1770.63,
          -566.56
        ],
        [
          1770.63,
          -570.05
        ],
        [
          1767.82,
          -576.34
        ],
        [
          1760.78,
          -580.54
        ]
      ]
    },
    {
      "id": "osm-area-768657115",
      "name": "景观水面 5",
      "kind": "water",
      "polygon": [
        [
          1763.41,
          -758.17
        ],
        [
          1763.81,
          -751.75
        ],
        [
          1773.92,
          -753.76
        ],
        [
          1784.42,
          -762.58
        ],
        [
          1792.91,
          -770.61
        ],
        [
          1792.1,
          -783.05
        ],
        [
          1788.46,
          -794.3
        ],
        [
          1790.49,
          -806.34
        ],
        [
          1801.8,
          -813.96
        ],
        [
          1819.18,
          -823.6
        ],
        [
          1830.9,
          -830.82
        ],
        [
          1838.98,
          -844.46
        ],
        [
          1840.59,
          -857.71
        ],
        [
          1837.7,
          -863.73
        ],
        [
          1836.15,
          -866.94
        ],
        [
          1821.99,
          -879.67
        ],
        [
          1818.98,
          -884.28
        ],
        [
          1819.56,
          -892.46
        ],
        [
          1821.64,
          -899.95
        ],
        [
          1822.34,
          -904.92
        ],
        [
          1821.87,
          -917.01
        ],
        [
          1823.96,
          -925.66
        ],
        [
          1831.74,
          -934.42
        ],
        [
          1842.76,
          -940.07
        ],
        [
          1849.03,
          -943.41
        ],
        [
          1853.56,
          -948.36
        ],
        [
          1865.51,
          -972.69
        ],
        [
          1874.1,
          -984.33
        ],
        [
          1871.47,
          -985.73
        ],
        [
          1865.74,
          -981.57
        ],
        [
          1861.68,
          -974.99
        ],
        [
          1844.97,
          -949.4
        ],
        [
          1841.03,
          -946.64
        ],
        [
          1837.19,
          -944.68
        ],
        [
          1824.19,
          -942.72
        ],
        [
          1819.56,
          -940.41
        ],
        [
          1815.84,
          -935.57
        ],
        [
          1813.52,
          -926.47
        ],
        [
          1813.52,
          -916.78
        ],
        [
          1816.19,
          -904.22
        ],
        [
          1814.91,
          -897.88
        ],
        [
          1810.38,
          -892.12
        ],
        [
          1811.09,
          -880.19
        ],
        [
          1816.35,
          -866.94
        ],
        [
          1814.33,
          -840.85
        ],
        [
          1812.71,
          -831.63
        ],
        [
          1807.86,
          -827.2
        ],
        [
          1791.29,
          -815.97
        ],
        [
          1784.42,
          -803.93
        ],
        [
          1783.21,
          -792.69
        ],
        [
          1783.21,
          -778.24
        ],
        [
          1780.38,
          -769.01
        ],
        [
          1778.37,
          -763.79
        ],
        [
          1770.68,
          -759.38
        ]
      ]
    },
    {
      "id": "osm-area-768657116",
      "name": "景观水面 6",
      "kind": "water",
      "polygon": [
        [
          1271.22,
          -525.02
        ],
        [
          1270.15,
          -519.72
        ],
        [
          1280.81,
          -518.4
        ],
        [
          1290.68,
          -510.72
        ],
        [
          1298.68,
          -508.07
        ],
        [
          1304.01,
          -507.81
        ],
        [
          1311.47,
          -504.1
        ],
        [
          1321.61,
          -504.36
        ],
        [
          1335.47,
          -506.75
        ],
        [
          1342.67,
          -510.72
        ],
        [
          1344,
          -515.22
        ],
        [
          1343.21,
          -520.52
        ],
        [
          1345.07,
          -523.17
        ],
        [
          1352.53,
          -522.64
        ],
        [
          1362.94,
          -521.84
        ],
        [
          1372.26,
          -521.84
        ],
        [
          1381.59,
          -520.52
        ],
        [
          1394.12,
          -514.95
        ],
        [
          1398.66,
          -512.58
        ],
        [
          1398.39,
          -517.34
        ],
        [
          1389.86,
          -521.84
        ],
        [
          1381.32,
          -526.61
        ],
        [
          1372,
          -527.67
        ],
        [
          1365.86,
          -526.61
        ],
        [
          1358.67,
          -525.28
        ],
        [
          1348.54,
          -526.87
        ],
        [
          1341.07,
          -528.2
        ],
        [
          1334.93,
          -525.28
        ],
        [
          1334.93,
          -521.84
        ],
        [
          1338.14,
          -517.34
        ],
        [
          1337.87,
          -513.36
        ],
        [
          1327.21,
          -508.86
        ],
        [
          1312.54,
          -508.07
        ],
        [
          1303.21,
          -509.92
        ],
        [
          1296.55,
          -512.05
        ],
        [
          1291.74,
          -517.08
        ],
        [
          1286.95,
          -520.25
        ],
        [
          1285.62,
          -523.95
        ],
        [
          1287.21,
          -527.14
        ]
      ]
    },
    {
      "id": "osm-area-768657117",
      "name": "景观水面 7",
      "kind": "water",
      "polygon": [
        [
          1427.98,
          -508.07
        ],
        [
          1427.19,
          -501.98
        ],
        [
          1439.72,
          -502.78
        ],
        [
          1447.19,
          -498.8
        ],
        [
          1451.71,
          -503.57
        ],
        [
          1459.18,
          -505.16
        ],
        [
          1462.92,
          -505.42
        ],
        [
          1466.92,
          -517.08
        ],
        [
          1465.84,
          -523.17
        ],
        [
          1461.85,
          -526.61
        ],
        [
          1461.58,
          -534.02
        ],
        [
          1464.25,
          -541.17
        ],
        [
          1467.18,
          -553.09
        ],
        [
          1464.51,
          -575.59
        ],
        [
          1464.78,
          -583.54
        ],
        [
          1467.98,
          -588.57
        ],
        [
          1473.58,
          -591.48
        ],
        [
          1479.45,
          -597.31
        ],
        [
          1483.98,
          -599.96
        ],
        [
          1493.04,
          -599.7
        ],
        [
          1501.57,
          -596.78
        ],
        [
          1511.44,
          -594.4
        ],
        [
          1521.04,
          -594.4
        ],
        [
          1529.84,
          -599.17
        ],
        [
          1540.24,
          -607.37
        ],
        [
          1554.16,
          -618.22
        ],
        [
          1551.91,
          -623.54
        ],
        [
          1537.3,
          -611.35
        ],
        [
          1529.04,
          -603.14
        ],
        [
          1519.7,
          -598.64
        ],
        [
          1510.9,
          -597.84
        ],
        [
          1504.24,
          -599.17
        ],
        [
          1499.45,
          -603.67
        ],
        [
          1494.37,
          -607.11
        ],
        [
          1487.17,
          -607.11
        ],
        [
          1482.64,
          -605.79
        ],
        [
          1478.38,
          -601.54
        ],
        [
          1470.91,
          -594.93
        ],
        [
          1463.45,
          -590.43
        ],
        [
          1459.72,
          -585.14
        ],
        [
          1458.91,
          -578.78
        ],
        [
          1464.25,
          -554.94
        ],
        [
          1463.45,
          -548.86
        ],
        [
          1460.78,
          -546.2
        ],
        [
          1457.85,
          -544.88
        ],
        [
          1454.12,
          -537.47
        ],
        [
          1452.79,
          -530.84
        ],
        [
          1453.58,
          -526.61
        ],
        [
          1453.58,
          -521.58
        ],
        [
          1452.79,
          -517.34
        ],
        [
          1447.98,
          -512.84
        ],
        [
          1443.45,
          -509.92
        ],
        [
          1437.32,
          -509.92
        ],
        [
          1437.05,
          -507.28
        ]
      ]
    },
    {
      "id": "osm-area-768657120",
      "name": "景观水面 8",
      "kind": "water",
      "polygon": [
        [
          1042.22,
          -541.58
        ],
        [
          1041.52,
          -535.81
        ],
        [
          1050.57,
          -542.5
        ],
        [
          1058.24,
          -547.81
        ],
        [
          1070.53,
          -548.03
        ],
        [
          1076.8,
          -546.41
        ],
        [
          1085.16,
          -545.03
        ],
        [
          1093.28,
          -545.73
        ],
        [
          1097,
          -543.65
        ],
        [
          1097.92,
          -541.58
        ],
        [
          1097,
          -534.66
        ],
        [
          1098.16,
          -529.82
        ],
        [
          1107.44,
          -524.29
        ],
        [
          1118.58,
          -520.83
        ],
        [
          1131.12,
          -521.06
        ],
        [
          1143.41,
          -523.14
        ],
        [
          1151.31,
          -526.37
        ],
        [
          1155.95,
          -529.36
        ],
        [
          1161.06,
          -529.58
        ],
        [
          1169.64,
          -526.59
        ],
        [
          1169.88,
          -533.04
        ],
        [
          1159.67,
          -535.81
        ],
        [
          1153.86,
          -534.19
        ],
        [
          1148.29,
          -528.9
        ],
        [
          1139.7,
          -524.52
        ],
        [
          1130.18,
          -524.52
        ],
        [
          1120.21,
          -525.9
        ],
        [
          1109.99,
          -529.13
        ],
        [
          1103.5,
          -532.36
        ],
        [
          1101.63,
          -534.89
        ],
        [
          1103.03,
          -539.73
        ],
        [
          1105.36,
          -543.65
        ],
        [
          1105.36,
          -547.81
        ],
        [
          1102.57,
          -549.19
        ],
        [
          1097.46,
          -549.41
        ],
        [
          1087.94,
          -548.03
        ],
        [
          1082.61,
          -547.81
        ],
        [
          1073.09,
          -550.11
        ],
        [
          1064.5,
          -552.87
        ],
        [
          1057.77,
          -553.1
        ],
        [
          1053.59,
          -552.87
        ],
        [
          1049.19,
          -548.03
        ],
        [
          1046.86,
          -544.34
        ]
      ]
    },
    {
      "id": "osm-area-768657124",
      "name": "景观水面 9",
      "kind": "water",
      "polygon": [
        [
          385.85,
          -281.62
        ],
        [
          391.18,
          -280.29
        ],
        [
          391.53,
          -287.95
        ],
        [
          392.28,
          -293.25
        ],
        [
          393.15,
          -297.29
        ],
        [
          395.83,
          -303.8
        ],
        [
          401.45,
          -316.25
        ],
        [
          402.15,
          -321.73
        ],
        [
          401.39,
          -328.64
        ],
        [
          401.74,
          -335.33
        ],
        [
          402.73,
          -338.32
        ],
        [
          405.75,
          -342.99
        ],
        [
          413.92,
          -349.56
        ],
        [
          418.8,
          -354.4
        ],
        [
          422.52,
          -360.97
        ],
        [
          425.89,
          -365.5
        ],
        [
          424.13,
          -373.54
        ],
        [
          423.08,
          -380.87
        ],
        [
          424.13,
          -389.61
        ],
        [
          426.6,
          -395.9
        ],
        [
          439.62,
          -409.18
        ],
        [
          445.6,
          -421.05
        ],
        [
          448.76,
          -441.68
        ],
        [
          450.48,
          -465.53
        ],
        [
          454.2,
          -481.77
        ],
        [
          467.89,
          -499.64
        ],
        [
          471.95,
          -511.28
        ],
        [
          475.78,
          -529.49
        ],
        [
          478.91,
          -535.72
        ],
        [
          485.06,
          -540.33
        ],
        [
          494,
          -545.52
        ],
        [
          504.1,
          -553.36
        ],
        [
          513.5,
          -558.43
        ],
        [
          537.41,
          -568.34
        ],
        [
          543.4,
          -571.31
        ],
        [
          549.02,
          -574.81
        ],
        [
          552.02,
          -581.17
        ],
        [
          550.19,
          -586.03
        ],
        [
          542.51,
          -578.14
        ],
        [
          536.36,
          -574.11
        ],
        [
          515.6,
          -565.72
        ],
        [
          506.88,
          -561.77
        ],
        [
          494.47,
          -552.44
        ],
        [
          485.76,
          -546.67
        ],
        [
          472.99,
          -541.48
        ],
        [
          467.89,
          -535.14
        ],
        [
          464.94,
          -526.93
        ],
        [
          462.83,
          -514.7
        ],
        [
          464.59,
          -505.96
        ],
        [
          462.2,
          -500.68
        ],
        [
          457.91,
          -494.11
        ],
        [
          453.04,
          -488.12
        ],
        [
          451.57,
          -483.25
        ],
        [
          448.28,
          -473.36
        ],
        [
          445.95,
          -463.69
        ],
        [
          441.37,
          -453.21
        ],
        [
          439.96,
          -443.42
        ],
        [
          439.62,
          -434.69
        ],
        [
          437.5,
          -425.26
        ],
        [
          431.87,
          -414.76
        ],
        [
          422.02,
          -401.84
        ],
        [
          416.04,
          -394.51
        ],
        [
          413.23,
          -387.52
        ],
        [
          412.88,
          -378.07
        ],
        [
          412.88,
          -367.95
        ],
        [
          407.14,
          -362.53
        ],
        [
          402.49,
          -355.44
        ],
        [
          399.01,
          -349.04
        ],
        [
          397.33,
          -341.55
        ],
        [
          396.98,
          -335.96
        ],
        [
          397.4,
          -329.16
        ],
        [
          397.27,
          -323.86
        ],
        [
          396.23,
          -319.36
        ],
        [
          390.6,
          -306.74
        ],
        [
          389.21,
          -302.99
        ],
        [
          388.22,
          -298.78
        ],
        [
          387.69,
          -293.72
        ]
      ]
    },
    {
      "id": "osm-area-1328585384",
      "name": "足球场",
      "kind": "green",
      "polygon": [
        [
          477.87,
          -469.09
        ],
        [
          542.38,
          -452.3
        ],
        [
          515.57,
          -350.61
        ],
        [
          451.04,
          -367.4
        ]
      ]
    },
    {
      "id": "osm-area-1328585387",
      "name": "足球场",
      "kind": "green",
      "polygon": [
        [
          1439.29,
          -1162.13
        ],
        [
          1505.68,
          -1170.97
        ],
        [
          1519.69,
          -1067.03
        ],
        [
          1453.29,
          -1058.2
        ]
      ]
    },
    {
      "id": "osm-area-1376694361",
      "name": "景观水面 12",
      "kind": "water",
      "polygon": [
        [
          1901.86,
          -1141.43
        ],
        [
          1963.91,
          -1129.77
        ],
        [
          1994.91,
          -1108.49
        ],
        [
          1977.85,
          -1069.53
        ],
        [
          2008.3,
          -1063.4
        ],
        [
          2016.18,
          -1023.51
        ],
        [
          1987.42,
          -999.3
        ],
        [
          1931.22,
          -984.25
        ],
        [
          1908.32,
          -999.92
        ],
        [
          1892.5,
          -1000.47
        ],
        [
          1848.22,
          -1101.95
        ]
      ]
    },
    {
      "id": "osm-area-1412230610",
      "name": "西园",
      "kind": "green",
      "polygon": [
        [
          824.99,
          -696.45
        ],
        [
          769.09,
          -705.36
        ],
        [
          758.45,
          -707.05
        ],
        [
          724.17,
          -724.2
        ],
        [
          720.39,
          -726.37
        ],
        [
          674.48,
          -752.71
        ],
        [
          685.63,
          -784.92
        ],
        [
          722.1,
          -890.23
        ],
        [
          759.67,
          -880.2
        ],
        [
          964.15,
          -825.58
        ],
        [
          1042.03,
          -825.98
        ],
        [
          1032.25,
          -747.16
        ],
        [
          1021.05,
          -605.16
        ],
        [
          998.96,
          -610.78
        ],
        [
          987.17,
          -633.42
        ],
        [
          972.36,
          -649.26
        ],
        [
          929.67,
          -664.07
        ]
      ]
    },
    {
      "id": "osm-area-1412230611",
      "name": "校园绿地 14",
      "kind": "green",
      "polygon": [
        [
          769.76,
          -731.14
        ],
        [
          907.81,
          -696.95
        ],
        [
          983.99,
          -705.36
        ],
        [
          991,
          -736.52
        ],
        [
          989.9,
          -738.6
        ],
        [
          969.95,
          -776.42
        ],
        [
          971.85,
          -794.58
        ],
        [
          880.74,
          -809.83
        ],
        [
          815.88,
          -820.69
        ],
        [
          781.94,
          -830.44
        ],
        [
          773.04,
          -805.91
        ],
        [
          738.84,
          -805.17
        ],
        [
          730.98,
          -781.71
        ],
        [
          745.84,
          -751.38
        ]
      ]
    },
    {
      "id": "osm-area-1430904062",
      "name": "校园绿地 15",
      "kind": "green",
      "polygon": [
        [
          1844.46,
          -483.24
        ],
        [
          1804.51,
          -476.45
        ],
        [
          1787.04,
          -490.82
        ],
        [
          1787.44,
          -545.24
        ],
        [
          1798.16,
          -589.39
        ],
        [
          1819.76,
          -593.17
        ],
        [
          1822.15,
          -610.76
        ],
        [
          1848.67,
          -561.2
        ],
        [
          1849.27,
          -513.34
        ]
      ]
    },
    {
      "id": "osm-area-1430904063",
      "name": "校园绿地 16",
      "kind": "green",
      "polygon": [
        [
          1152.88,
          -268.78
        ],
        [
          1240.4,
          -262.01
        ],
        [
          1215.57,
          -190.83
        ],
        [
          1202.86,
          -196.2
        ],
        [
          1174.77,
          -198.19
        ],
        [
          1164.73,
          -196.2
        ]
      ]
    },
    {
      "id": "osm-area-1430904064",
      "name": "铸园",
      "kind": "green",
      "polygon": [
        [
          1256.48,
          -263.63
        ],
        [
          1229.53,
          -182.61
        ],
        [
          1271.47,
          -151.44
        ],
        [
          1283.75,
          -114.68
        ],
        [
          1294.82,
          -81.53
        ],
        [
          1298.75,
          -69.75
        ],
        [
          1445.21,
          -54.2
        ],
        [
          1451.1,
          -106.84
        ],
        [
          1438.94,
          -143.65
        ],
        [
          1439.59,
          -150.79
        ],
        [
          1446.88,
          -231.41
        ],
        [
          1458.56,
          -360.35
        ],
        [
          1416.01,
          -363.35
        ],
        [
          1406.35,
          -325.88
        ],
        [
          1391.87,
          -279.42
        ],
        [
          1342.08,
          -256.64
        ]
      ]
    },
    {
      "id": "osm-area-1430918550",
      "name": "陶园",
      "kind": "green",
      "polygon": [
        [
          1070.14,
          -95.34
        ],
        [
          985.6,
          -106.45
        ],
        [
          864.75,
          -130.16
        ],
        [
          870.11,
          -163.45
        ],
        [
          887.04,
          -173.5
        ],
        [
          891.32,
          -189.98
        ],
        [
          901.29,
          -228.31
        ],
        [
          950.24,
          -416.64
        ],
        [
          999.98,
          -403.97
        ],
        [
          1002.86,
          -323.58
        ],
        [
          1026.76,
          -289.46
        ],
        [
          1127.49,
          -274.86
        ],
        [
          1139.56,
          -262.26
        ],
        [
          1150.24,
          -187.1
        ],
        [
          1121.46,
          -176.27
        ],
        [
          1088.04,
          -147.45
        ]
      ]
    },
    {
      "id": "osm-area-1430918555",
      "name": "白棠花苑",
      "kind": "green",
      "polygon": [
        [
          1480.28,
          -385.32
        ],
        [
          1423.36,
          -389.97
        ],
        [
          1415.82,
          -397.05
        ],
        [
          1426.15,
          -547.22
        ],
        [
          1493.44,
          -560.79
        ]
      ]
    },
    {
      "id": "osm-area-1431157131",
      "name": "菊圃",
      "kind": "green",
      "polygon": [
        [
          1728.5,
          -368.32
        ],
        [
          1780.82,
          -358.45
        ],
        [
          1828.03,
          -376.53
        ],
        [
          1856.46,
          -422.28
        ],
        [
          1874.37,
          -585.57
        ],
        [
          1857.12,
          -605.79
        ],
        [
          1822.15,
          -610.76
        ],
        [
          1819.76,
          -593.17
        ],
        [
          1798.16,
          -589.39
        ],
        [
          1795.05,
          -607.98
        ],
        [
          1770.81,
          -615.08
        ],
        [
          1759.3,
          -607.39
        ],
        [
          1746.7,
          -606.26
        ]
      ]
    },
    {
      "id": "osm-area-1431157137",
      "name": "箴园",
      "kind": "green",
      "polygon": [
        [
          479.28,
          -685.98
        ],
        [
          476.55,
          -712.23
        ],
        [
          497.13,
          -768.27
        ],
        [
          528.46,
          -748.13
        ],
        [
          573.69,
          -733.05
        ],
        [
          578.7,
          -744.91
        ],
        [
          648.6,
          -719.28
        ],
        [
          702.23,
          -691.33
        ],
        [
          659.8,
          -518.4
        ],
        [
          553.75,
          -548.28
        ],
        [
          542.57,
          -558.85
        ],
        [
          505.16,
          -632.2
        ]
      ]
    },
    {
      "id": "osm-area-1434985866",
      "name": "校园绿地 22",
      "kind": "green",
      "polygon": [
        [
          870.11,
          -163.45
        ],
        [
          864.75,
          -130.16
        ],
        [
          710.47,
          -164.74
        ],
        [
          591.83,
          -201.68
        ],
        [
          493.52,
          -225.99
        ],
        [
          434.76,
          -253.98
        ],
        [
          358.95,
          -275.72
        ],
        [
          203.75,
          -341.85
        ],
        [
          50.37,
          -420.89
        ],
        [
          25.1,
          -445.19
        ],
        [
          113.03,
          -464.13
        ],
        [
          122.24,
          -451.5
        ],
        [
          309.21,
          -345.91
        ],
        [
          466.15,
          -280.67
        ],
        [
          643.92,
          -224.24
        ]
      ]
    },
    {
      "id": "osm-area-1434985867",
      "name": "校园绿地 23",
      "kind": "green",
      "polygon": [
        [
          113.03,
          -464.13
        ],
        [
          25.1,
          -445.19
        ],
        [
          24.03,
          -473.74
        ],
        [
          45.85,
          -556.43
        ],
        [
          74.55,
          -602.19
        ],
        [
          78.18,
          -637.91
        ],
        [
          176.48,
          -926.53
        ],
        [
          194,
          -920.37
        ],
        [
          290.4,
          -886.48
        ],
        [
          323.9,
          -874.71
        ],
        [
          335.58,
          -870.6
        ],
        [
          288.89,
          -740.92
        ],
        [
          216.78,
          -765.55
        ]
      ]
    },
    {
      "id": "osm-area-1434985868",
      "name": "校园绿地 24",
      "kind": "green",
      "polygon": [
        [
          377.86,
          -986.15
        ],
        [
          364.42,
          -990.41
        ],
        [
          331.52,
          -1000.86
        ],
        [
          290.45,
          -1013.91
        ],
        [
          233.04,
          -1032.14
        ],
        [
          218.28,
          -1036.83
        ],
        [
          388.95,
          -1524.9
        ],
        [
          441.89,
          -1553.8
        ],
        [
          504.13,
          -1526.11
        ],
        [
          594.65,
          -1507.64
        ],
        [
          711.27,
          -1462.66
        ],
        [
          696.4,
          -1409.44
        ],
        [
          490.82,
          -1481.76
        ],
        [
          465.11,
          -1470.56
        ],
        [
          381.97,
          -1231.12
        ],
        [
          350.57,
          -1141.43
        ],
        [
          421.69,
          -1116.53
        ]
      ]
    },
    {
      "id": "osm-area-1443176146",
      "name": "校园绿地 25",
      "kind": "green",
      "polygon": [
        [
          2064.23,
          -211.05
        ],
        [
          1944.6,
          -222.64
        ],
        [
          1949.21,
          -269.69
        ],
        [
          2068.85,
          -258.12
        ]
      ]
    },
    {
      "id": "osm-area-1443176147",
      "name": "药用植物园",
      "kind": "green",
      "polygon": [
        [
          2075.67,
          -197.16
        ],
        [
          2113.45,
          -193.84
        ],
        [
          2138.97,
          -480.84
        ],
        [
          2101.26,
          -484.16
        ]
      ]
    },
    {
      "id": "osm-area-1444302746",
      "name": "墨梅含香",
      "kind": "green",
      "polygon": [
        [
          1407.5,
          -968.61
        ],
        [
          1438.74,
          -812.82
        ],
        [
          1472.75,
          -810.4
        ],
        [
          1478.72,
          -876.66
        ],
        [
          1520.72,
          -873.94
        ],
        [
          1530.68,
          -989.06
        ]
      ]
    },
    {
      "id": "osm-area-1444302760",
      "name": "兰溪",
      "kind": "green",
      "polygon": [
        [
          1779.98,
          -968.54
        ],
        [
          1819.41,
          -965.09
        ],
        [
          1859.73,
          -945.88
        ],
        [
          1884.3,
          -926.61
        ],
        [
          1893.03,
          -914.06
        ],
        [
          1900.87,
          -887.17
        ],
        [
          1891.91,
          -774.52
        ],
        [
          1883.6,
          -670.12
        ],
        [
          1858.3,
          -648.23
        ],
        [
          1822.3,
          -650.83
        ],
        [
          1782.74,
          -653.68
        ],
        [
          1774.61,
          -654.27
        ],
        [
          1751.26,
          -672.04
        ],
        [
          1758.89,
          -750.72
        ]
      ]
    },
    {
      "id": "osm-area-1445212489",
      "name": "校园绿地 29",
      "kind": "green",
      "polygon": [
        [
          1803.02,
          -743.63
        ],
        [
          1866.28,
          -738.59
        ],
        [
          1861.03,
          -674.27
        ],
        [
          1824.75,
          -667.48
        ],
        [
          1797.21,
          -673.15
        ]
      ]
    },
    {
      "id": "osm-area-1445212494",
      "name": "校园绿地 30",
      "kind": "green",
      "polygon": [
        [
          740.72,
          -1445.88
        ],
        [
          731.58,
          -1401.02
        ],
        [
          1030.95,
          -1326.32
        ],
        [
          1044.11,
          -1373.46
        ],
        [
          937.93,
          -1402.3
        ]
      ]
    },
    {
      "id": "osm-area-1449405217",
      "name": "校园绿地 31",
      "kind": "green",
      "polygon": [
        [
          1451.1,
          -106.84
        ],
        [
          1445.21,
          -54.2
        ],
        [
          1889.23,
          -18.82
        ],
        [
          1900.52,
          -22.23
        ],
        [
          1908.24,
          -64.1
        ]
      ]
    },
    {
      "id": "osm-area-1449405224",
      "name": "校园绿地 32",
      "kind": "green",
      "polygon": [
        [
          1923.1,
          -61.08
        ],
        [
          1923.1,
          -19.21
        ],
        [
          2006.34,
          -3.64
        ],
        [
          2011.88,
          -52.18
        ]
      ]
    },
    {
      "id": "osm-area-1451036001",
      "name": "允园",
      "kind": "green",
      "polygon": [
        [
          719.49,
          -1093.47
        ],
        [
          743.5,
          -1077.55
        ],
        [
          742.07,
          -1039.22
        ],
        [
          717.85,
          -941.88
        ],
        [
          711.47,
          -916.24
        ],
        [
          703.18,
          -908.86
        ],
        [
          649.38,
          -929.75
        ],
        [
          653.19,
          -940.98
        ],
        [
          605.8,
          -956.84
        ],
        [
          601.99,
          -945.61
        ],
        [
          567.35,
          -959.42
        ],
        [
          588.52,
          -1025.3
        ],
        [
          624.26,
          -1049.72
        ],
        [
          640.95,
          -1057.39
        ]
      ]
    },
    {
      "id": "osm-area-1453043363",
      "name": "水墨端园",
      "kind": "green",
      "polygon": [
        [
          1736.72,
          -606.89
        ],
        [
          1733.25,
          -568.14
        ],
        [
          1722.14,
          -562.45
        ],
        [
          1516.37,
          -579.51
        ],
        [
          1426.12,
          -568.47
        ],
        [
          1430.04,
          -626.66
        ],
        [
          1441.79,
          -800.81
        ],
        [
          1751.21,
          -773.31
        ]
      ]
    },
    {
      "id": "osm-area-1454468450",
      "name": "景观水面 35",
      "kind": "water",
      "polygon": [
        [
          1980.62,
          -1193.04
        ],
        [
          1932.85,
          -1191.31
        ],
        [
          1922.7,
          -1202.93
        ],
        [
          1923.93,
          -1214.84
        ],
        [
          1972.4,
          -1230.32
        ],
        [
          1989.52,
          -1218.2
        ],
        [
          1997.26,
          -1206.11
        ]
      ]
    },
    {
      "id": "osm-area-1454468451",
      "name": "景观水面 36",
      "kind": "water",
      "polygon": [
        [
          1942.12,
          -1249.03
        ],
        [
          1926.28,
          -1227.73
        ],
        [
          1944.81,
          -1229.8
        ],
        [
          1961.66,
          -1235.65
        ],
        [
          1947.84,
          -1250.45
        ]
      ]
    },
    {
      "id": "osm-area-1454468455",
      "name": "校园绿地 37",
      "kind": "green",
      "polygon": [
        [
          2186.56,
          -1087
        ],
        [
          2089.8,
          -1170.89
        ],
        [
          1994.67,
          -1194.95
        ],
        [
          1997.26,
          -1206.11
        ],
        [
          1989.52,
          -1218.2
        ],
        [
          1947.57,
          -1259.91
        ],
        [
          2074.2,
          -1247.23
        ],
        [
          2199.91,
          -1233.57
        ],
        [
          2189.55,
          -1117.53
        ]
      ]
    },
    {
      "id": "osm-area-1454468459",
      "name": "校园绿地 38",
      "kind": "green",
      "polygon": [
        [
          1939.07,
          -1266.4
        ],
        [
          1922.29,
          -1226.88
        ],
        [
          1919.35,
          -1201.44
        ],
        [
          1509.03,
          -1239.11
        ],
        [
          1342.95,
          -1222.74
        ],
        [
          1298.17,
          -1252.22
        ],
        [
          1299.56,
          -1304.95
        ],
        [
          1301.76,
          -1330.79
        ],
        [
          1662.33,
          -1292.53
        ]
      ]
    },
    {
      "id": "osm-area-1454468868",
      "name": "景观水面 39",
      "kind": "water",
      "polygon": [
        [
          2000.34,
          -946.14
        ],
        [
          2057.42,
          -886.54
        ],
        [
          2071.76,
          -857.27
        ],
        [
          2109.47,
          -861.49
        ],
        [
          2131.24,
          -930.05
        ],
        [
          2100.71,
          -966.97
        ],
        [
          2013.88,
          -978.05
        ]
      ]
    },
    {
      "id": "osm-area-1456224131",
      "name": "网球场",
      "kind": "green",
      "polygon": [
        [
          1136.84,
          -1316.34
        ],
        [
          1146.31,
          -1314.01
        ],
        [
          1140.78,
          -1291.88
        ],
        [
          1131.31,
          -1294.21
        ]
      ]
    },
    {
      "id": "osm-area-1456224132",
      "name": "网球场",
      "kind": "green",
      "polygon": [
        [
          1154.51,
          -1311.86
        ],
        [
          1163.98,
          -1309.53
        ],
        [
          1158.45,
          -1287.39
        ],
        [
          1148.98,
          -1289.72
        ]
      ]
    },
    {
      "id": "osm-area-1456224133",
      "name": "网球场",
      "kind": "green",
      "polygon": [
        [
          1173.61,
          -1306.41
        ],
        [
          1183.09,
          -1304.07
        ],
        [
          1177.56,
          -1281.94
        ],
        [
          1168.09,
          -1284.27
        ]
      ]
    },
    {
      "id": "osm-area-1456224134",
      "name": "网球场",
      "kind": "green",
      "polygon": [
        [
          1191.76,
          -1301.9
        ],
        [
          1201.24,
          -1299.57
        ],
        [
          1195.71,
          -1277.44
        ],
        [
          1186.23,
          -1279.77
        ]
      ]
    },
    {
      "id": "osm-area-1456224135",
      "name": "排球场",
      "kind": "green",
      "polygon": [
        [
          1126.13,
          -1283.32
        ],
        [
          1134.54,
          -1280.92
        ],
        [
          1129.6,
          -1263.83
        ],
        [
          1121.2,
          -1266.22
        ]
      ]
    },
    {
      "id": "osm-area-1456224136",
      "name": "排球场",
      "kind": "green",
      "polygon": [
        [
          1138.12,
          -1280.39
        ],
        [
          1146.53,
          -1277.99
        ],
        [
          1141.59,
          -1260.89
        ],
        [
          1133.19,
          -1263.29
        ]
      ]
    },
    {
      "id": "osm-area-1456224137",
      "name": "排球场",
      "kind": "green",
      "polygon": [
        [
          1149.78,
          -1277.12
        ],
        [
          1158.19,
          -1274.72
        ],
        [
          1153.24,
          -1257.62
        ],
        [
          1144.84,
          -1260.01
        ]
      ]
    },
    {
      "id": "osm-area-1456224138",
      "name": "排球场",
      "kind": "green",
      "polygon": [
        [
          1161.31,
          -1273.86
        ],
        [
          1169.71,
          -1271.46
        ],
        [
          1164.77,
          -1254.35
        ],
        [
          1156.37,
          -1256.75
        ]
      ]
    },
    {
      "id": "osm-area-1456224139",
      "name": "排球场",
      "kind": "green",
      "polygon": [
        [
          1173.09,
          -1270.71
        ],
        [
          1181.5,
          -1268.31
        ],
        [
          1176.56,
          -1251.21
        ],
        [
          1168.15,
          -1253.6
        ]
      ]
    },
    {
      "id": "osm-area-1456224140",
      "name": "排球场",
      "kind": "green",
      "polygon": [
        [
          1185.68,
          -1267.32
        ],
        [
          1194.09,
          -1264.92
        ],
        [
          1189.15,
          -1247.82
        ],
        [
          1180.75,
          -1250.22
        ]
      ]
    },
    {
      "id": "osm-area-1456224142",
      "name": "篮球场",
      "kind": "green",
      "polygon": [
        [
          1105.92,
          -1243.52
        ],
        [
          1119.89,
          -1239.63
        ],
        [
          1112.74,
          -1213.26
        ],
        [
          1098.61,
          -1217.05
        ]
      ]
    },
    {
      "id": "osm-area-1456224143",
      "name": "篮球场",
      "kind": "green",
      "polygon": [
        [
          1122.58,
          -1238.96
        ],
        [
          1136.56,
          -1235.09
        ],
        [
          1129.41,
          -1208.71
        ],
        [
          1115.28,
          -1212.5
        ]
      ]
    },
    {
      "id": "osm-area-1456224144",
      "name": "篮球场",
      "kind": "green",
      "polygon": [
        [
          1139.49,
          -1234.09
        ],
        [
          1153.45,
          -1230.22
        ],
        [
          1146.3,
          -1203.84
        ],
        [
          1132.17,
          -1207.63
        ]
      ]
    },
    {
      "id": "osm-area-1456224145",
      "name": "篮球场",
      "kind": "green",
      "polygon": [
        [
          1155.99,
          -1229.62
        ],
        [
          1169.95,
          -1225.75
        ],
        [
          1162.81,
          -1199.36
        ],
        [
          1148.68,
          -1203.16
        ]
      ]
    },
    {
      "id": "osm-area-1456224146",
      "name": "篮球场",
      "kind": "green",
      "polygon": [
        [
          1097.71,
          -1214.25
        ],
        [
          1111.67,
          -1210.38
        ],
        [
          1104.53,
          -1183.99
        ],
        [
          1090.39,
          -1187.79
        ]
      ]
    },
    {
      "id": "osm-area-1456224147",
      "name": "篮球场",
      "kind": "green",
      "polygon": [
        [
          1114.6,
          -1209.89
        ],
        [
          1128.56,
          -1206.02
        ],
        [
          1121.42,
          -1179.64
        ],
        [
          1107.29,
          -1183.43
        ]
      ]
    },
    {
      "id": "osm-area-1456224148",
      "name": "篮球场",
      "kind": "green",
      "polygon": [
        [
          1131.49,
          -1205.41
        ],
        [
          1145.46,
          -1201.54
        ],
        [
          1138.31,
          -1175.16
        ],
        [
          1124.18,
          -1178.95
        ]
      ]
    },
    {
      "id": "osm-area-1456224149",
      "name": "篮球场",
      "kind": "green",
      "polygon": [
        [
          1147.73,
          -1200.41
        ],
        [
          1161.71,
          -1196.54
        ],
        [
          1154.56,
          -1170.16
        ],
        [
          1140.42,
          -1173.95
        ]
      ]
    },
    {
      "id": "osm-area-1456224150",
      "name": "篮球场",
      "kind": "green",
      "polygon": [
        [
          1089.84,
          -1186.07
        ],
        [
          1103.81,
          -1182.2
        ],
        [
          1096.66,
          -1155.82
        ],
        [
          1082.53,
          -1159.61
        ]
      ]
    },
    {
      "id": "osm-area-1456224151",
      "name": "篮球场",
      "kind": "green",
      "polygon": [
        [
          1106.21,
          -1181.07
        ],
        [
          1120.19,
          -1177.2
        ],
        [
          1113.04,
          -1150.82
        ],
        [
          1098.9,
          -1154.61
        ]
      ]
    },
    {
      "id": "osm-area-1456224152",
      "name": "篮球场",
      "kind": "green",
      "polygon": [
        [
          1123.1,
          -1176.6
        ],
        [
          1137.08,
          -1172.73
        ],
        [
          1129.93,
          -1146.34
        ],
        [
          1115.79,
          -1150.14
        ]
      ]
    },
    {
      "id": "osm-area-1456224153",
      "name": "篮球场",
      "kind": "green",
      "polygon": [
        [
          1139.74,
          -1171.98
        ],
        [
          1153.71,
          -1168.11
        ],
        [
          1146.56,
          -1141.73
        ],
        [
          1132.42,
          -1145.52
        ]
      ]
    },
    {
      "id": "osm-area-1456224155",
      "name": "排球场",
      "kind": "green",
      "polygon": [
        [
          1086.1,
          -1137.44
        ],
        [
          1094.5,
          -1135.05
        ],
        [
          1089.56,
          -1117.95
        ],
        [
          1081.16,
          -1120.35
        ]
      ]
    },
    {
      "id": "osm-area-1456224156",
      "name": "排球场",
      "kind": "green",
      "polygon": [
        [
          1097.47,
          -1134.06
        ],
        [
          1105.88,
          -1131.66
        ],
        [
          1100.94,
          -1114.56
        ],
        [
          1092.53,
          -1116.95
        ]
      ]
    },
    {
      "id": "osm-area-1456224157",
      "name": "排球场",
      "kind": "green",
      "polygon": [
        [
          1109.49,
          -1131
        ],
        [
          1117.9,
          -1128.6
        ],
        [
          1112.96,
          -1111.49
        ],
        [
          1104.56,
          -1113.89
        ]
      ]
    },
    {
      "id": "osm-area-1456224158",
      "name": "排球场",
      "kind": "green",
      "polygon": [
        [
          1121.19,
          -1127.45
        ],
        [
          1129.6,
          -1125.05
        ],
        [
          1124.66,
          -1107.94
        ],
        [
          1116.25,
          -1110.34
        ]
      ]
    },
    {
      "id": "osm-area-1456224159",
      "name": "排球场",
      "kind": "green",
      "polygon": [
        [
          1132.73,
          -1124.7
        ],
        [
          1141.14,
          -1122.3
        ],
        [
          1136.2,
          -1105.2
        ],
        [
          1127.79,
          -1107.6
        ]
      ]
    },
    {
      "id": "osm-area-1456224160",
      "name": "网球场",
      "kind": "green",
      "polygon": [
        [
          1067,
          -1112.24
        ],
        [
          1076.38,
          -1109.54
        ],
        [
          1070,
          -1087.65
        ],
        [
          1060.62,
          -1090.35
        ]
      ]
    },
    {
      "id": "osm-area-1456224161",
      "name": "网球场",
      "kind": "green",
      "polygon": [
        [
          1084.82,
          -1107.39
        ],
        [
          1094.21,
          -1104.73
        ],
        [
          1087.92,
          -1082.82
        ],
        [
          1078.53,
          -1085.47
        ]
      ]
    },
    {
      "id": "osm-area-1456224162",
      "name": "网球场",
      "kind": "green",
      "polygon": [
        [
          1102.89,
          -1102.06
        ],
        [
          1112.3,
          -1099.5
        ],
        [
          1106.25,
          -1077.5
        ],
        [
          1096.83,
          -1080.05
        ]
      ]
    },
    {
      "id": "osm-area-1456224163",
      "name": "网球场",
      "kind": "green",
      "polygon": [
        [
          1121.01,
          -1096.78
        ],
        [
          1130.42,
          -1094.21
        ],
        [
          1124.31,
          -1072.23
        ],
        [
          1114.9,
          -1074.81
        ]
      ]
    },
    {
      "id": "osm-area-1456224164",
      "name": "网球场",
      "kind": "green",
      "polygon": [
        [
          1057.19,
          -1076.66
        ],
        [
          1066.62,
          -1074.14
        ],
        [
          1060.68,
          -1052.11
        ],
        [
          1051.25,
          -1054.62
        ]
      ]
    },
    {
      "id": "osm-area-1456224165",
      "name": "网球场",
      "kind": "green",
      "polygon": [
        [
          1074.59,
          -1071.72
        ],
        [
          1084.02,
          -1069.21
        ],
        [
          1078.07,
          -1047.18
        ],
        [
          1068.64,
          -1049.69
        ]
      ]
    },
    {
      "id": "osm-area-1456224166",
      "name": "网球场",
      "kind": "green",
      "polygon": [
        [
          1093.2,
          -1066.39
        ],
        [
          1102.62,
          -1063.88
        ],
        [
          1096.68,
          -1041.85
        ],
        [
          1087.26,
          -1044.37
        ]
      ]
    },
    {
      "id": "osm-area-1456224167",
      "name": "网球场",
      "kind": "green",
      "polygon": [
        [
          1110.99,
          -1061.59
        ],
        [
          1120.41,
          -1059.07
        ],
        [
          1114.47,
          -1037.05
        ],
        [
          1105.04,
          -1039.55
        ]
      ]
    },
    {
      "id": "osm-area-1456226521",
      "name": "篮球场",
      "kind": "green",
      "polygon": [
        [
          565.28,
          -384.85
        ],
        [
          579.25,
          -380.97
        ],
        [
          572.1,
          -354.59
        ],
        [
          557.97,
          -358.38
        ]
      ]
    },
    {
      "id": "osm-area-1456226522",
      "name": "篮球场",
      "kind": "green",
      "polygon": [
        [
          573.27,
          -413.92
        ],
        [
          587.24,
          -410.05
        ],
        [
          580.1,
          -383.67
        ],
        [
          565.97,
          -387.46
        ]
      ]
    },
    {
      "id": "osm-area-1456226523",
      "name": "篮球场",
      "kind": "green",
      "polygon": [
        [
          548.39,
          -389.21
        ],
        [
          562.36,
          -385.34
        ],
        [
          555.21,
          -358.95
        ],
        [
          541.08,
          -362.74
        ]
      ]
    },
    {
      "id": "osm-area-1456226524",
      "name": "篮球场",
      "kind": "green",
      "polygon": [
        [
          556.6,
          -418.48
        ],
        [
          570.57,
          -414.6
        ],
        [
          563.42,
          -388.23
        ],
        [
          549.29,
          -392.02
        ]
      ]
    },
    {
      "id": "osm-area-1456226525",
      "name": "篮球场",
      "kind": "green",
      "polygon": [
        [
          540.52,
          -361.02
        ],
        [
          554.49,
          -357.15
        ],
        [
          547.34,
          -330.77
        ],
        [
          533.21,
          -334.56
        ]
      ]
    },
    {
      "id": "osm-area-1456226526",
      "name": "篮球场",
      "kind": "green",
      "polygon": [
        [
          556.9,
          -356.03
        ],
        [
          570.87,
          -352.16
        ],
        [
          563.72,
          -325.77
        ],
        [
          549.58,
          -329.57
        ]
      ]
    },
    {
      "id": "osm-area-1456226527",
      "name": "篮球场",
      "kind": "green",
      "polygon": [
        [
          573.79,
          -351.55
        ],
        [
          587.76,
          -347.68
        ],
        [
          580.62,
          -321.29
        ],
        [
          566.48,
          -325.09
        ]
      ]
    },
    {
      "id": "osm-area-1456226528",
      "name": "篮球场",
      "kind": "green",
      "polygon": [
        [
          582.17,
          -380.36
        ],
        [
          596.14,
          -376.49
        ],
        [
          588.99,
          -350.11
        ],
        [
          574.86,
          -353.9
        ]
      ]
    },
    {
      "id": "osm-area-1456226529",
      "name": "篮球场",
      "kind": "green",
      "polygon": [
        [
          590.17,
          -409.06
        ],
        [
          604.14,
          -405.19
        ],
        [
          596.99,
          -378.79
        ],
        [
          582.86,
          -382.59
        ]
      ]
    },
    {
      "id": "osm-area-1473410506",
      "name": "排球场",
      "kind": "green",
      "polygon": [
        [
          529.92,
          -323.11
        ],
        [
          539.88,
          -320.54
        ],
        [
          535.15,
          -302.4
        ],
        [
          525.19,
          -304.95
        ]
      ]
    },
    {
      "id": "osm-area-1473410507",
      "name": "排球场",
      "kind": "green",
      "polygon": [
        [
          543.41,
          -319.48
        ],
        [
          553.37,
          -316.92
        ],
        [
          548.65,
          -298.77
        ],
        [
          538.69,
          -301.33
        ]
      ]
    },
    {
      "id": "osm-area-1473410508",
      "name": "排球场",
      "kind": "green",
      "polygon": [
        [
          555.38,
          -316.33
        ],
        [
          565.34,
          -313.78
        ],
        [
          560.62,
          -295.62
        ],
        [
          550.66,
          -298.18
        ]
      ]
    },
    {
      "id": "osm-area-1473410509",
      "name": "排球场",
      "kind": "green",
      "polygon": [
        [
          568.57,
          -312.66
        ],
        [
          578.53,
          -310.1
        ],
        [
          573.81,
          -291.96
        ],
        [
          563.85,
          -294.51
        ]
      ]
    },
    {
      "id": "osm-area-1473410510",
      "name": "排球场",
      "kind": "green",
      "polygon": [
        [
          561.86,
          -287.17
        ],
        [
          571.82,
          -284.62
        ],
        [
          567.1,
          -266.46
        ],
        [
          557.14,
          -269.03
        ]
      ]
    },
    {
      "id": "osm-area-1473410511",
      "name": "排球场",
      "kind": "green",
      "polygon": [
        [
          523.21,
          -297.62
        ],
        [
          533.17,
          -295.06
        ],
        [
          528.44,
          -276.91
        ],
        [
          518.48,
          -279.46
        ]
      ]
    },
    {
      "id": "osm-area-1473410512",
      "name": "排球场",
      "kind": "green",
      "polygon": [
        [
          536.71,
          -293.98
        ],
        [
          546.67,
          -291.43
        ],
        [
          541.94,
          -273.28
        ],
        [
          531.98,
          -275.84
        ]
      ]
    },
    {
      "id": "osm-area-1473410513",
      "name": "排球场",
      "kind": "green",
      "polygon": [
        [
          548.68,
          -290.84
        ],
        [
          558.64,
          -288.29
        ],
        [
          553.91,
          -270.13
        ],
        [
          543.95,
          -272.7
        ]
      ]
    },
    {
      "id": "osm-area-1473410514",
      "name": "网球场",
      "kind": "green",
      "polygon": [
        [
          596.49,
          -499.84
        ],
        [
          609.67,
          -496.2
        ],
        [
          602.45,
          -470.41
        ],
        [
          589.27,
          -474.05
        ]
      ]
    },
    {
      "id": "osm-area-1473410515",
      "name": "网球场",
      "kind": "green",
      "polygon": [
        [
          568.04,
          -466.74
        ],
        [
          581.11,
          -463.21
        ],
        [
          573.87,
          -436.87
        ],
        [
          560.81,
          -440.41
        ]
      ]
    },
    {
      "id": "osm-area-1473410516",
      "name": "网球场",
      "kind": "green",
      "polygon": [
        [
          585.61,
          -461.69
        ],
        [
          598.68,
          -458.15
        ],
        [
          591.45,
          -431.82
        ],
        [
          578.37,
          -435.36
        ]
      ]
    },
    {
      "id": "osm-area-1473410517",
      "name": "网球场",
      "kind": "green",
      "polygon": [
        [
          577.6,
          -504.75
        ],
        [
          590.78,
          -501.1
        ],
        [
          583.57,
          -475.31
        ],
        [
          570.39,
          -478.95
        ]
      ]
    },
    {
      "id": "osm-area-1473410518",
      "name": "网球场",
      "kind": "green",
      "polygon": [
        [
          614.19,
          -495.31
        ],
        [
          627.37,
          -491.67
        ],
        [
          620.15,
          -465.88
        ],
        [
          606.97,
          -469.52
        ]
      ]
    },
    {
      "id": "osm-area-1489508107",
      "name": "校园绿地 97",
      "kind": "green",
      "polygon": [
        [
          499.38,
          -826.47
        ],
        [
          507.2,
          -849
        ],
        [
          357.92,
          -900.18
        ],
        [
          350.09,
          -877.69
        ]
      ]
    },
    {
      "id": "osm-area-1489508108",
      "name": "校园绿地 98",
      "kind": "green",
      "polygon": [
        [
          524.07,
          -899.52
        ],
        [
          532.78,
          -925.15
        ],
        [
          383.9,
          -975.07
        ],
        [
          375.2,
          -949.48
        ]
      ]
    },
    {
      "id": "osm-area-1507434822",
      "name": "校园绿地 99",
      "kind": "green",
      "polygon": [
        [
          629,
          -671.06
        ],
        [
          630.1,
          -666.39
        ],
        [
          626.58,
          -665.29
        ],
        [
          623.69,
          -663.27
        ],
        [
          621.45,
          -659.75
        ],
        [
          619.67,
          -655.73
        ],
        [
          620.51,
          -651.4
        ],
        [
          623.47,
          -646.74
        ],
        [
          630.3,
          -645.16
        ],
        [
          637,
          -645.53
        ],
        [
          640.3,
          -648.11
        ],
        [
          642.74,
          -652.3
        ],
        [
          643.11,
          -658.32
        ],
        [
          640.77,
          -665.43
        ],
        [
          644.26,
          -668.67
        ],
        [
          647.72,
          -660.87
        ],
        [
          647.25,
          -652.88
        ],
        [
          643.98,
          -645.84
        ],
        [
          637.67,
          -640.27
        ],
        [
          629.2,
          -639.46
        ],
        [
          622.34,
          -641.45
        ],
        [
          616.88,
          -645.82
        ],
        [
          614.9,
          -651.31
        ],
        [
          615.16,
          -657.97
        ],
        [
          617.78,
          -663.36
        ],
        [
          622.89,
          -667.79
        ]
      ]
    },
    {
      "id": "osm-area-1507434828",
      "name": "校园绿地 100",
      "kind": "green",
      "polygon": [
        [
          519.06,
          -1247.6
        ],
        [
          559.79,
          -1233.38
        ],
        [
          521.87,
          -1126.24
        ],
        [
          481.12,
          -1140.47
        ]
      ]
    },
    {
      "id": "osm-area-1507624145",
      "name": "校园绿地 101",
      "kind": "green",
      "polygon": [
        [
          1878.7,
          -405.8
        ],
        [
          1845.46,
          -359.31
        ],
        [
          1786.85,
          -335.42
        ],
        [
          1726.06,
          -337.15
        ],
        [
          1717.75,
          -245.05
        ],
        [
          1850.71,
          -238.11
        ],
        [
          1855.52,
          -260.7
        ],
        [
          1904.94,
          -258.52
        ],
        [
          1907.64,
          -272.45
        ],
        [
          1890.96,
          -277.49
        ],
        [
          1878.14,
          -279.17
        ],
        [
          1869.41,
          -293.76
        ]
      ]
    }
  ],
  "pois": [
    {
      "id": "poi-osm-building-616829077",
      "name": "南开大学津南校区中心图书馆",
      "type": "service",
      "position": [
        1215.335,
        -470.66499999999996
      ]
    },
    {
      "id": "poi-osm-building-616829078",
      "name": "综合业务西楼",
      "type": "service",
      "position": [
        1099.44,
        -398.745
      ]
    },
    {
      "id": "poi-osm-building-616829079",
      "name": "综合业务东楼",
      "type": "service",
      "position": [
        1316.855,
        -380.5725
      ]
    },
    {
      "id": "poi-osm-building-616829080",
      "name": "大通学生活动中心",
      "type": "service",
      "position": [
        1516.0604761904763,
        -676.8061904761905
      ]
    },
    {
      "id": "poi-osm-building-954128563",
      "name": "南开大学医院",
      "type": "service",
      "position": [
        772.9673333333335,
        -1331.6346666666666
      ]
    },
    {
      "id": "poi-osm-building-1412230608",
      "name": "学二食堂",
      "type": "service",
      "position": [
        716.92,
        -449.825
      ]
    },
    {
      "id": "poi-osm-building-1412230609",
      "name": "学一食堂",
      "type": "service",
      "position": [
        814.435,
        -1177.21
      ]
    },
    {
      "id": "poi-osm-building-1430918551",
      "name": "木斋图书馆",
      "type": "service",
      "position": [
        575.6862500000001,
        -848.6424999999999
      ]
    },
    {
      "id": "poi-osm-building-1450306651",
      "name": "法学院",
      "type": "service",
      "position": [
        799.411,
        -927.949
      ]
    }
  ]
}
